; ModuleID = 'ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !65, file: !66, line: 53, type: !7, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !121, globals: !386, nameTableKind: None)
!66 = !DIFile(filename: "src/install.c", directory: "/home/mbarbar/software/coreutils-8.31")
!67 = !{!68, !76, !83, !89, !95, !100}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !69, line: 30, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mbarbar/software/coreutils-8.31")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !77, line: 69, baseType: !70, size: 32, elements: !78)
!77 = !DIFile(filename: "src/copy.h", directory: "/home/mbarbar/software/coreutils-8.31")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !77, line: 60, baseType: !70, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !77, line: 26, baseType: !70, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !77, line: 47, baseType: !70, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !102, file: !101, line: 39, baseType: !70, size: 32, elements: !114)
!101 = !DIFile(filename: "./lib/savewd.h", directory: "/home/mbarbar/software/coreutils-8.31")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !101, line: 36, size: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !101, line: 66, baseType: !100, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !101, line: 74, baseType: !106, size: 32, offset: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !101, line: 69, size: 32, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !106, file: !101, line: 71, baseType: !7, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !106, file: !101, line: 72, baseType: !7, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !106, file: !101, line: 73, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !112, line: 97, baseType: !113)
!112 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 154, baseType: !7)
!114 = !{!115, !116, !117, !118, !119, !120}
!115 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!119 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!121 = !{!122, !9, !53, !127, !129, !131, !0, !180, !183, !185, !188, !191, !194, !197, !200, !203, !206, !7, !142, !209, !37, !210, !213, !216, !219, !231, !234, !237, !240, !243, !246, !249, !60, !140, !252, !255, !258, !261, !264, !267, !270, !139, !273, !276, !279, !282, !285, !288, !291, !304, !305, !308, !311, !314, !317, !320, !175, !55, !323, !334, !57, !128, !130, !342, !344, !347, !350, !353, !29, !356, !111, !359, !360, !363, !373, !376, !184, !379, !380, !383}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !123, line: 72, baseType: !124)
!123 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !7}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !112, line: 79, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !70)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !112, line: 64, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !70)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !179}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !132, file: !77, line: 100, baseType: !68, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !132, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !132, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !132, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !132, file: !77, line: 115, baseType: !139, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !112, line: 69, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !70)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !132, file: !77, line: 119, baseType: !142, size: 8, offset: 160)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !132, file: !77, line: 123, baseType: !142, size: 8, offset: 168)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !132, file: !77, line: 130, baseType: !142, size: 8, offset: 176)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !132, file: !77, line: 134, baseType: !142, size: 8, offset: 184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !132, file: !77, line: 138, baseType: !142, size: 8, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !132, file: !77, line: 141, baseType: !142, size: 8, offset: 200)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !132, file: !77, line: 145, baseType: !142, size: 8, offset: 208)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !132, file: !77, line: 152, baseType: !142, size: 8, offset: 216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !132, file: !77, line: 156, baseType: !142, size: 8, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !132, file: !77, line: 160, baseType: !142, size: 8, offset: 232)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !132, file: !77, line: 161, baseType: !142, size: 8, offset: 240)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !132, file: !77, line: 162, baseType: !142, size: 8, offset: 248)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !132, file: !77, line: 163, baseType: !142, size: 8, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !132, file: !77, line: 166, baseType: !142, size: 8, offset: 264)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !132, file: !77, line: 178, baseType: !142, size: 8, offset: 272)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !132, file: !77, line: 182, baseType: !142, size: 8, offset: 280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !132, file: !77, line: 188, baseType: !142, size: 8, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !132, file: !77, line: 192, baseType: !142, size: 8, offset: 296)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !132, file: !77, line: 201, baseType: !142, size: 8, offset: 304)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !132, file: !77, line: 205, baseType: !142, size: 8, offset: 312)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !132, file: !77, line: 214, baseType: !142, size: 8, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !132, file: !77, line: 223, baseType: !142, size: 8, offset: 328)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !132, file: !77, line: 227, baseType: !142, size: 8, offset: 336)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !132, file: !77, line: 231, baseType: !142, size: 8, offset: 344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !132, file: !77, line: 235, baseType: !142, size: 8, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !132, file: !77, line: 239, baseType: !142, size: 8, offset: 360)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !132, file: !77, line: 242, baseType: !142, size: 8, offset: 368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !132, file: !77, line: 245, baseType: !142, size: 8, offset: 376)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !132, file: !77, line: 250, baseType: !142, size: 8, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !132, file: !77, line: 254, baseType: !142, size: 8, offset: 392)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !132, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !132, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !132, file: !77, line: 273, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !177, line: 69, baseType: !178)
!177 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !177, line: 67, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !132, file: !77, line: 276, baseType: !175, size: 64, offset: 576)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 312, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 39)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1320, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 165)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 3720, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 465)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 3208, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 401)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4032, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 504)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2776, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 347)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 360, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 45)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 432, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 54)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 8)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 80, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 10)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 24)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 168, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 21)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 4608, elements: !229)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !222, line: 50, size: 256, elements: !223)
!222 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!223 = !{!224, !225, !226, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !222, line: 52, baseType: !183, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !221, file: !222, line: 55, baseType: !7, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !222, line: 56, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !221, file: !222, line: 57, baseType: !7, size: 32, offset: 192)
!229 = !{!230}
!230 = !DISubrange(count: 18)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 304, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 38)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 584, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 73)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 536, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 67)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 14)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 16)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 488, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 61)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 456, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 57)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 232, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 29)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 12)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 336, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 42)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 400, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 50)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 560, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 70)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 136, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 17)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !272, line: 25, flags: DIFlagFwdDecl)
!272 = !DIFile(filename: "./lib/modechange.h", directory: "/home/mbarbar/software/coreutils-8.31")
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 576, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 72)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 464, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 58)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 688, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 86)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 600, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 75)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1768, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 221)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1776, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 222)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 896, elements: !302)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !295, file: !294, line: 633, size: 128, elements: !299)
!294 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!295 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !294, file: !294, line: 631, type: !296, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !183}
!298 = !{}
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !293, file: !294, line: 633, baseType: !183, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !293, file: !294, line: 633, baseType: !183, size: 64, offset: 64)
!302 = !{!303}
!303 = !DISubrange(count: 7)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 184, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 23)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 40)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 4)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 568, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 71)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 216, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 27)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 408, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 51)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !325, line: 49, size: 384, elements: !326)
!325 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!326 = !{!327, !328, !329, !330, !331, !332, !333}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !324, file: !325, line: 51, baseType: !9, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !324, file: !325, line: 52, baseType: !9, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !324, file: !325, line: 54, baseType: !128, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !324, file: !325, line: 55, baseType: !130, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !324, file: !325, line: 56, baseType: !9, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !324, file: !325, line: 57, baseType: !9, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !324, file: !325, line: 58, baseType: !9, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !336, line: 42, size: 256, elements: !337)
!336 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !335, file: !336, line: 44, baseType: !9, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !335, file: !336, line: 45, baseType: !9, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !335, file: !336, line: 46, baseType: !130, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !335, file: !336, line: 47, baseType: !209, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 264, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 33)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 368, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 46)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 176, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 22)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 120, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 15)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32768, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 4096)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 144, elements: !229)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 288, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 36)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 256, elements: !371)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !365, line: 9, size: 128, elements: !366)
!365 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !364, file: !365, line: 11, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !364, file: !365, line: 12, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!371 = !{!372}
!372 = !DISubrange(count: 2)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 240, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 30)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 32)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !371)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 72, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 9)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 352, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 44)
!386 = !{!387, !389, !391, !393, !395, !63, !397, !399, !401, !403, !405, !407, !409, !411, !413, !418, !420}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "owner_name", scope: !65, file: !66, line: 74, type: !9, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "group_name", scope: !65, file: !66, line: 81, type: !9, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !65, file: !66, line: 102, type: !142, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "strip_files", scope: !65, file: !66, line: 105, type: !142, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dir_arg", scope: !65, file: !66, line: 108, type: !142, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 121, type: !219, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "strip_program", scope: !65, file: !66, line: 111, type: !183, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !65, file: !66, line: 54, type: !142, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "mode", scope: !65, file: !66, line: 90, type: !139, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !65, file: !66, line: 99, type: !139, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "dir_mode", scope: !65, file: !66, line: 93, type: !139, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "owner_id", scope: !65, file: !66, line: 77, type: !127, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "group_id", scope: !65, file: !66, line: 84, type: !129, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "a_buff", scope: !415, file: !66, line: 149, type: !356, isLocal: true, isDefinition: true)
!415 = distinct !DISubprogram(name: "have_same_content", scope: !66, file: !66, line: 146, type: !416, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !298)
!416 = !DISubroutineType(types: !417)
!417 = !{!142, !7, !7}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "b_buff", scope: !415, file: !66, line: 150, type: !356, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "first_call", scope: !422, file: !66, line: 318, type: !142, isLocal: true, isDefinition: true)
!422 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !66, file: !66, line: 314, type: !296, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !298)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !425, file: !426, line: 147, type: !183, isLocal: true, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !428, globals: !585, nameTableKind: None)
!426 = !DIFile(filename: "src/copy.c", directory: "/home/mbarbar/software/coreutils-8.31")
!427 = !{!68, !76, !83, !89, !95}
!428 = !{!139, !53, !70, !9, !57, !55, !429, !142, !7, !261, !431, !320, !434, !175, !213, !437, !440, !183, !443, !360, !231, !234, !353, !140, !308, !350, !446, !449, !452, !453, !454, !457, !267, !460, !255, !461, !200, !203, !380, !489, !216, !490, !206, !493, !498, !500, !317, !184, !379, !501, !373, !29, !252, !504, !128, !130, !507, !510, !60, !511, !344, !513, !516, !519, !553, !10, !240, !243, !556, !475, !477, !559, !566, !569, !571, !573, !572, !127, !129, !574}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !430, line: 63, baseType: !29)
!430 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 296, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 37)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 328, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 41)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 88, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 11)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 728, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 91)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 376, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 47)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 392, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 49)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 224, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 28)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 416, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 52)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 344, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 43)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !463, line: 46, size: 1152, elements: !464)
!463 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !476, !478, !483, !484, !485}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !462, file: !463, line: 48, baseType: !452, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !462, file: !463, line: 53, baseType: !453, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !462, file: !463, line: 61, baseType: !460, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !462, file: !463, line: 62, baseType: !140, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !462, file: !463, line: 64, baseType: !128, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !462, file: !463, line: 65, baseType: !130, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !462, file: !463, line: 67, baseType: !7, size: 32, offset: 288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !462, file: !463, line: 69, baseType: !452, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !462, file: !463, line: 74, baseType: !29, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !462, file: !463, line: 78, baseType: !475, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !462, file: !463, line: 80, baseType: !477, size: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !462, file: !463, line: 91, baseType: !479, size: 128, offset: 576)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !365, line: 9, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !479, file: !365, line: 11, baseType: !368, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !479, file: !365, line: 12, baseType: !370, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !462, file: !463, line: 92, baseType: !479, size: 128, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !462, file: !463, line: 93, baseType: !479, size: 128, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !462, file: !463, line: 106, baseType: !486, size: 192, offset: 960)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 192, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 3)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 376, elements: !444)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 480, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 60)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !426, line: 125, size: 192, elements: !495)
!495 = !{!496, !497, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !494, file: !426, line: 127, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !494, file: !426, line: 128, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !112, line: 47, baseType: !453)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !494, file: !426, line: 129, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !112, line: 59, baseType: !452)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 504, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 63)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 248, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 31)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 200, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 25)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 256, elements: !371)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 104, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 13)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 648, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 81)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !521, file: !4, line: 51, baseType: !7, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !521, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !521, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !521, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !521, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !521, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !521, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !521, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !521, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !521, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !521, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !521, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !521, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !521, file: !4, line: 70, baseType: !537, size: 64, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !521, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !521, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !521, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !521, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !521, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !521, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !521, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !521, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !521, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !521, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !521, file: !4, line: 93, baseType: !537, size: 64, offset: 1344)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !521, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !521, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !521, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !521, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 152, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 19)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 448, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 56)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !561, line: 23, size: 192, elements: !562)
!561 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mbarbar/software/coreutils-8.31")
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !560, file: !561, line: 26, baseType: !429, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !560, file: !561, line: 29, baseType: !429, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !560, file: !561, line: 32, baseType: !70, size: 32, offset: 128)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 1024)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !430, line: 77, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !430, line: 52, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !576, line: 32, baseType: !577)
!576 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stdarg.h", directory: "/home/mbarbar/software")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !426, line: 623, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 192, elements: !38)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !426, line: 623, size: 192, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !579, file: !426, line: 623, baseType: !70, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !579, file: !426, line: 623, baseType: !70, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !579, file: !426, line: 623, baseType: !53, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !579, file: !426, line: 623, baseType: !53, size: 64, offset: 128)
!585 = !{!586, !423, !591, !593, !598, !600}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "mask", scope: !588, file: !426, line: 3051, type: !139, isLocal: true, isDefinition: true)
!588 = distinct !DISubprogram(name: "cached_umask", scope: !426, file: !426, line: 3049, type: !589, scopeLine: 3050, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !425, retainedNodes: !298)
!589 = !DISubroutineType(types: !590)
!590 = !{!139}
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !425, file: !426, line: 148, type: !183, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "zeros", scope: !595, file: !426, line: 351, type: !9, isLocal: true, isDefinition: true)
!595 = distinct !DISubprogram(name: "write_zeros", scope: !426, file: !426, line: 349, type: !596, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !425, retainedNodes: !298)
!596 = !DISubroutineType(types: !597)
!597 = !{!142, !7, !429}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "nz", scope: !595, file: !426, line: 352, type: !55, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "fallback", scope: !595, file: !426, line: 359, type: !566, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !604, file: !605, line: 45, type: !175, isLocal: true, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !606, globals: !618, nameTableKind: None)
!605 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!606 = !{!53, !9, !607, !610, !498, !500, !175, !616}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !608, line: 102, baseType: !609)
!608 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !605, line: 33, size: 192, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !611, file: !605, line: 35, baseType: !498, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !611, file: !605, line: 36, baseType: !500, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !605, line: 40, baseType: !9, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!618 = !{!602}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !621, file: !622, line: 38, type: !628, isLocal: true, isDefinition: true)
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !623, globals: !641, nameTableKind: None)
!622 = !DIFile(filename: "src/force-link.c", directory: "/home/mbarbar/software/coreutils-8.31")
!623 = !{!7, !624, !9, !627, !55, !628, !629, !183, !636}
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 256)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 72, elements: !381)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !622, line: 71, size: 192, elements: !631)
!631 = !{!632, !633, !634, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !630, file: !622, line: 73, baseType: !7, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !630, file: !622, line: 74, baseType: !183, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !630, file: !622, line: 75, baseType: !7, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !622, line: 76, baseType: !7, size: 32, offset: 160)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !622, line: 131, size: 128, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !637, file: !622, line: 133, baseType: !183, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !637, file: !622, line: 134, baseType: !7, size: 32, offset: 64)
!641 = !{!619}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "Version", scope: !644, file: !645, line: 2, type: !183, isLocal: false, isDefinition: true)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !646, globals: !647, nameTableKind: None)
!645 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!646 = !{!183}
!647 = !{!642}
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !650, file: !654, line: 82, type: !183, isLocal: false, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !660, globals: !678, nameTableKind: None)
!651 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!652 = !{!68, !653}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !654, line: 172, baseType: !70, size: 32, elements: !655)
!654 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!655 = !{!656, !657, !658, !659}
!656 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!657 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!658 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!659 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!660 = !{!53, !70, !55, !183, !216, !184, !379, !627, !661, !9, !662, !7, !10, !666, !675, !142, !624, !31}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !112, line: 108, baseType: !570)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !664, line: 127, baseType: !665)
!664 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !664, line: 127, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !668, line: 22, size: 2240, elements: !669)
!668 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!669 = !{!670, !671, !672, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !667, file: !668, line: 25, baseType: !453, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !667, file: !668, line: 26, baseType: !29, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !667, file: !668, line: 31, baseType: !33, size: 16, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !667, file: !668, line: 32, baseType: !573, size: 8, offset: 144)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !667, file: !668, line: 33, baseType: !624, size: 2048, offset: 152)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 40, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 5)
!678 = !{!648}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "backup_args", scope: !681, file: !697, line: 42, type: !687, isLocal: true, isDefinition: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !683, retainedTypes: !684, globals: !694, nameTableKind: None)
!682 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!683 = !{!68}
!684 = !{!183, !9, !184, !685, !687, !689, !267, !243}
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 256, elements: !207)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 576, elements: !381)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !690, line: 55, baseType: !691)
!690 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null}
!694 = !{!695, !679}
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "backup_types", scope: !681, file: !697, line: 53, type: !685, isLocal: true, isDefinition: true)
!697 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "file_name", scope: !700, file: !741, line: 37, type: !183, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !702, globals: !740, nameTableKind: None)
!701 = !DIFile(filename: "./lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!702 = !{!183, !142, !703, !553, !7, !737, !738, !739}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !705, file: !4, line: 51, baseType: !7, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !705, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !705, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !705, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !705, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !705, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !705, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !705, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !705, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !705, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !705, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !705, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !705, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !705, file: !4, line: 70, baseType: !721, size: 64, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !705, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !705, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !705, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !705, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !705, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !705, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !705, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !705, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !705, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !705, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !705, file: !4, line: 93, baseType: !721, size: 64, offset: 1344)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !705, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !705, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !705, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !705, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 56, elements: !302)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 24, elements: !487)
!739 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!740 = !{!698}
!741 = !DIFile(filename: "lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "file_name", scope: !744, file: !784, line: 46, type: !183, isLocal: true, isDefinition: true)
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !746, globals: !781, nameTableKind: None)
!745 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!746 = !{!183, !142, !747, !7, !255, !737, !738, !739}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !749, file: !4, line: 51, baseType: !7, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !749, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !749, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !749, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !749, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !749, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !749, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !749, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !749, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !749, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !749, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !749, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !749, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !749, file: !4, line: 70, baseType: !765, size: 64, offset: 832)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !749, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !749, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !749, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !749, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !749, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !749, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !749, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !749, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !749, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !749, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !749, file: !4, line: 93, baseType: !765, size: 64, offset: 1344)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !749, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !749, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !749, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !749, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!781 = !{!742, !782}
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !744, file: !784, line: 56, type: !142, isLocal: true, isDefinition: true)
!784 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "exit_failure", scope: !787, file: !791, line: 24, type: !739, isLocal: false, isDefinition: true)
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !789, globals: !790, nameTableKind: None)
!788 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!789 = !{!739}
!790 = !{!785}
!791 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "default_tuning", scope: !794, file: !800, line: 130, type: !816, isLocal: true, isDefinition: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !796, globals: !846, nameTableKind: None)
!795 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!796 = !{!57, !53, !55, !797, !809, !803, !213, !344, !834, !844, !573, !184, !816, !845, !798, !815, !827, !839, !831, !821, !142, !7}
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !177, line: 69, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !800, line: 52, size: 640, elements: !801)
!800 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!801 = !{!802, !808, !811, !812, !813, !814, !826, !833, !838, !843}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !799, file: !800, line: 57, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !800, line: 46, size: 128, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !804, file: !800, line: 48, baseType: !53, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !804, file: !800, line: 49, baseType: !803, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !799, file: !800, line: 58, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !799, file: !800, line: 59, baseType: !55, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !799, file: !800, line: 60, baseType: !55, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !799, file: !800, line: 61, baseType: !55, size: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !799, file: !800, line: 64, baseType: !815, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !177, line: 65, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !177, line: 53, size: 160, elements: !819)
!819 = !{!820, !822, !823, !824, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !818, file: !177, line: 58, baseType: !821, size: 32)
!821 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !818, file: !177, line: 59, baseType: !821, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !818, file: !177, line: 60, baseType: !821, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !818, file: !177, line: 61, baseType: !821, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !818, file: !177, line: 62, baseType: !142, size: 8, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !799, file: !800, line: 71, baseType: !827, size: 64, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !177, line: 48, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!55, !831, !55}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !799, file: !800, line: 72, baseType: !834, size: 64, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !177, line: 49, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!142, !831, !831}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !799, file: !800, line: 73, baseType: !839, size: 64, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !177, line: 50, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !53}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !799, file: !800, line: 76, baseType: !803, size: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!846 = !{!792}
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "program_name", scope: !849, file: !887, line: 33, type: !183, isLocal: false, isDefinition: true)
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !851, globals: !886, nameTableKind: None)
!850 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!851 = !{!53, !9, !183, !556, !852, !184, !206, !311}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !854, file: !4, line: 51, baseType: !7, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !854, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !854, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !854, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !854, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !854, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !854, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !854, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !854, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !854, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !854, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !854, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !854, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !854, file: !4, line: 70, baseType: !870, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !854, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !854, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !854, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !854, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !854, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !854, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !854, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !854, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !854, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !854, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !854, file: !4, line: 93, baseType: !870, size: 64, offset: 1344)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !854, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !854, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !854, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !854, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!886 = !{!847}
!887 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !890, file: !913, line: 85, type: !908, isLocal: false, isDefinition: true)
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !892, retainedTypes: !907, globals: !950, nameTableKind: None)
!891 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !894, line: 32, baseType: !70, size: 32, elements: !895)
!894 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mbarbar/software/coreutils-8.31")
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906}
!896 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!897 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!898 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!899 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!900 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!901 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!902 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!903 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!904 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!905 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!906 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!907 = !{!7, !33, !55, !908, !909, !911, !573, !921, !918, !70, !183, !922, !924, !9, !925, !624, !142, !379, !184, !930, !932, !944, !945, !947, !311, !206, !738}
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 704, elements: !438)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 320, elements: !211)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !913, line: 65, size: 448, elements: !914)
!913 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!914 = !{!915, !916, !917, !919, !920}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !912, file: !913, line: 68, baseType: !893, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !912, file: !913, line: 71, baseType: !7, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !912, file: !913, line: 75, baseType: !918, size: 256, offset: 64)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, elements: !207)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !912, file: !913, line: 78, baseType: !183, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !912, file: !913, line: 81, baseType: !183, size: 64, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !913, line: 834, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !926, file: !913, line: 836, baseType: !55, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !926, file: !913, line: 837, baseType: !9, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !933, line: 6, baseType: !934)
!933 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !935, line: 21, baseType: !936)
!935 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !935, line: 13, size: 64, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !936, file: !935, line: 15, baseType: !7, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !936, file: !935, line: 20, baseType: !940, size: 32, offset: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !936, file: !935, line: 16, size: 32, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !940, file: !935, line: 18, baseType: !70, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !940, file: !935, line: 19, baseType: !311, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !56, line: 74, baseType: !7)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 48, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 6)
!950 = !{!888, !951, !953, !955, !957, !959, !961, !963}
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !890, file: !913, line: 101, type: !909, isLocal: false, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !890, file: !913, line: 1052, type: !912, isLocal: false, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !890, file: !913, line: 116, type: !912, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "slot0", scope: !890, file: !913, line: 842, type: !624, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "slotvec", scope: !890, file: !913, line: 845, type: !925, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "nslots", scope: !890, file: !913, line: 843, type: !7, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "slotvec0", scope: !890, file: !913, line: 844, type: !926, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !967, file: !980, line: 74, type: !990, isLocal: true, isDefinition: true)
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !969, retainedTypes: !977, globals: !1004, nameTableKind: None)
!968 = !DIFile(filename: "./lib/savedir.c", directory: "/home/mbarbar/software/coreutils-8.31")
!969 = !{!970}
!970 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !971, line: 26, baseType: !70, size: 32, elements: !972)
!971 = !DIFile(filename: "./lib/savedir.h", directory: "/home/mbarbar/software/coreutils-8.31")
!972 = !{!973, !974, !975, !976}
!973 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!974 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!975 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!976 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!977 = !{!53, !9, !55, !978, !7, !986, !990, !992, !183, !1001, !979, !453, !985, !10, !662, !1002, !1003}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "direntry_t", file: !980, line: 46, baseType: !981)
!980 = !DIFile(filename: "lib/savedir.c", directory: "/home/mbarbar/software/coreutils-8.31")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !980, line: 40, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !980, line: 42, baseType: !9, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !981, file: !980, line: 44, baseType: !985, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !664, line: 34, baseType: !453)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !980, line: 72, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!7, !831, !831}
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 192, elements: !487)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !668, line: 22, size: 2240, elements: !995)
!995 = !{!996, !997, !998, !999, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !994, file: !668, line: 25, baseType: !453, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !994, file: !668, line: 26, baseType: !29, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !994, file: !668, line: 31, baseType: !33, size: 16, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !994, file: !668, line: 32, baseType: !573, size: 8, offset: 144)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !994, file: !668, line: 33, baseType: !624, size: 2048, offset: 152)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1004 = !{!965}
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "letters", scope: !1007, file: !1022, line: 184, type: !1013, isLocal: true, isDefinition: true)
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !1009, globals: !1021, nameTableKind: None)
!1008 = !DIFile(filename: "./lib/tempname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1009 = !{!55, !9, !70, !7, !1010, !1013, !1014, !1017, !353, !1020, !379, !227}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !1012, line: 33, flags: DIFlagFwdDecl)
!1012 = !DIFile(filename: "./lib/randint.h", directory: "/home/mbarbar/software/coreutils-8.31")
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 504, elements: !502)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!7, !9, !53}
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 280, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 35)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 416, elements: !455)
!1021 = !{!1005}
!1022 = !DIFile(filename: "lib/tempname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "ht", scope: !1025, file: !1026, line: 163, type: !175, isLocal: true, isDefinition: true)
!1025 = distinct !DISubprogram(name: "utimecmpat", scope: !1026, file: !1026, line: 132, type: !1027, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1052, retainedNodes: !298)
!1026 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!7, !7, !183, !1029, !1029, !7}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !463, line: 46, size: 1152, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1049, !1050, !1051}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1031, file: !463, line: 48, baseType: !452, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1031, file: !463, line: 53, baseType: !453, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1031, file: !463, line: 61, baseType: !460, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1031, file: !463, line: 62, baseType: !140, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1031, file: !463, line: 64, baseType: !128, size: 32, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1031, file: !463, line: 65, baseType: !130, size: 32, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1031, file: !463, line: 67, baseType: !7, size: 32, offset: 288)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1031, file: !463, line: 69, baseType: !452, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1031, file: !463, line: 74, baseType: !29, size: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1031, file: !463, line: 78, baseType: !475, size: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1031, file: !463, line: 80, baseType: !477, size: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1031, file: !463, line: 91, baseType: !1045, size: 128, offset: 576)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !365, line: 9, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1045, file: !365, line: 11, baseType: !368, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1045, file: !365, line: 12, baseType: !370, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1031, file: !463, line: 92, baseType: !1045, size: 128, offset: 704)
