; ModuleID = 'ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "software/llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !65, file: !66, line: 53, type: !7, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !121, globals: !308, nameTableKind: None)
!66 = !DIFile(filename: "src/install.c", directory: "/home/mbarbar/clone/coreutils")
!67 = !{!68, !76, !83, !89, !95, !100}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !69, line: 30, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mbarbar/clone/coreutils")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !77, line: 69, baseType: !70, size: 32, elements: !78)
!77 = !DIFile(filename: "src/copy.h", directory: "/home/mbarbar/clone/coreutils")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !77, line: 60, baseType: !70, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !77, line: 26, baseType: !70, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !77, line: 47, baseType: !70, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !102, file: !101, line: 39, baseType: !70, size: 32, elements: !114)
!101 = !DIFile(filename: "./lib/savewd.h", directory: "/home/mbarbar/clone/coreutils")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !101, line: 36, size: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !101, line: 66, baseType: !100, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !101, line: 74, baseType: !106, size: 32, offset: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !101, line: 69, size: 32, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !106, file: !101, line: 71, baseType: !7, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !106, file: !101, line: 72, baseType: !7, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !106, file: !101, line: 73, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !112, line: 97, baseType: !113)
!112 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 154, baseType: !7)
!114 = !{!115, !116, !117, !118, !119, !120}
!115 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!119 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!121 = !{!122, !9, !53, !127, !129, !131, !125, !0, !180, !182, !7, !142, !184, !185, !140, !197, !139, !200, !202, !204, !215, !216, !175, !218, !220, !55, !222, !224, !235, !57, !128, !130, !243, !246, !248, !250, !252, !254, !256, !258, !260, !262, !29, !264, !111, !266, !303, !181, !306}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !123, line: 72, baseType: !124)
!123 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !7}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !112, line: 79, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !70)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !112, line: 64, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !70)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !179}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !132, file: !77, line: 100, baseType: !68, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !132, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !132, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !132, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !132, file: !77, line: 115, baseType: !139, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !112, line: 69, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !70)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !132, file: !77, line: 119, baseType: !142, size: 8, offset: 160)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !132, file: !77, line: 123, baseType: !142, size: 8, offset: 168)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !132, file: !77, line: 130, baseType: !142, size: 8, offset: 176)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !132, file: !77, line: 134, baseType: !142, size: 8, offset: 184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !132, file: !77, line: 138, baseType: !142, size: 8, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !132, file: !77, line: 141, baseType: !142, size: 8, offset: 200)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !132, file: !77, line: 145, baseType: !142, size: 8, offset: 208)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !132, file: !77, line: 152, baseType: !142, size: 8, offset: 216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !132, file: !77, line: 156, baseType: !142, size: 8, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !132, file: !77, line: 160, baseType: !142, size: 8, offset: 232)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !132, file: !77, line: 161, baseType: !142, size: 8, offset: 240)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !132, file: !77, line: 162, baseType: !142, size: 8, offset: 248)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !132, file: !77, line: 163, baseType: !142, size: 8, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !132, file: !77, line: 166, baseType: !142, size: 8, offset: 264)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !132, file: !77, line: 178, baseType: !142, size: 8, offset: 272)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !132, file: !77, line: 182, baseType: !142, size: 8, offset: 280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !132, file: !77, line: 188, baseType: !142, size: 8, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !132, file: !77, line: 192, baseType: !142, size: 8, offset: 296)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !132, file: !77, line: 201, baseType: !142, size: 8, offset: 304)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !132, file: !77, line: 205, baseType: !142, size: 8, offset: 312)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !132, file: !77, line: 214, baseType: !142, size: 8, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !132, file: !77, line: 223, baseType: !142, size: 8, offset: 328)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !132, file: !77, line: 227, baseType: !142, size: 8, offset: 336)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !132, file: !77, line: 231, baseType: !142, size: 8, offset: 344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !132, file: !77, line: 235, baseType: !142, size: 8, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !132, file: !77, line: 239, baseType: !142, size: 8, offset: 360)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !132, file: !77, line: 242, baseType: !142, size: 8, offset: 368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !132, file: !77, line: 245, baseType: !142, size: 8, offset: 376)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !132, file: !77, line: 250, baseType: !142, size: 8, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !132, file: !77, line: 254, baseType: !142, size: 8, offset: 392)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !132, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !132, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !132, file: !77, line: 273, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !177, line: 69, baseType: !178)
!177 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/clone/coreutils")
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !177, line: 67, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !132, file: !77, line: 276, baseType: !175, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!182 = !DISubroutineType(types: !183)
!183 = !{!7, !7, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 4608, elements: !195)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !188, line: 50, size: 256, elements: !189)
!188 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!189 = !{!190, !191, !192, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !188, line: 52, baseType: !180, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !187, file: !188, line: 55, baseType: !7, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !188, line: 56, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !187, file: !188, line: 57, baseType: !7, size: 32, offset: 192)
!195 = !{!196}
!196 = !DISubrange(count: 18)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !199, line: 25, flags: DIFlagFwdDecl)
!199 = !DIFile(filename: "./lib/modechange.h", directory: "/home/mbarbar/clone/coreutils")
!200 = !DISubroutineType(types: !201)
!201 = !{null}
!202 = !DISubroutineType(types: !203)
!203 = !{null, !180}
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, elements: !213)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !208, file: !207, line: 633, size: 128, elements: !210)
!207 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/clone/coreutils")
!208 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !207, file: !207, line: 631, type: !202, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !209)
!209 = !{}
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !206, file: !207, line: 633, baseType: !180, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !207, line: 633, baseType: !180, size: 64, offset: 64)
!213 = !{!214}
!214 = !DISubrange(count: 7)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !131}
!218 = !DISubroutineType(types: !219)
!219 = !{!9, !180}
!220 = !DISubroutineType(types: !221)
!221 = !{!142, !180}
!222 = !DISubroutineType(types: !223)
!223 = !{!142, !139}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !226, line: 49, size: 384, elements: !227)
!226 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!227 = !{!228, !229, !230, !231, !232, !233, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !225, file: !226, line: 51, baseType: !9, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !225, file: !226, line: 52, baseType: !9, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !225, file: !226, line: 54, baseType: !128, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !225, file: !226, line: 55, baseType: !130, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !225, file: !226, line: 56, baseType: !9, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !225, file: !226, line: 57, baseType: !9, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !225, file: !226, line: 58, baseType: !9, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !237, line: 42, size: 256, elements: !238)
!237 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !236, file: !237, line: 44, baseType: !9, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !236, file: !237, line: 45, baseType: !9, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !236, file: !237, line: 46, baseType: !130, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !236, file: !237, line: 47, baseType: !184, size: 64, offset: 192)
!243 = !DISubroutineType(types: !244)
!244 = !{!7, !9, !245, !53}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!248 = !DISubroutineType(types: !249)
!249 = !{!7, !180, !180, !53}
!250 = !DISubroutineType(types: !251)
!251 = !{!7, !180, !139}
!252 = !DISubroutineType(types: !253)
!253 = !{null, !180, !53}
!254 = !DISubroutineType(types: !255)
!255 = !{!142, !180, !142, !142}
!256 = !DISubroutineType(types: !257)
!257 = !{!142, !7}
!258 = !DISubroutineType(types: !259)
!259 = !{!142, !180, !9, !246}
!260 = !DISubroutineType(types: !261)
!261 = !{!142, !180, !9, !131, !142}
!262 = !DISubroutineType(types: !263)
!263 = !{!142, !180, !180, !246}
!264 = !DISubroutineType(types: !265)
!265 = !{!142, !7, !7}
!266 = !DISubroutineType(types: !267)
!267 = !{!142, !268, !180}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !271, line: 46, size: 1152, elements: !272)
!271 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!272 = !{!273, !275, !277, !279, !280, !281, !282, !283, !284, !285, !287, !289, !297, !298, !299}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !270, file: !271, line: 48, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !270, file: !271, line: 53, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !270, file: !271, line: 61, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !270, file: !271, line: 62, baseType: !140, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !270, file: !271, line: 64, baseType: !128, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !270, file: !271, line: 65, baseType: !130, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !270, file: !271, line: 67, baseType: !7, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !270, file: !271, line: 69, baseType: !274, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !270, file: !271, line: 74, baseType: !29, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !270, file: !271, line: 78, baseType: !286, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !270, file: !271, line: 80, baseType: !288, size: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !270, file: !271, line: 91, baseType: !290, size: 128, offset: 576)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !291, line: 9, size: 128, elements: !292)
!291 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!292 = !{!293, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !290, file: !291, line: 11, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !290, file: !291, line: 12, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !270, file: !271, line: 92, baseType: !290, size: 128, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !270, file: !271, line: 93, baseType: !290, size: 128, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !270, file: !271, line: 106, baseType: !300, size: 192, offset: 960)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 192, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 3)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 256, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 2)
!306 = !DISubroutineType(types: !307)
!307 = !{!142, !180, !180, !246, !142}
!308 = !{!309, !311, !313, !315, !317, !63, !319, !321, !323, !325, !327, !329, !331, !333, !335, !341, !343}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "owner_name", scope: !65, file: !66, line: 74, type: !9, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "group_name", scope: !65, file: !66, line: 81, type: !9, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !65, file: !66, line: 102, type: !142, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "strip_files", scope: !65, file: !66, line: 105, type: !142, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "dir_arg", scope: !65, file: !66, line: 108, type: !142, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 121, type: !185, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "strip_program", scope: !65, file: !66, line: 111, type: !180, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !65, file: !66, line: 54, type: !142, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "mode", scope: !65, file: !66, line: 90, type: !139, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !65, file: !66, line: 99, type: !139, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "dir_mode", scope: !65, file: !66, line: 93, type: !139, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "owner_id", scope: !65, file: !66, line: 77, type: !127, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "group_id", scope: !65, file: !66, line: 84, type: !129, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "a_buff", scope: !337, file: !66, line: 149, type: !338, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "have_same_content", scope: !66, file: !66, line: 146, type: !264, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !209)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32768, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 4096)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "b_buff", scope: !337, file: !66, line: 150, type: !338, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "first_call", scope: !345, file: !66, line: 318, type: !142, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !66, file: !66, line: 314, type: !202, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !209)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !348, file: !349, line: 147, type: !180, isLocal: true, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !350, retainedTypes: !351, globals: !598, nameTableKind: None)
!349 = !DIFile(filename: "src/copy.c", directory: "/home/mbarbar/clone/coreutils")
!350 = !{!68, !76, !83, !89, !95}
!351 = !{!139, !53, !70, !9, !57, !55, !352, !354, !142, !7, !399, !401, !175, !404, !180, !407, !409, !256, !250, !254, !411, !140, !274, !276, !278, !444, !436, !441, !443, !181, !29, !128, !130, !445, !446, !448, !450, !413, !452, !454, !456, !458, !461, !220, !10, !495, !497, !499, !503, !505, !286, !507, !509, !511, !288, !513, !517, !519, !526, !538, !540, !542, !544, !550, !552, !554, !556, !555, !557, !200, !559, !563, !127, !129, !565, !567, !583, !579, !594, !596}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !353, line: 63, baseType: !29)
!353 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!354 = !DISubroutineType(types: !355)
!355 = !{!142, !180, !180, !139, !142, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !358, file: !77, line: 100, baseType: !68, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !358, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !358, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !358, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !358, file: !77, line: 115, baseType: !139, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !358, file: !77, line: 119, baseType: !142, size: 8, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !358, file: !77, line: 123, baseType: !142, size: 8, offset: 168)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !358, file: !77, line: 130, baseType: !142, size: 8, offset: 176)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !358, file: !77, line: 134, baseType: !142, size: 8, offset: 184)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !358, file: !77, line: 138, baseType: !142, size: 8, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !358, file: !77, line: 141, baseType: !142, size: 8, offset: 200)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !358, file: !77, line: 145, baseType: !142, size: 8, offset: 208)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !358, file: !77, line: 152, baseType: !142, size: 8, offset: 216)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !358, file: !77, line: 156, baseType: !142, size: 8, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !358, file: !77, line: 160, baseType: !142, size: 8, offset: 232)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !358, file: !77, line: 161, baseType: !142, size: 8, offset: 240)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !358, file: !77, line: 162, baseType: !142, size: 8, offset: 248)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !358, file: !77, line: 163, baseType: !142, size: 8, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !358, file: !77, line: 166, baseType: !142, size: 8, offset: 264)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !358, file: !77, line: 178, baseType: !142, size: 8, offset: 272)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !358, file: !77, line: 182, baseType: !142, size: 8, offset: 280)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !358, file: !77, line: 188, baseType: !142, size: 8, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !358, file: !77, line: 192, baseType: !142, size: 8, offset: 296)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !358, file: !77, line: 201, baseType: !142, size: 8, offset: 304)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !358, file: !77, line: 205, baseType: !142, size: 8, offset: 312)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !358, file: !77, line: 214, baseType: !142, size: 8, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !358, file: !77, line: 223, baseType: !142, size: 8, offset: 328)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !358, file: !77, line: 227, baseType: !142, size: 8, offset: 336)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !358, file: !77, line: 231, baseType: !142, size: 8, offset: 344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !358, file: !77, line: 235, baseType: !142, size: 8, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !358, file: !77, line: 239, baseType: !142, size: 8, offset: 360)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !358, file: !77, line: 242, baseType: !142, size: 8, offset: 368)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !358, file: !77, line: 245, baseType: !142, size: 8, offset: 376)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !358, file: !77, line: 250, baseType: !142, size: 8, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !358, file: !77, line: 254, baseType: !142, size: 8, offset: 392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !358, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !358, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !358, file: !77, line: 273, baseType: !175, size: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !358, file: !77, line: 276, baseType: !175, size: 64, offset: 576)
!399 = !DISubroutineType(types: !400)
!400 = !{!142, !180, !142, !142, !356}
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!142, !180, !180, !142, !356, !406, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!142, !356}
!409 = !DISubroutineType(types: !410)
!410 = !{!139}
!411 = !DISubroutineType(types: !412)
!412 = !{!142, !180, !180, !142, !413, !436, !356, !142, !406, !406, !406}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !271, line: 46, size: 1152, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !433, !434, !435}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !415, file: !271, line: 48, baseType: !274, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !415, file: !271, line: 53, baseType: !276, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !415, file: !271, line: 61, baseType: !278, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !415, file: !271, line: 62, baseType: !140, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !415, file: !271, line: 64, baseType: !128, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !415, file: !271, line: 65, baseType: !130, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !415, file: !271, line: 67, baseType: !7, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !415, file: !271, line: 69, baseType: !274, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !415, file: !271, line: 74, baseType: !29, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !415, file: !271, line: 78, baseType: !286, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !415, file: !271, line: 80, baseType: !288, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !415, file: !271, line: 91, baseType: !429, size: 128, offset: 576)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !291, line: 9, size: 128, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !429, file: !291, line: 11, baseType: !294, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !429, file: !291, line: 12, baseType: !296, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !415, file: !271, line: 92, baseType: !429, size: 128, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !415, file: !271, line: 93, baseType: !429, size: 128, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !415, file: !271, line: 106, baseType: !300, size: 192, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !349, line: 125, size: 192, elements: !438)
!438 = !{!439, !440, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !437, file: !349, line: 127, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !437, file: !349, line: 128, baseType: !441, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !112, line: 47, baseType: !276)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !437, file: !349, line: 129, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !112, line: 59, baseType: !274)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 256, elements: !304)
!446 = !DISubroutineType(types: !447)
!447 = !{!7, !7, !180, !444, !7}
!448 = !DISubroutineType(types: !449)
!449 = !{!142, !356, !142}
!450 = !DISubroutineType(types: !451)
!451 = !{!142, !180, !413, !180, !413, !356, !406}
!452 = !DISubroutineType(types: !453)
!453 = !{!142, !180, !180, !142, !142, !142}
!454 = !DISubroutineType(types: !455)
!455 = !{!142, !356, !180, !413}
!456 = !DISubroutineType(types: !457)
!457 = !{!142, !180, !139}
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 12)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !463, file: !4, line: 51, baseType: !7, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !463, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !463, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !463, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !463, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !463, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !463, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !463, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !463, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !463, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !463, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !463, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !463, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !463, file: !4, line: 70, baseType: !479, size: 64, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !463, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !463, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !463, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !463, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !463, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !463, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !463, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !463, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !463, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !463, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !463, file: !4, line: 93, baseType: !479, size: 64, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !463, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !463, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !463, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !463, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!495 = !DISubroutineType(types: !496)
!496 = !{!142, !180, !413, !180}
!497 = !DISubroutineType(types: !498)
!498 = !{null, !180, !180, !180}
!499 = !DISubroutineType(types: !500)
!500 = !{!142, !413, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!503 = !DISubroutineType(types: !504)
!504 = !{!142, !180, !180, !142, !413, !436, !356, !406, !406}
!505 = !DISubroutineType(types: !506)
!506 = !{!142, !180, !180, !356, !139, !139, !406, !413}
!507 = !DISubroutineType(types: !508)
!508 = !{!7, !7, !7}
!509 = !DISubroutineType(types: !510)
!510 = !{!55, !415}
!511 = !DISubroutineType(types: !512)
!512 = !{!142, !413}
!513 = !DISubroutineType(types: !514)
!514 = !{!53, !515, !55}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!517 = !DISubroutineType(types: !518)
!518 = !{!142, !7, !7, !9, !55, !55, !352, !89, !180, !180, !406}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !521, line: 23, size: 192, elements: !522)
!521 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mbarbar/clone/coreutils")
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !520, file: !521, line: 26, baseType: !352, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !520, file: !521, line: 29, baseType: !352, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !520, file: !521, line: 32, baseType: !70, size: 32, offset: 128)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !521, line: 36, size: 384, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !529, file: !521, line: 39, baseType: !7, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !529, file: !521, line: 42, baseType: !352, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !529, file: !521, line: 45, baseType: !70, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !529, file: !521, line: 48, baseType: !55, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !529, file: !521, line: 52, baseType: !142, size: 8, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !529, file: !521, line: 55, baseType: !142, size: 8, offset: 264)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !529, file: !521, line: 58, baseType: !519, size: 64, offset: 320)
!538 = !DISubroutineType(types: !539)
!539 = !{!142, !7, !180, !142, !352}
!540 = !DISubroutineType(types: !541)
!541 = !{!142, !7, !352}
!542 = !DISubroutineType(types: !543)
!543 = !{!7, !7, !352, !352}
!544 = !DISubroutineType(types: !545)
!545 = !{!142, !7, !7, !9, !55, !55, !142, !180, !180, !546, !549, !406}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !547, line: 102, baseType: !548)
!547 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !353, line: 77, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!552 = !DISubroutineType(types: !553)
!553 = !{!142, !515, !55}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!557 = !DISubroutineType(types: !558)
!558 = !{!7, !7, !180, !139}
!559 = !DISubroutineType(types: !560)
!560 = !{!7, !180, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!563 = !DISubroutineType(types: !564)
!564 = !{!7, !356, !180, !7, !413, !142, !413}
!565 = !DISubroutineType(types: !566)
!566 = !{!142, !180, !7, !180, !7, !356}
!567 = !DISubroutineType(types: !568)
!568 = !{null, !569, !180}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !571, line: 25, size: 192, elements: !572)
!571 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!572 = !{!573, !577, !581}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !570, file: !571, line: 27, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !569, !180, null}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !570, file: !571, line: 30, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!180, !569, !180}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !570, file: !571, line: 33, baseType: !582, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !353, line: 52, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !585, line: 32, baseType: !586)
!585 = !DIFile(filename: "software/llvm9/build/lib/clang/9.0.0/include/stdarg.h", directory: "/home/mbarbar")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !349, line: 659, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 192, elements: !38)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !349, line: 659, size: 192, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !588, file: !349, line: 659, baseType: !70, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !588, file: !349, line: 659, baseType: !70, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !588, file: !349, line: 659, baseType: !53, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !588, file: !349, line: 659, baseType: !53, size: 64, offset: 128)
!594 = !DISubroutineType(types: !595)
!595 = !{!7, !180, !569}
!596 = !DISubroutineType(types: !597)
!597 = !{null, !180, !7, !413}
!598 = !{!599, !346, !602, !604, !607, !609}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "mask", scope: !601, file: !349, line: 3089, type: !139, isLocal: true, isDefinition: true)
!601 = distinct !DISubprogram(name: "cached_umask", scope: !349, file: !349, line: 3087, type: !409, scopeLine: 3088, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !348, retainedNodes: !209)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !348, file: !349, line: 148, type: !180, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "zeros", scope: !606, file: !349, line: 387, type: !9, isLocal: true, isDefinition: true)
!606 = distinct !DISubprogram(name: "write_zeros", scope: !349, file: !349, line: 385, type: !540, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !348, retainedNodes: !209)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "nz", scope: !606, file: !349, line: 388, type: !55, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "fallback", scope: !606, file: !349, line: 395, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 1024)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !616, file: !617, line: 45, type: !175, isLocal: true, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !618, globals: !639, nameTableKind: None)
!617 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mbarbar/clone/coreutils")
!618 = !{!53, !9, !546, !619, !621, !441, !443, !175, !627, !629, !631, !200, !633, !635, !637}
!619 = !DISubroutineType(types: !620)
!620 = !{null, !441, !443}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !617, line: 33, size: 192, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !622, file: !617, line: 35, baseType: !441, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !622, file: !617, line: 36, baseType: !443, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !622, file: !617, line: 40, baseType: !9, size: 64, offset: 128)
!627 = !DISubroutineType(types: !628)
!628 = !{!9, !441, !443}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!631 = !DISubroutineType(types: !632)
!632 = !{!9, !180, !441, !443}
!633 = !DISubroutineType(types: !634)
!634 = !{null, !53}
!635 = !DISubroutineType(types: !636)
!636 = !{!55, !515, !55}
!637 = !DISubroutineType(types: !638)
!638 = !{!142, !515, !515}
!639 = !{!614}
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !642, file: !643, line: 38, type: !655, isLocal: true, isDefinition: true)
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !644, globals: !672, nameTableKind: None)
!643 = !DIFile(filename: "src/force-link.c", directory: "/home/mbarbar/clone/coreutils")
!644 = !{!645, !7, !647, !9, !650, !652, !654, !55, !655, !658, !660, !180, !667}
!645 = !DISubroutineType(types: !646)
!646 = !{!7, !7, !180, !7, !180, !7, !142, !7}
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 256)
!650 = !DISubroutineType(types: !651)
!651 = !{!7, !180, !7, !180, !142, !7}
!652 = !DISubroutineType(types: !653)
!653 = !{!9, !180, !9}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 72, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 9)
!658 = !DISubroutineType(types: !659)
!659 = !{!7, !9, !53}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !643, line: 71, size: 192, elements: !662)
!662 = !{!663, !664, !665, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !661, file: !643, line: 73, baseType: !7, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !661, file: !643, line: 74, baseType: !180, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !661, file: !643, line: 75, baseType: !7, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !643, line: 76, baseType: !7, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !643, line: 131, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !668, file: !643, line: 133, baseType: !180, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !668, file: !643, line: 134, baseType: !7, size: 32, offset: 64)
!672 = !{!640}
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "Version", scope: !675, file: !676, line: 2, type: !180, isLocal: false, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !677, globals: !678, nameTableKind: None)
!676 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/clone/coreutils")
!677 = !{!180}
!678 = !{!673}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !681, file: !685, line: 82, type: !180, isLocal: false, isDefinition: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !683, retainedTypes: !691, globals: !715, nameTableKind: None)
!682 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mbarbar/clone/coreutils")
!683 = !{!68, !684}
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !685, line: 172, baseType: !70, size: 32, elements: !686)
!685 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mbarbar/clone/coreutils")
!686 = !{!687, !688, !689, !690}
!687 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!688 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!689 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!690 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!691 = !{!53, !70, !55, !180, !202, !181, !692, !654, !694, !9, !695, !7, !699, !702, !711, !142, !10, !712, !31}
!692 = !DISubroutineType(types: !693)
!693 = !{!9, !7, !180, !68, !142}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !112, line: 108, baseType: !551)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !697, line: 127, baseType: !698)
!697 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !697, line: 127, flags: DIFlagFwdDecl)
!699 = !DISubroutineType(types: !700)
!700 = !{!684, !7, !184, !55, !55, !654, !701, !193}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !704, line: 22, size: 2240, elements: !705)
!704 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!705 = !{!706, !707, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !703, file: !704, line: 25, baseType: !276, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !703, file: !704, line: 26, baseType: !29, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !703, file: !704, line: 31, baseType: !33, size: 16, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !703, file: !704, line: 32, baseType: !556, size: 8, offset: 144)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !703, file: !704, line: 33, baseType: !647, size: 2048, offset: 152)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !304)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !9, !55, !10, !7, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!715 = !{!679}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "backup_args", scope: !718, file: !738, line: 42, type: !730, isLocal: true, isDefinition: true)
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !720, retainedTypes: !721, globals: !735, nameTableKind: None)
!719 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mbarbar/clone/coreutils")
!720 = !{!68}
!721 = !{!515, !722, !9, !724, !181, !726, !730, !732}
!722 = !DISubroutineType(types: !723)
!723 = !{!9, !7, !180, !68}
!724 = !DISubroutineType(types: !725)
!725 = !{!68, !180, !180}
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 256, elements: !728)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!728 = !{!729}
!729 = !DISubrange(count: 8)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 576, elements: !656)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !733, line: 61, baseType: !734)
!733 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/clone/coreutils")
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!735 = !{!736, !716}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "backup_types", scope: !718, file: !738, line: 53, type: !726, isLocal: true, isDefinition: true)
!738 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mbarbar/clone/coreutils")
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "file_name", scope: !741, file: !780, line: 37, type: !180, isLocal: true, isDefinition: true)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !743, globals: !779, nameTableKind: None)
!742 = !DIFile(filename: "./lib/closein.c", directory: "/home/mbarbar/clone/coreutils")
!743 = !{!202, !180, !200, !142, !744, !7, !778}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !746, file: !4, line: 51, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !746, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !746, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !746, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !746, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !746, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !746, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !746, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !746, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !746, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !746, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !746, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !746, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !746, file: !4, line: 70, baseType: !762, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !746, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !746, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !746, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !746, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !746, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !746, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !746, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !746, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !746, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !746, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !746, file: !4, line: 93, baseType: !762, size: 64, offset: 1344)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !746, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !746, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !746, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !746, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!778 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!779 = !{!739}
!780 = !DIFile(filename: "lib/closein.c", directory: "/home/mbarbar/clone/coreutils")
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "file_name", scope: !783, file: !825, line: 46, type: !180, isLocal: true, isDefinition: true)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !785, globals: !822, nameTableKind: None)
!784 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/clone/coreutils")
!785 = !{!202, !180, !786, !142, !200, !788, !7, !778}
!786 = !DISubroutineType(types: !787)
!787 = !{null, !142}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !790, file: !4, line: 51, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !790, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !790, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !790, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !790, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !790, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !790, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !790, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !790, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !790, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !790, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !790, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !790, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !790, file: !4, line: 70, baseType: !806, size: 64, offset: 832)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !790, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !790, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !790, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !790, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !790, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !790, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !790, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !790, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !790, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !790, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !790, file: !4, line: 93, baseType: !806, size: 64, offset: 1344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !790, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !790, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !790, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !790, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!822 = !{!781, !823}
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !783, file: !825, line: 56, type: !142, isLocal: true, isDefinition: true)
!825 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/clone/coreutils")
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "exit_failure", scope: !828, file: !832, line: 24, type: !778, isLocal: false, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !830, globals: !831, nameTableKind: None)
!829 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/clone/coreutils")
!830 = !{!778}
!831 = !{!826}
!832 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/clone/coreutils")
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "default_tuning", scope: !835, file: !844, line: 130, type: !860, isLocal: true, isDefinition: true)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !837, globals: !967, nameTableKind: None)
!836 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/clone/coreutils")
!837 = !{!57, !53, !55, !838, !841, !853, !847, !880, !882, !918, !874, !920, !922, !924, !925, !931, !556, !181, !933, !860, !936, !938, !842, !859, !871, !877, !939, !941, !943, !515, !865, !142, !946, !7, !948, !635, !637, !950, !952, !954, !956, !958, !960, !962, !965}
!838 = !DISubroutineType(types: !839)
!839 = !{!55, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !177, line: 69, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !844, line: 52, size: 640, elements: !845)
!844 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/clone/coreutils")
!845 = !{!846, !852, !855, !856, !857, !858, !870, !873, !876, !879}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !843, file: !844, line: 57, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !844, line: 46, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !848, file: !844, line: 48, baseType: !53, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !844, line: 49, baseType: !847, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !843, file: !844, line: 58, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !843, file: !844, line: 59, baseType: !55, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !843, file: !844, line: 60, baseType: !55, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !843, file: !844, line: 61, baseType: !55, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !843, file: !844, line: 64, baseType: !859, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !177, line: 65, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !177, line: 53, size: 160, elements: !863)
!863 = !{!864, !866, !867, !868, !869}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !862, file: !177, line: 58, baseType: !865, size: 32)
!865 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !862, file: !177, line: 59, baseType: !865, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !862, file: !177, line: 60, baseType: !865, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !862, file: !177, line: 61, baseType: !865, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !862, file: !177, line: 62, baseType: !142, size: 8, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !843, file: !844, line: 71, baseType: !871, size: 64, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !177, line: 48, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !843, file: !844, line: 72, baseType: !874, size: 64, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !177, line: 49, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !843, file: !844, line: 73, baseType: !877, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !177, line: 50, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !843, file: !844, line: 76, baseType: !847, size: 64, offset: 576)
!880 = !DISubroutineType(types: !881)
!881 = !{!142, !840}
!882 = !DISubroutineType(types: !883)
!883 = !{null, !840, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !886, file: !4, line: 51, baseType: !7, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !886, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !886, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !886, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !886, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !886, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !886, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !886, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !886, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !886, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !886, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !886, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !886, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !886, file: !4, line: 70, baseType: !902, size: 64, offset: 832)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !886, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !886, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !886, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !886, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !886, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !886, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !886, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !886, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !886, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !886, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !886, file: !4, line: 93, baseType: !902, size: 64, offset: 1344)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !886, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !886, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !886, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !886, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!918 = !DISubroutineType(types: !919)
!919 = !{!53, !840, !515}
!920 = !DISubroutineType(types: !921)
!921 = !{!53, !840}
!922 = !DISubroutineType(types: !923)
!923 = !{!55, !840, !924, !55}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!55, !840, !927, !53}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_processor", file: !177, line: 51, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!142, !53, !53}
!931 = !DISubroutineType(types: !932)
!932 = !{!55, !180, !55}
!933 = !DISubroutineType(types: !934)
!934 = !{null, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!938, !55, !859, !871, !874, !877}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !938}
!941 = !DISubroutineType(types: !942)
!942 = !{!142, !938, !55}
!943 = !DISubroutineType(types: !944)
!944 = !{!7, !938, !515, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!53, !938, !515}
!948 = !DISubroutineType(types: !949)
!949 = !{!847, !840, !515}
!950 = !DISubroutineType(types: !951)
!951 = !{!142, !938}
!952 = !DISubroutineType(types: !953)
!953 = !{!55, !55, !859}
!954 = !DISubroutineType(types: !955)
!955 = !{!55, !55}
!956 = !DISubroutineType(types: !957)
!957 = !{!142, !55}
!958 = !DISubroutineType(types: !959)
!959 = !{!142, !938, !938, !142}
!960 = !DISubroutineType(types: !961)
!961 = !{null, !938, !847}
!962 = !DISubroutineType(types: !963)
!963 = !{!53, !938, !515, !964, !142}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!847, !938}
!967 = !{!833}
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "program_name", scope: !970, file: !1008, line: 33, type: !180, isLocal: false, isDefinition: true)
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !972, globals: !1007, nameTableKind: None)
!971 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/clone/coreutils")
!972 = !{!53, !9, !180, !202, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !975, file: !4, line: 51, baseType: !7, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !975, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !975, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !975, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !975, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !975, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !975, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !975, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !975, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !975, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !975, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !975, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !975, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !975, file: !4, line: 70, baseType: !991, size: 64, offset: 832)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !975, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !975, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !975, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !975, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !975, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !975, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !975, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !975, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !975, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !975, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !975, file: !4, line: 93, baseType: !991, size: 64, offset: 1344)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !975, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !975, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !975, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !975, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!1007 = !{!968}
!1008 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/clone/coreutils")
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1011, file: !1040, line: 85, type: !1029, isLocal: false, isDefinition: true)
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1013, retainedTypes: !1028, globals: !1134, nameTableKind: None)
!1012 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/clone/coreutils")
!1013 = !{!1014}
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1015, line: 32, baseType: !70, size: 32, elements: !1016)
!1015 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mbarbar/clone/coreutils")
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1017 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!1018 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!1019 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!1020 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!1021 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!1022 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!1023 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!1024 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!1025 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!1026 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!1027 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!1028 = !{!7, !33, !55, !1029, !1032, !1036, !1038, !1048, !1052, !1054, !556, !1056, !70, !1057, !1059, !180, !1061, !1050, !1063, !1065, !9, !200, !1067, !647, !1072, !1074, !218, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !142, !181, !1110, !1112, !1127, !1108, !1128, !1130, !1132}
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 704, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 11)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 320, elements: !1034)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1034 = !{!1035}
