; ModuleID = 'ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !3)
!2 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!3 = !{!4, !6, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !26, !27, !28, !29, !33, !35, !37, !41, !44, !46, !48, !49, !50, !51, !55, !56}
!4 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1, file: !2, line: 242, baseType: !5, size: 32)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1, file: !2, line: 260, baseType: !20, size: 64, offset: 768)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !21, file: !2, line: 157, baseType: !20, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !21, file: !2, line: 158, baseType: !0, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !21, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1, file: !2, line: 262, baseType: !0, size: 64, offset: 832)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 131, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!32 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!36 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !2, line: 150, baseType: null)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 132, baseType: !32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "llvm/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mohamad/clone")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 20)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !62, file: !63, line: 53, type: !5, isLocal: true, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !118, globals: !314, nameTableKind: None)
!63 = !DIFile(filename: "src/install.c", directory: "/home/mohamad/clone/coreutils")
!64 = !{!65, !73, !80, !86, !92, !97}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !66, line: 30, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mohamad/clone/coreutils")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !74, line: 69, baseType: !67, size: 32, elements: !75)
!74 = !DIFile(filename: "src/copy.h", directory: "/home/mohamad/clone/coreutils")
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !74, line: 60, baseType: !67, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !74, line: 26, baseType: !67, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !74, line: 47, baseType: !67, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !99, file: !98, line: 39, baseType: !67, size: 32, elements: !111)
!98 = !DIFile(filename: "./lib/savewd.h", directory: "/home/mohamad/clone/coreutils")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !98, line: 36, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !98, line: 66, baseType: !97, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !99, file: !98, line: 74, baseType: !103, size: 32, offset: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !98, line: 69, size: 32, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !103, file: !98, line: 71, baseType: !5, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !103, file: !98, line: 72, baseType: !5, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !103, file: !98, line: 73, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !109, line: 98, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !31, line: 133, baseType: !5)
!111 = !{!112, !113, !114, !115, !116, !117}
!112 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!118 = !{!119, !7, !47, !124, !126, !128, !122, !5, !0, !177, !179, !181, !139, !182, !137, !194, !136, !197, !199, !201, !212, !213, !172, !215, !217, !52, !219, !221, !232, !54, !125, !127, !240, !242, !243, !245, !247, !249, !251, !253, !255, !257, !259, !30, !261, !108, !263, !268, !272, !274, !309, !178, !312}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !120, line: 85, baseType: !121)
!120 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !5}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !109, line: 80, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !31, line: 125, baseType: !67)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !109, line: 65, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !31, line: 126, baseType: !67)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !74, line: 98, size: 640, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !176}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !129, file: !74, line: 100, baseType: !65, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !129, file: !74, line: 103, baseType: !73, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !129, file: !74, line: 108, baseType: !80, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !129, file: !74, line: 111, baseType: !86, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !129, file: !74, line: 115, baseType: !136, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !109, line: 70, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !31, line: 129, baseType: !67)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !129, file: !74, line: 119, baseType: !139, size: 8, offset: 160)
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !129, file: !74, line: 123, baseType: !139, size: 8, offset: 168)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !129, file: !74, line: 130, baseType: !139, size: 8, offset: 176)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !129, file: !74, line: 134, baseType: !139, size: 8, offset: 184)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !129, file: !74, line: 138, baseType: !139, size: 8, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !129, file: !74, line: 141, baseType: !139, size: 8, offset: 200)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !129, file: !74, line: 145, baseType: !139, size: 8, offset: 208)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !129, file: !74, line: 152, baseType: !139, size: 8, offset: 216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !129, file: !74, line: 156, baseType: !139, size: 8, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !129, file: !74, line: 160, baseType: !139, size: 8, offset: 232)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !129, file: !74, line: 161, baseType: !139, size: 8, offset: 240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !129, file: !74, line: 162, baseType: !139, size: 8, offset: 248)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !129, file: !74, line: 163, baseType: !139, size: 8, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !129, file: !74, line: 166, baseType: !139, size: 8, offset: 264)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !129, file: !74, line: 178, baseType: !139, size: 8, offset: 272)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !129, file: !74, line: 182, baseType: !139, size: 8, offset: 280)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !129, file: !74, line: 188, baseType: !139, size: 8, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !129, file: !74, line: 192, baseType: !139, size: 8, offset: 296)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !129, file: !74, line: 201, baseType: !139, size: 8, offset: 304)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !129, file: !74, line: 205, baseType: !139, size: 8, offset: 312)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !129, file: !74, line: 214, baseType: !139, size: 8, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !129, file: !74, line: 223, baseType: !139, size: 8, offset: 328)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !129, file: !74, line: 227, baseType: !139, size: 8, offset: 336)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !129, file: !74, line: 231, baseType: !139, size: 8, offset: 344)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !129, file: !74, line: 235, baseType: !139, size: 8, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !129, file: !74, line: 239, baseType: !139, size: 8, offset: 360)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !129, file: !74, line: 242, baseType: !139, size: 8, offset: 368)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !129, file: !74, line: 245, baseType: !139, size: 8, offset: 376)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !129, file: !74, line: 250, baseType: !139, size: 8, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !129, file: !74, line: 254, baseType: !139, size: 8, offset: 392)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !129, file: !74, line: 259, baseType: !5, size: 32, offset: 416)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !129, file: !74, line: 262, baseType: !92, size: 32, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !129, file: !74, line: 273, baseType: !172, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !174, line: 69, baseType: !175)
!174 = !DIFile(filename: "./lib/hash.h", directory: "/home/mohamad/clone/coreutils")
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !174, line: 67, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !129, file: !74, line: 276, baseType: !172, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!179 = !DISubroutineType(types: !180)
!180 = !{!5, !5, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 4608, elements: !192)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !185, line: 104, size: 256, elements: !186)
!185 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!186 = !{!187, !188, !189, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !185, line: 106, baseType: !177, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !184, file: !185, line: 109, baseType: !5, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !185, line: 110, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !184, file: !185, line: 111, baseType: !5, size: 32, offset: 192)
!192 = !{!193}
!193 = !DISubrange(count: 18)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !196, line: 25, flags: DIFlagFwdDecl)
!196 = !DIFile(filename: "./lib/modechange.h", directory: "/home/mohamad/clone/coreutils")
!197 = !DISubroutineType(types: !198)
!198 = !{null}
!199 = !DISubroutineType(types: !200)
!200 = !{null, !177}
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 896, elements: !210)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !205, file: !204, line: 633, size: 128, elements: !207)
!204 = !DIFile(filename: "src/system.h", directory: "/home/mohamad/clone/coreutils")
!205 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !204, file: !204, line: 631, type: !199, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !206)
!206 = !{}
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !203, file: !204, line: 633, baseType: !177, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !203, file: !204, line: 633, baseType: !177, size: 64, offset: 64)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !128}
!215 = !DISubroutineType(types: !216)
!216 = !{!7, !177}
!217 = !DISubroutineType(types: !218)
!218 = !{!139, !177}
!219 = !DISubroutineType(types: !220)
!220 = !{!139, !136}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !223, line: 49, size: 384, elements: !224)
!223 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!224 = !{!225, !226, !227, !228, !229, !230, !231}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !222, file: !223, line: 51, baseType: !7, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !222, file: !223, line: 52, baseType: !7, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !222, file: !223, line: 53, baseType: !125, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !222, file: !223, line: 54, baseType: !127, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !222, file: !223, line: 55, baseType: !7, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !222, file: !223, line: 56, baseType: !7, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !222, file: !223, line: 57, baseType: !7, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !234, line: 42, size: 256, elements: !235)
!234 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!235 = !{!236, !237, !238, !239}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !233, file: !234, line: 44, baseType: !7, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !233, file: !234, line: 45, baseType: !7, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !233, file: !234, line: 46, baseType: !127, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !233, file: !234, line: 47, baseType: !181, size: 64, offset: 192)
!240 = !DISubroutineType(types: !241)
!241 = !{!5, !7, !242, !47}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!245 = !DISubroutineType(types: !246)
!246 = !{!5, !177, !177, !47}
!247 = !DISubroutineType(types: !248)
!248 = !{!5, !177, !136}
!249 = !DISubroutineType(types: !250)
!250 = !{null, !177, !47}
!251 = !DISubroutineType(types: !252)
!252 = !{!139, !177, !139, !139}
!253 = !DISubroutineType(types: !254)
!254 = !{!139, !5}
!255 = !DISubroutineType(types: !256)
!256 = !{!139, !177, !7, !243}
!257 = !DISubroutineType(types: !258)
!258 = !{!139, !177, !7, !128, !139}
!259 = !DISubroutineType(types: !260)
!260 = !{!139, !177, !177, !243}
!261 = !DISubroutineType(types: !262)
!262 = !{!139, !5, !5}
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !63, line: 564, size: 32, elements: !265)
!264 = distinct !DISubprogram(name: "strip", scope: !63, file: !63, line: 547, type: !217, scopeLine: 548, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !206)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__in", scope: !263, file: !63, line: 564, baseType: !5, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__i", scope: !263, file: !63, line: 564, baseType: !5, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !63, line: 564, size: 32, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__in", scope: !268, file: !63, line: 564, baseType: !5, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__i", scope: !268, file: !63, line: 564, baseType: !5, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!139, !274, !177}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !277, line: 46, size: 1152, elements: !278)
!277 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!278 = !{!279, !281, !283, !285, !286, !287, !288, !289, !290, !291, !293, !295, !303, !304, !305}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !276, file: !277, line: 48, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !31, line: 124, baseType: !54)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !276, file: !277, line: 53, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !31, line: 127, baseType: !54)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !276, file: !277, line: 61, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !31, line: 130, baseType: !54)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !276, file: !277, line: 62, baseType: !137, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !276, file: !277, line: 64, baseType: !125, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !276, file: !277, line: 65, baseType: !127, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !276, file: !277, line: 67, baseType: !5, size: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !276, file: !277, line: 69, baseType: !280, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !276, file: !277, line: 74, baseType: !30, size: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !276, file: !277, line: 78, baseType: !292, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !31, line: 153, baseType: !32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !276, file: !277, line: 80, baseType: !294, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !31, line: 158, baseType: !32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !276, file: !277, line: 91, baseType: !296, size: 128, offset: 576)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !297, line: 120, size: 128, elements: !298)
!297 = !DIFile(filename: "/usr/include/time.h", directory: "")
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !296, file: !297, line: 122, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !31, line: 139, baseType: !32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !296, file: !297, line: 123, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !31, line: 175, baseType: !32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !276, file: !277, line: 92, baseType: !296, size: 128, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !276, file: !277, line: 93, baseType: !296, size: 128, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !276, file: !277, line: 106, baseType: !306, size: 192, offset: 960)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 192, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 3)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 256, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 2)
!312 = !DISubroutineType(types: !313)
!313 = !{!139, !177, !177, !243, !139}
!314 = !{!315, !317, !319, !321, !323, !60, !325, !327, !329, !331, !333, !335, !337, !339, !341, !347, !349}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "owner_name", scope: !62, file: !63, line: 74, type: !7, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "group_name", scope: !62, file: !63, line: 81, type: !7, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !62, file: !63, line: 102, type: !139, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "strip_files", scope: !62, file: !63, line: 105, type: !139, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "dir_arg", scope: !62, file: !63, line: 108, type: !139, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "long_options", scope: !62, file: !63, line: 121, type: !182, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "strip_program", scope: !62, file: !63, line: 111, type: !177, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !62, file: !63, line: 54, type: !139, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "mode", scope: !62, file: !63, line: 90, type: !136, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !62, file: !63, line: 99, type: !136, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "dir_mode", scope: !62, file: !63, line: 93, type: !136, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "owner_id", scope: !62, file: !63, line: 77, type: !124, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "group_id", scope: !62, file: !63, line: 84, type: !126, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "a_buff", scope: !343, file: !63, line: 149, type: !344, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "have_same_content", scope: !63, file: !63, line: 146, type: !261, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !206)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32768, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 4096)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "b_buff", scope: !343, file: !63, line: 150, type: !344, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "first_call", scope: !351, file: !63, line: 318, type: !139, isLocal: true, isDefinition: true)
!351 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !63, file: !63, line: 314, type: !199, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !206)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !354, file: !355, line: 147, type: !177, isLocal: true, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, retainedTypes: !357, globals: !578, nameTableKind: None)
!355 = !DIFile(filename: "src/copy.c", directory: "/home/mohamad/clone/coreutils")
!356 = !{!65, !73, !80, !86, !92}
!357 = !{!136, !47, !67, !7, !54, !52, !358, !360, !139, !177, !362, !5, !405, !407, !409, !172, !410, !412, !413, !415, !253, !247, !251, !417, !419, !442, !137, !280, !282, !284, !450, !447, !449, !178, !30, !125, !127, !451, !452, !454, !456, !458, !460, !462, !464, !467, !217, !8, !505, !507, !509, !511, !513, !515, !292, !517, !519, !521, !294, !523, !525, !527, !529, !536, !538, !548, !550, !552, !554, !556, !558, !559, !561, !563, !565, !564, !566, !197, !568, !570, !572, !124, !126, !574, !576}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !359, line: 90, baseType: !30)
!359 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!360 = !DISubroutineType(types: !361)
!361 = !{!139, !177, !177, !136, !139, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !74, line: 98, size: 640, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !364, file: !74, line: 100, baseType: !65, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !364, file: !74, line: 103, baseType: !73, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !364, file: !74, line: 108, baseType: !80, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !364, file: !74, line: 111, baseType: !86, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !364, file: !74, line: 115, baseType: !136, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !364, file: !74, line: 119, baseType: !139, size: 8, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !364, file: !74, line: 123, baseType: !139, size: 8, offset: 168)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !364, file: !74, line: 130, baseType: !139, size: 8, offset: 176)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !364, file: !74, line: 134, baseType: !139, size: 8, offset: 184)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !364, file: !74, line: 138, baseType: !139, size: 8, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !364, file: !74, line: 141, baseType: !139, size: 8, offset: 200)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !364, file: !74, line: 145, baseType: !139, size: 8, offset: 208)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !364, file: !74, line: 152, baseType: !139, size: 8, offset: 216)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !364, file: !74, line: 156, baseType: !139, size: 8, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !364, file: !74, line: 160, baseType: !139, size: 8, offset: 232)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !364, file: !74, line: 161, baseType: !139, size: 8, offset: 240)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !364, file: !74, line: 162, baseType: !139, size: 8, offset: 248)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !364, file: !74, line: 163, baseType: !139, size: 8, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !364, file: !74, line: 166, baseType: !139, size: 8, offset: 264)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !364, file: !74, line: 178, baseType: !139, size: 8, offset: 272)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !364, file: !74, line: 182, baseType: !139, size: 8, offset: 280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !364, file: !74, line: 188, baseType: !139, size: 8, offset: 288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !364, file: !74, line: 192, baseType: !139, size: 8, offset: 296)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !364, file: !74, line: 201, baseType: !139, size: 8, offset: 304)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !364, file: !74, line: 205, baseType: !139, size: 8, offset: 312)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !364, file: !74, line: 214, baseType: !139, size: 8, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !364, file: !74, line: 223, baseType: !139, size: 8, offset: 328)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !364, file: !74, line: 227, baseType: !139, size: 8, offset: 336)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !364, file: !74, line: 231, baseType: !139, size: 8, offset: 344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !364, file: !74, line: 235, baseType: !139, size: 8, offset: 352)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !364, file: !74, line: 239, baseType: !139, size: 8, offset: 360)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !364, file: !74, line: 242, baseType: !139, size: 8, offset: 368)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !364, file: !74, line: 245, baseType: !139, size: 8, offset: 376)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !364, file: !74, line: 250, baseType: !139, size: 8, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !364, file: !74, line: 254, baseType: !139, size: 8, offset: 392)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !364, file: !74, line: 259, baseType: !5, size: 32, offset: 416)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !364, file: !74, line: 262, baseType: !92, size: 32, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !364, file: !74, line: 273, baseType: !172, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !364, file: !74, line: 276, baseType: !172, size: 64, offset: 576)
!405 = !DISubroutineType(types: !406)
!406 = !{!139, !177, !139, !139, !362}
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!139, !177, !177, !139, !362, !412, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!139, !362}
!415 = !DISubroutineType(types: !416)
!416 = !{!136}
!417 = !DISubroutineType(types: !418)
!418 = !{!139, !177, !177, !139, !419, !442, !362, !139, !412, !412, !412}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !277, line: 46, size: 1152, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !439, !440, !441}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !421, file: !277, line: 48, baseType: !280, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !421, file: !277, line: 53, baseType: !282, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !421, file: !277, line: 61, baseType: !284, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !421, file: !277, line: 62, baseType: !137, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !421, file: !277, line: 64, baseType: !125, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !421, file: !277, line: 65, baseType: !127, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !421, file: !277, line: 67, baseType: !5, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !421, file: !277, line: 69, baseType: !280, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !421, file: !277, line: 74, baseType: !30, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !421, file: !277, line: 78, baseType: !292, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !421, file: !277, line: 80, baseType: !294, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !421, file: !277, line: 91, baseType: !435, size: 128, offset: 576)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !297, line: 120, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !435, file: !297, line: 122, baseType: !300, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !435, file: !297, line: 123, baseType: !302, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !421, file: !277, line: 92, baseType: !435, size: 128, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !421, file: !277, line: 93, baseType: !435, size: 128, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !421, file: !277, line: 106, baseType: !306, size: 192, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !355, line: 125, size: 192, elements: !444)
!444 = !{!445, !446, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !443, file: !355, line: 127, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !443, file: !355, line: 128, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !109, line: 48, baseType: !282)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !443, file: !355, line: 129, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !109, line: 60, baseType: !280)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 256, elements: !310)
!452 = !DISubroutineType(types: !453)
!453 = !{!5, !5, !177, !450, !5}
!454 = !DISubroutineType(types: !455)
!455 = !{!139, !362, !139}
!456 = !DISubroutineType(types: !457)
!457 = !{!139, !177, !419, !177, !419, !362, !412}
!458 = !DISubroutineType(types: !459)
!459 = !{!139, !177, !177, !139, !139, !139}
!460 = !DISubroutineType(types: !461)
!461 = !{!139, !362, !177, !419}
!462 = !DISubroutineType(types: !463)
!463 = !{!139, !177, !136}
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 12)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !468, file: !2, line: 242, baseType: !5, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !468, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !468, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !468, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !468, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !468, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !468, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !468, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !468, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !468, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !468, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !468, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !468, file: !2, line: 260, baseType: !483, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !484, file: !2, line: 157, baseType: !483, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !484, file: !2, line: 158, baseType: !467, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !484, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !468, file: !2, line: 262, baseType: !467, size: 64, offset: 832)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !468, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !468, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !468, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !468, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !468, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !468, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !468, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !468, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !468, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !468, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !468, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !468, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !468, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !468, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !468, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!505 = !DISubroutineType(types: !506)
!506 = !{!139, !177, !419, !177}
!507 = !DISubroutineType(types: !508)
!508 = !{null, !177, !177, !177}
!509 = !DISubroutineType(types: !510)
!510 = !{!139, !419, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!513 = !DISubroutineType(types: !514)
!514 = !{!139, !177, !177, !139, !419, !442, !362, !412, !412}
!515 = !DISubroutineType(types: !516)
!516 = !{!139, !177, !177, !362, !136, !136, !412, !419}
!517 = !DISubroutineType(types: !518)
!518 = !{!5, !5, !5}
!519 = !DISubroutineType(types: !520)
!520 = !{!52, !421}
!521 = !DISubroutineType(types: !522)
!522 = !{!139, !419}
!523 = !DISubroutineType(types: !524)
!524 = !{!47, !525, !52}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!527 = !DISubroutineType(types: !528)
!528 = !{!139, !5, !5, !7, !52, !52, !358, !86, !177, !177, !412}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !531, line: 23, size: 192, elements: !532)
!531 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mohamad/clone/coreutils")
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !530, file: !531, line: 26, baseType: !358, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !530, file: !531, line: 29, baseType: !358, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !530, file: !531, line: 32, baseType: !67, size: 32, offset: 128)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !531, line: 36, size: 384, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !539, file: !531, line: 39, baseType: !5, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !539, file: !531, line: 42, baseType: !358, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !539, file: !531, line: 45, baseType: !67, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !539, file: !531, line: 48, baseType: !52, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !539, file: !531, line: 52, baseType: !139, size: 8, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !539, file: !531, line: 55, baseType: !139, size: 8, offset: 264)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !539, file: !531, line: 58, baseType: !529, size: 64, offset: 320)
!548 = !DISubroutineType(types: !549)
!549 = !{!139, !5, !177, !139, !358}
!550 = !DISubroutineType(types: !551)
!551 = !{!139, !5, !358}
!552 = !DISubroutineType(types: !553)
!553 = !{!5, !5, !358, !358}
!554 = !DISubroutineType(types: !555)
!555 = !{!139, !5, !5, !7, !52, !52, !139, !177, !177, !556, !558, !412}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !557, line: 135, baseType: !54)
!557 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !359, line: 102, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 172, baseType: !32)
!561 = !DISubroutineType(types: !562)
!562 = !{!139, !525, !52}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!566 = !DISubroutineType(types: !567)
!567 = !{!5, !5, !177, !136}
!568 = !DISubroutineType(types: !569)
!569 = !{!5, !177, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!572 = !DISubroutineType(types: !573)
!573 = !{!5, !362, !177, !5, !419, !139, !419}
!574 = !DISubroutineType(types: !575)
!575 = !{!139, !177, !5, !177, !5, !362}
!576 = !DISubroutineType(types: !577)
!577 = !{null, !177, !5, !419}
!578 = !{!579, !352, !582, !584, !587, !589}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "mask", scope: !581, file: !355, line: 3089, type: !136, isLocal: true, isDefinition: true)
!581 = distinct !DISubprogram(name: "cached_umask", scope: !355, file: !355, line: 3087, type: !415, scopeLine: 3088, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !354, retainedNodes: !206)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !354, file: !355, line: 148, type: !177, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "zeros", scope: !586, file: !355, line: 387, type: !7, isLocal: true, isDefinition: true)
!586 = distinct !DISubprogram(name: "write_zeros", scope: !355, file: !355, line: 385, type: !550, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !354, retainedNodes: !206)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "nz", scope: !586, file: !355, line: 388, type: !52, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "fallback", scope: !586, file: !355, line: 395, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 1024)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !596, file: !597, line: 45, type: !172, isLocal: true, isDefinition: true)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !598, globals: !619, nameTableKind: None)
!597 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mohamad/clone/coreutils")
!598 = !{!47, !7, !556, !599, !447, !449, !601, !172, !607, !609, !611, !177, !197, !613, !615, !52, !525, !617, !139}
!599 = !DISubroutineType(types: !600)
!600 = !{null, !447, !449}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !597, line: 33, size: 192, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !602, file: !597, line: 35, baseType: !447, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !602, file: !597, line: 36, baseType: !449, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !597, line: 40, baseType: !7, size: 64, offset: 128)
!607 = !DISubroutineType(types: !608)
!608 = !{!7, !447, !449}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!611 = !DISubroutineType(types: !612)
!612 = !{!7, !177, !447, !449}
!613 = !DISubroutineType(types: !614)
!614 = !{null, !47}
!615 = !DISubroutineType(types: !616)
!616 = !{!52, !525, !52}
!617 = !DISubroutineType(types: !618)
!618 = !{!139, !525, !525}
!619 = !{!594}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !622, file: !623, line: 38, type: !635, isLocal: true, isDefinition: true)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !624, globals: !652, nameTableKind: None)
!623 = !DIFile(filename: "src/force-link.c", directory: "/home/mohamad/clone/coreutils")
!624 = !{!625, !5, !177, !139, !627, !7, !630, !632, !634, !52, !635, !638, !47, !640, !647}
!625 = !DISubroutineType(types: !626)
!626 = !{!5, !5, !177, !5, !177, !5, !139, !5}
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 256)
!630 = !DISubroutineType(types: !631)
!631 = !{!5, !177, !5, !177, !139, !5}
!632 = !DISubroutineType(types: !633)
!633 = !{!7, !177, !7}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 35, baseType: !32)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 72, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 9)
!638 = !DISubroutineType(types: !639)
!639 = !{!5, !7, !47}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !623, line: 71, size: 192, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !641, file: !623, line: 73, baseType: !5, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !641, file: !623, line: 74, baseType: !177, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !641, file: !623, line: 75, baseType: !5, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !641, file: !623, line: 76, baseType: !5, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !623, line: 131, size: 128, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !648, file: !623, line: 133, baseType: !177, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !648, file: !623, line: 134, baseType: !5, size: 32, offset: 64)
!652 = !{!620}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "Version", scope: !655, file: !656, line: 2, type: !177, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !657, globals: !658, nameTableKind: None)
!656 = !DIFile(filename: "src/version.c", directory: "/home/mohamad/clone/coreutils")
!657 = !{!177}
!658 = !{!653}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !661, file: !665, line: 82, type: !177, isLocal: false, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !663, retainedTypes: !671, globals: !695, nameTableKind: None)
!662 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!663 = !{!65, !664}
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !665, line: 172, baseType: !67, size: 32, elements: !666)
!665 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!666 = !{!667, !668, !669, !670}
!667 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!668 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!669 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!670 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!671 = !{!47, !67, !52, !177, !199, !178, !672, !7, !5, !139, !634, !674, !675, !679, !181, !681, !190, !682, !691, !8, !692, !694, !32}
!672 = !DISubroutineType(types: !673)
!673 = !{!7, !5, !177, !65, !139}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !109, line: 109, baseType: !560)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !677, line: 127, baseType: !678)
!677 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !677, line: 127, flags: DIFlagFwdDecl)
!679 = !DISubroutineType(types: !680)
!680 = !{!664, !5, !181, !52, !52, !634, !681, !190}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !684, line: 22, size: 2240, elements: !685)
!684 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!685 = !{!686, !687, !688, !689, !690}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !683, file: !684, line: 25, baseType: !282, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !683, file: !684, line: 26, baseType: !30, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !683, file: !684, line: 31, baseType: !34, size: 16, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !683, file: !684, line: 32, baseType: !565, size: 8, offset: 144)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !683, file: !684, line: 33, baseType: !627, size: 2048, offset: 152)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !310)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !7, !52, !8, !5, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!695 = !{!659}
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "backup_args", scope: !698, file: !718, line: 42, type: !710, isLocal: true, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !700, retainedTypes: !701, globals: !715, nameTableKind: None)
!699 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!700 = !{!65}
!701 = !{!525, !702, !7, !5, !177, !704, !178, !706, !710, !712}
!702 = !DISubroutineType(types: !703)
!703 = !{!7, !5, !177, !65}
!704 = !DISubroutineType(types: !705)
!705 = !{!65, !177, !177}
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 256, elements: !708)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!708 = !{!709}
!709 = !DISubrange(count: 8)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 576, elements: !636)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !713, line: 61, baseType: !714)
!713 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mohamad/clone/coreutils")
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!715 = !{!716, !696}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "backup_types", scope: !698, file: !718, line: 53, type: !706, isLocal: true, isDefinition: true)
!718 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "file_name", scope: !721, file: !764, line: 37, type: !177, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !723, globals: !763, nameTableKind: None)
!722 = !DIFile(filename: "./lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!723 = !{!199, !177, !197, !139, !724, !5, !762}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !725, file: !2, line: 242, baseType: !5, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !725, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !725, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !725, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !725, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !725, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !725, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !725, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !725, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !725, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !725, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !725, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !725, file: !2, line: 260, baseType: !740, size: 64, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !741, file: !2, line: 157, baseType: !740, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !741, file: !2, line: 158, baseType: !724, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !741, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !725, file: !2, line: 262, baseType: !724, size: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !725, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !725, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !725, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !725, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !725, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !725, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !725, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !725, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !725, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !725, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !725, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !725, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !725, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !725, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !725, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!762 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5)
!763 = !{!719}
!764 = !DIFile(filename: "lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "file_name", scope: !767, file: !813, line: 46, type: !177, isLocal: true, isDefinition: true)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !769, globals: !810, nameTableKind: None)
!768 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!769 = !{!199, !177, !770, !139, !197, !772, !5, !762}
!770 = !DISubroutineType(types: !771)
!771 = !{null, !139}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !773, file: !2, line: 242, baseType: !5, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !773, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !773, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !773, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !773, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !773, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !773, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !773, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !773, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !773, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !773, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !773, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !773, file: !2, line: 260, baseType: !788, size: 64, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !789, file: !2, line: 157, baseType: !788, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !789, file: !2, line: 158, baseType: !772, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !789, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !773, file: !2, line: 262, baseType: !772, size: 64, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !773, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !773, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !773, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !773, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !773, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !773, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !773, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !773, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !773, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !773, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !773, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !773, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !773, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !773, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !773, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!810 = !{!765, !811}
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !767, file: !813, line: 56, type: !139, isLocal: true, isDefinition: true)
!813 = !DIFile(filename: "lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "exit_failure", scope: !816, file: !820, line: 24, type: !762, isLocal: false, isDefinition: true)
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !818, globals: !819, nameTableKind: None)
!817 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!818 = !{!762}
!819 = !{!814}
!820 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "default_tuning", scope: !823, file: !832, line: 130, type: !848, isLocal: true, isDefinition: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !825, globals: !961, nameTableKind: None)
!824 = !DIFile(filename: "./lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!825 = !{!54, !47, !52, !826, !828, !829, !841, !835, !868, !139, !870, !872, !912, !525, !862, !914, !916, !918, !919, !921, !925, !177, !565, !178, !927, !929, !848, !930, !932, !847, !859, !865, !830, !933, !935, !937, !5, !939, !853, !940, !942, !615, !617, !944, !946, !948, !950, !952, !954, !956, !958, !959}
!826 = !DISubroutineType(types: !827)
!827 = !{!52, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !174, line: 69, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !832, line: 52, size: 640, elements: !833)
!832 = !DIFile(filename: "lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!833 = !{!834, !840, !843, !844, !845, !846, !858, !861, !864, !867}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !831, file: !832, line: 57, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !832, line: 46, size: 128, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !836, file: !832, line: 48, baseType: !47, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !836, file: !832, line: 49, baseType: !835, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !831, file: !832, line: 58, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !831, file: !832, line: 59, baseType: !52, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !831, file: !832, line: 60, baseType: !52, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !831, file: !832, line: 61, baseType: !52, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !831, file: !832, line: 64, baseType: !847, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !174, line: 65, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !174, line: 53, size: 160, elements: !851)
!851 = !{!852, !854, !855, !856, !857}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !850, file: !174, line: 58, baseType: !853, size: 32)
!853 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !850, file: !174, line: 59, baseType: !853, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !850, file: !174, line: 60, baseType: !853, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !850, file: !174, line: 61, baseType: !853, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !850, file: !174, line: 62, baseType: !139, size: 8, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !831, file: !832, line: 71, baseType: !859, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !174, line: 48, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !831, file: !832, line: 72, baseType: !862, size: 64, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !174, line: 49, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !831, file: !832, line: 73, baseType: !865, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !174, line: 50, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !831, file: !832, line: 76, baseType: !835, size: 64, offset: 576)
!868 = !DISubroutineType(types: !869)
!869 = !{!139, !828}
!870 = !DISubroutineType(types: !871)
!871 = !{null, !828, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !359, line: 48, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !874, file: !2, line: 242, baseType: !5, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !874, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !874, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !874, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !874, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !874, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !874, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !874, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !874, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !874, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !874, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !874, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !874, file: !2, line: 260, baseType: !889, size: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !891)
!891 = !{!892, !893, !895}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !890, file: !2, line: 157, baseType: !889, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !890, file: !2, line: 158, baseType: !894, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !890, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !874, file: !2, line: 262, baseType: !894, size: 64, offset: 832)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !874, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !874, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !874, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !874, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !874, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !874, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !874, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !874, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !874, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !874, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !874, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !874, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !874, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !874, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !874, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!912 = !DISubroutineType(types: !913)
!913 = !{!47, !828, !525}
!914 = !DISubroutineType(types: !915)
!915 = !{!47, !828}
!916 = !DISubroutineType(types: !917)
!917 = !{!52, !828, !918, !52}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!52, !828, !921, !47}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_processor", file: !174, line: 51, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!139, !47, !47}
!925 = !DISubroutineType(types: !926)
!926 = !{!52, !177, !52}
!927 = !DISubroutineType(types: !928)
!928 = !{null, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!932, !52, !847, !859, !862, !865}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !932}
!935 = !DISubroutineType(types: !936)
!936 = !{!139, !932, !52}
!937 = !DISubroutineType(types: !938)
!938 = !{!5, !932, !525, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!47, !932, !525}
!942 = !DISubroutineType(types: !943)
!943 = !{!835, !828, !525}
!944 = !DISubroutineType(types: !945)
!945 = !{!139, !932}
!946 = !DISubroutineType(types: !947)
!947 = !{!52, !52, !847}
!948 = !DISubroutineType(types: !949)
!949 = !{!52, !52}
!950 = !DISubroutineType(types: !951)
!951 = !{!139, !52}
!952 = !DISubroutineType(types: !953)
!953 = !{!139, !932, !932, !139}
!954 = !DISubroutineType(types: !955)
!955 = !{null, !932, !835}
!956 = !DISubroutineType(types: !957)
!957 = !{!47, !932, !525, !958, !139}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!835, !932}
!961 = !{!821}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "program_name", scope: !964, file: !1006, line: 33, type: !177, isLocal: false, isDefinition: true)
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !966, globals: !1005, nameTableKind: None)
!965 = !DIFile(filename: "./lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!966 = !{!47, !7, !177, !199, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !968, file: !2, line: 242, baseType: !5, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !968, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !968, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !968, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !968, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !968, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !968, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !968, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !968, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !968, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !968, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !968, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !968, file: !2, line: 260, baseType: !983, size: 64, offset: 768)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !984, file: !2, line: 157, baseType: !983, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !984, file: !2, line: 158, baseType: !967, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !984, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !968, file: !2, line: 262, baseType: !967, size: 64, offset: 832)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !968, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !968, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !968, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !968, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !968, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !968, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !968, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !968, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !968, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !968, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !968, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !968, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !968, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !968, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !968, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!1005 = !{!962}
!1006 = !DIFile(filename: "lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1009, file: !1038, line: 85, type: !1027, isLocal: false, isDefinition: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1011, retainedTypes: !1026, globals: !1131, nameTableKind: None)
!1010 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!1011 = !{!1012}
!1012 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1013, line: 32, baseType: !67, size: 32, elements: !1014)
!1013 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mohamad/clone/coreutils")
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
