; ModuleID = 'ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !65, file: !66, line: 53, type: !7, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !121, globals: !308, nameTableKind: None)
!66 = !DIFile(filename: "src/install.c", directory: "/home/mbarbar/software/coreutils-8.31")
!67 = !{!68, !76, !83, !89, !95, !100}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !69, line: 30, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mbarbar/software/coreutils-8.31")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !77, line: 69, baseType: !70, size: 32, elements: !78)
!77 = !DIFile(filename: "src/copy.h", directory: "/home/mbarbar/software/coreutils-8.31")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !77, line: 60, baseType: !70, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !77, line: 26, baseType: !70, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !77, line: 47, baseType: !70, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !102, file: !101, line: 39, baseType: !70, size: 32, elements: !114)
!101 = !DIFile(filename: "./lib/savewd.h", directory: "/home/mbarbar/software/coreutils-8.31")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !101, line: 36, size: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !101, line: 66, baseType: !100, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !101, line: 74, baseType: !106, size: 32, offset: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !101, line: 69, size: 32, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !106, file: !101, line: 71, baseType: !7, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !106, file: !101, line: 72, baseType: !7, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !106, file: !101, line: 73, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !112, line: 97, baseType: !113)
!112 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 154, baseType: !7)
!114 = !{!115, !116, !117, !118, !119, !120}
!115 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!119 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!121 = !{!122, !9, !53, !127, !129, !131, !125, !0, !180, !182, !7, !142, !184, !185, !140, !197, !139, !200, !202, !204, !215, !216, !175, !218, !220, !55, !222, !224, !235, !57, !128, !130, !243, !246, !248, !250, !252, !254, !256, !258, !260, !262, !29, !264, !111, !266, !303, !181, !306}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !123, line: 72, baseType: !124)
!123 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !7}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !112, line: 79, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !70)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !112, line: 64, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !70)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !179}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !132, file: !77, line: 100, baseType: !68, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !132, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !132, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !132, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !132, file: !77, line: 115, baseType: !139, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !112, line: 69, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !70)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !132, file: !77, line: 119, baseType: !142, size: 8, offset: 160)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !132, file: !77, line: 123, baseType: !142, size: 8, offset: 168)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !132, file: !77, line: 130, baseType: !142, size: 8, offset: 176)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !132, file: !77, line: 134, baseType: !142, size: 8, offset: 184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !132, file: !77, line: 138, baseType: !142, size: 8, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !132, file: !77, line: 141, baseType: !142, size: 8, offset: 200)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !132, file: !77, line: 145, baseType: !142, size: 8, offset: 208)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !132, file: !77, line: 152, baseType: !142, size: 8, offset: 216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !132, file: !77, line: 156, baseType: !142, size: 8, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !132, file: !77, line: 160, baseType: !142, size: 8, offset: 232)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !132, file: !77, line: 161, baseType: !142, size: 8, offset: 240)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !132, file: !77, line: 162, baseType: !142, size: 8, offset: 248)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !132, file: !77, line: 163, baseType: !142, size: 8, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !132, file: !77, line: 166, baseType: !142, size: 8, offset: 264)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !132, file: !77, line: 178, baseType: !142, size: 8, offset: 272)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !132, file: !77, line: 182, baseType: !142, size: 8, offset: 280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !132, file: !77, line: 188, baseType: !142, size: 8, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !132, file: !77, line: 192, baseType: !142, size: 8, offset: 296)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !132, file: !77, line: 201, baseType: !142, size: 8, offset: 304)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !132, file: !77, line: 205, baseType: !142, size: 8, offset: 312)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !132, file: !77, line: 214, baseType: !142, size: 8, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !132, file: !77, line: 223, baseType: !142, size: 8, offset: 328)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !132, file: !77, line: 227, baseType: !142, size: 8, offset: 336)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !132, file: !77, line: 231, baseType: !142, size: 8, offset: 344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !132, file: !77, line: 235, baseType: !142, size: 8, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !132, file: !77, line: 239, baseType: !142, size: 8, offset: 360)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !132, file: !77, line: 242, baseType: !142, size: 8, offset: 368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !132, file: !77, line: 245, baseType: !142, size: 8, offset: 376)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !132, file: !77, line: 250, baseType: !142, size: 8, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !132, file: !77, line: 254, baseType: !142, size: 8, offset: 392)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !132, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !132, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !132, file: !77, line: 273, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !177, line: 69, baseType: !178)
!177 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !177, line: 67, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !132, file: !77, line: 276, baseType: !175, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!182 = !DISubroutineType(types: !183)
!183 = !{!7, !7, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 4608, elements: !195)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !188, line: 50, size: 256, elements: !189)
!188 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!189 = !{!190, !191, !192, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !188, line: 52, baseType: !180, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !187, file: !188, line: 55, baseType: !7, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !188, line: 56, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !187, file: !188, line: 57, baseType: !7, size: 32, offset: 192)
!195 = !{!196}
!196 = !DISubrange(count: 18)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !199, line: 25, flags: DIFlagFwdDecl)
!199 = !DIFile(filename: "./lib/modechange.h", directory: "/home/mbarbar/software/coreutils-8.31")
!200 = !DISubroutineType(types: !201)
!201 = !{null}
!202 = !DISubroutineType(types: !203)
!203 = !{null, !180}
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, elements: !213)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !208, file: !207, line: 633, size: 128, elements: !210)
!207 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!208 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !207, file: !207, line: 631, type: !202, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !209)
!209 = !{}
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !206, file: !207, line: 633, baseType: !180, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !207, line: 633, baseType: !180, size: 64, offset: 64)
!213 = !{!214}
!214 = !DISubrange(count: 7)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !131}
!218 = !DISubroutineType(types: !219)
!219 = !{!9, !180}
!220 = !DISubroutineType(types: !221)
!221 = !{!142, !180}
!222 = !DISubroutineType(types: !223)
!223 = !{!142, !139}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !226, line: 49, size: 384, elements: !227)
!226 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!227 = !{!228, !229, !230, !231, !232, !233, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !225, file: !226, line: 51, baseType: !9, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !225, file: !226, line: 52, baseType: !9, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !225, file: !226, line: 54, baseType: !128, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !225, file: !226, line: 55, baseType: !130, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !225, file: !226, line: 56, baseType: !9, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !225, file: !226, line: 57, baseType: !9, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !225, file: !226, line: 58, baseType: !9, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !237, line: 42, size: 256, elements: !238)
!237 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !236, file: !237, line: 44, baseType: !9, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !236, file: !237, line: 45, baseType: !9, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !236, file: !237, line: 46, baseType: !130, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !236, file: !237, line: 47, baseType: !184, size: 64, offset: 192)
!243 = !DISubroutineType(types: !244)
!244 = !{!7, !9, !245, !53}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!248 = !DISubroutineType(types: !249)
!249 = !{!7, !180, !180, !53}
!250 = !DISubroutineType(types: !251)
!251 = !{!7, !180, !139}
!252 = !DISubroutineType(types: !253)
!253 = !{null, !180, !53}
!254 = !DISubroutineType(types: !255)
!255 = !{!142, !180, !142, !142}
!256 = !DISubroutineType(types: !257)
!257 = !{!142, !7}
!258 = !DISubroutineType(types: !259)
!259 = !{!142, !180, !9, !246}
!260 = !DISubroutineType(types: !261)
!261 = !{!142, !180, !9, !131, !142}
!262 = !DISubroutineType(types: !263)
!263 = !{!142, !180, !180, !246}
!264 = !DISubroutineType(types: !265)
!265 = !{!142, !7, !7}
!266 = !DISubroutineType(types: !267)
!267 = !{!142, !268, !180}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !271, line: 46, size: 1152, elements: !272)
!271 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!272 = !{!273, !275, !277, !279, !280, !281, !282, !283, !284, !285, !287, !289, !297, !298, !299}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !270, file: !271, line: 48, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !270, file: !271, line: 53, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !270, file: !271, line: 61, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !270, file: !271, line: 62, baseType: !140, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !270, file: !271, line: 64, baseType: !128, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !270, file: !271, line: 65, baseType: !130, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !270, file: !271, line: 67, baseType: !7, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !270, file: !271, line: 69, baseType: !274, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !270, file: !271, line: 74, baseType: !29, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !270, file: !271, line: 78, baseType: !286, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !270, file: !271, line: 80, baseType: !288, size: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !270, file: !271, line: 91, baseType: !290, size: 128, offset: 576)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !291, line: 9, size: 128, elements: !292)
!291 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!292 = !{!293, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !290, file: !291, line: 11, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !290, file: !291, line: 12, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !270, file: !271, line: 92, baseType: !290, size: 128, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !270, file: !271, line: 93, baseType: !290, size: 128, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !270, file: !271, line: 106, baseType: !300, size: 192, offset: 960)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 192, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 3)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 256, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 2)
!306 = !DISubroutineType(types: !307)
!307 = !{!142, !180, !180, !246, !142}
!308 = !{!309, !311, !313, !315, !317, !63, !319, !321, !323, !325, !327, !329, !331, !333, !335, !341, !343}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "owner_name", scope: !65, file: !66, line: 74, type: !9, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "group_name", scope: !65, file: !66, line: 81, type: !9, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !65, file: !66, line: 102, type: !142, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "strip_files", scope: !65, file: !66, line: 105, type: !142, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "dir_arg", scope: !65, file: !66, line: 108, type: !142, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 121, type: !185, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "strip_program", scope: !65, file: !66, line: 111, type: !180, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !65, file: !66, line: 54, type: !142, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "mode", scope: !65, file: !66, line: 90, type: !139, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !65, file: !66, line: 99, type: !139, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "dir_mode", scope: !65, file: !66, line: 93, type: !139, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "owner_id", scope: !65, file: !66, line: 77, type: !127, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "group_id", scope: !65, file: !66, line: 84, type: !129, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "a_buff", scope: !337, file: !66, line: 149, type: !338, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "have_same_content", scope: !66, file: !66, line: 146, type: !264, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !209)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32768, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 4096)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "b_buff", scope: !337, file: !66, line: 150, type: !338, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "first_call", scope: !345, file: !66, line: 318, type: !142, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !66, file: !66, line: 314, type: !202, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !209)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !348, file: !349, line: 147, type: !180, isLocal: true, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !350, retainedTypes: !351, globals: !596, nameTableKind: None)
!349 = !DIFile(filename: "src/copy.c", directory: "/home/mbarbar/software/coreutils-8.31")
!350 = !{!68, !76, !83, !89, !95}
!351 = !{!139, !53, !70, !9, !57, !55, !352, !354, !142, !7, !399, !401, !175, !404, !180, !407, !409, !256, !250, !254, !411, !140, !274, !276, !278, !444, !436, !441, !443, !181, !29, !128, !130, !445, !446, !448, !413, !450, !452, !454, !456, !459, !220, !10, !493, !495, !497, !501, !503, !286, !505, !507, !509, !288, !511, !515, !517, !524, !536, !538, !540, !542, !548, !550, !552, !554, !553, !555, !200, !557, !561, !127, !129, !563, !565, !581, !577, !592, !594}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !353, line: 63, baseType: !29)
!353 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!354 = !DISubroutineType(types: !355)
!355 = !{!142, !180, !180, !139, !142, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !358, file: !77, line: 100, baseType: !68, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !358, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !358, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !358, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !358, file: !77, line: 115, baseType: !139, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !358, file: !77, line: 119, baseType: !142, size: 8, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !358, file: !77, line: 123, baseType: !142, size: 8, offset: 168)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !358, file: !77, line: 130, baseType: !142, size: 8, offset: 176)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !358, file: !77, line: 134, baseType: !142, size: 8, offset: 184)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !358, file: !77, line: 138, baseType: !142, size: 8, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !358, file: !77, line: 141, baseType: !142, size: 8, offset: 200)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !358, file: !77, line: 145, baseType: !142, size: 8, offset: 208)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !358, file: !77, line: 152, baseType: !142, size: 8, offset: 216)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !358, file: !77, line: 156, baseType: !142, size: 8, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !358, file: !77, line: 160, baseType: !142, size: 8, offset: 232)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !358, file: !77, line: 161, baseType: !142, size: 8, offset: 240)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !358, file: !77, line: 162, baseType: !142, size: 8, offset: 248)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !358, file: !77, line: 163, baseType: !142, size: 8, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !358, file: !77, line: 166, baseType: !142, size: 8, offset: 264)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !358, file: !77, line: 178, baseType: !142, size: 8, offset: 272)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !358, file: !77, line: 182, baseType: !142, size: 8, offset: 280)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !358, file: !77, line: 188, baseType: !142, size: 8, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !358, file: !77, line: 192, baseType: !142, size: 8, offset: 296)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !358, file: !77, line: 201, baseType: !142, size: 8, offset: 304)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !358, file: !77, line: 205, baseType: !142, size: 8, offset: 312)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !358, file: !77, line: 214, baseType: !142, size: 8, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !358, file: !77, line: 223, baseType: !142, size: 8, offset: 328)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !358, file: !77, line: 227, baseType: !142, size: 8, offset: 336)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !358, file: !77, line: 231, baseType: !142, size: 8, offset: 344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !358, file: !77, line: 235, baseType: !142, size: 8, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !358, file: !77, line: 239, baseType: !142, size: 8, offset: 360)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !358, file: !77, line: 242, baseType: !142, size: 8, offset: 368)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !358, file: !77, line: 245, baseType: !142, size: 8, offset: 376)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !358, file: !77, line: 250, baseType: !142, size: 8, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !358, file: !77, line: 254, baseType: !142, size: 8, offset: 392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !358, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !358, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !358, file: !77, line: 273, baseType: !175, size: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !358, file: !77, line: 276, baseType: !175, size: 64, offset: 576)
!399 = !DISubroutineType(types: !400)
!400 = !{!142, !180, !142, !142, !356}
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!142, !180, !180, !142, !356, !406, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!142, !356}
!409 = !DISubroutineType(types: !410)
!410 = !{!139}
!411 = !DISubroutineType(types: !412)
!412 = !{!142, !180, !180, !142, !413, !436, !356, !142, !406, !406, !406}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !271, line: 46, size: 1152, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !433, !434, !435}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !415, file: !271, line: 48, baseType: !274, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !415, file: !271, line: 53, baseType: !276, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !415, file: !271, line: 61, baseType: !278, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !415, file: !271, line: 62, baseType: !140, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !415, file: !271, line: 64, baseType: !128, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !415, file: !271, line: 65, baseType: !130, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !415, file: !271, line: 67, baseType: !7, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !415, file: !271, line: 69, baseType: !274, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !415, file: !271, line: 74, baseType: !29, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !415, file: !271, line: 78, baseType: !286, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !415, file: !271, line: 80, baseType: !288, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !415, file: !271, line: 91, baseType: !429, size: 128, offset: 576)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !291, line: 9, size: 128, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !429, file: !291, line: 11, baseType: !294, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !429, file: !291, line: 12, baseType: !296, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !415, file: !271, line: 92, baseType: !429, size: 128, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !415, file: !271, line: 93, baseType: !429, size: 128, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !415, file: !271, line: 106, baseType: !300, size: 192, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !349, line: 125, size: 192, elements: !438)
!438 = !{!439, !440, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !437, file: !349, line: 127, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !437, file: !349, line: 128, baseType: !441, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !112, line: 47, baseType: !276)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !437, file: !349, line: 129, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !112, line: 59, baseType: !274)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 256, elements: !304)
!446 = !DISubroutineType(types: !447)
!447 = !{!142, !356, !142}
!448 = !DISubroutineType(types: !449)
!449 = !{!142, !180, !413, !180, !413, !356, !406}
!450 = !DISubroutineType(types: !451)
!451 = !{!142, !180, !180, !142, !142, !142}
!452 = !DISubroutineType(types: !453)
!453 = !{!142, !356, !180, !413}
!454 = !DISubroutineType(types: !455)
!455 = !{!142, !180, !139}
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 12)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !461, file: !4, line: 51, baseType: !7, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !461, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !461, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !461, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !461, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !461, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !461, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !461, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !461, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !461, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !461, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !461, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !461, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !461, file: !4, line: 70, baseType: !477, size: 64, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !461, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !461, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !461, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !461, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !461, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !461, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !461, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !461, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !461, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !461, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !461, file: !4, line: 93, baseType: !477, size: 64, offset: 1344)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !461, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !461, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !461, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !461, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!493 = !DISubroutineType(types: !494)
!494 = !{!142, !180, !413, !180}
!495 = !DISubroutineType(types: !496)
!496 = !{null, !180, !180, !180}
!497 = !DISubroutineType(types: !498)
!498 = !{!142, !413, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!501 = !DISubroutineType(types: !502)
!502 = !{!142, !180, !180, !142, !413, !436, !356, !406, !406}
!503 = !DISubroutineType(types: !504)
!504 = !{!142, !180, !180, !356, !139, !139, !406, !413}
!505 = !DISubroutineType(types: !506)
!506 = !{!7, !7, !7}
!507 = !DISubroutineType(types: !508)
!508 = !{!55, !415}
!509 = !DISubroutineType(types: !510)
!510 = !{!142, !413}
!511 = !DISubroutineType(types: !512)
!512 = !{!53, !513, !55}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!515 = !DISubroutineType(types: !516)
!516 = !{!142, !7, !7, !9, !55, !55, !352, !89, !180, !180, !406}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !519, line: 23, size: 192, elements: !520)
!519 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mbarbar/software/coreutils-8.31")
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !518, file: !519, line: 26, baseType: !352, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !518, file: !519, line: 29, baseType: !352, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !518, file: !519, line: 32, baseType: !70, size: 32, offset: 128)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !519, line: 36, size: 384, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !527, file: !519, line: 39, baseType: !7, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !527, file: !519, line: 42, baseType: !352, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !527, file: !519, line: 45, baseType: !70, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !527, file: !519, line: 48, baseType: !55, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !527, file: !519, line: 52, baseType: !142, size: 8, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !527, file: !519, line: 55, baseType: !142, size: 8, offset: 264)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !527, file: !519, line: 58, baseType: !517, size: 64, offset: 320)
!536 = !DISubroutineType(types: !537)
!537 = !{!142, !7, !180, !142, !352}
!538 = !DISubroutineType(types: !539)
!539 = !{!142, !7, !352}
!540 = !DISubroutineType(types: !541)
!541 = !{!7, !7, !352, !352}
!542 = !DISubroutineType(types: !543)
!543 = !{!142, !7, !7, !9, !55, !55, !142, !180, !180, !544, !547, !406}
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !545, line: 102, baseType: !546)
!545 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !353, line: 77, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!550 = !DISubroutineType(types: !551)
!551 = !{!142, !513, !55}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!555 = !DISubroutineType(types: !556)
!556 = !{!7, !7, !180, !139}
!557 = !DISubroutineType(types: !558)
!558 = !{!7, !180, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!561 = !DISubroutineType(types: !562)
!562 = !{!7, !356, !180, !7, !413, !142, !413}
!563 = !DISubroutineType(types: !564)
!564 = !{!142, !180, !7, !180, !7, !356}
!565 = !DISubroutineType(types: !566)
!566 = !{null, !567, !180}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !569, line: 25, size: 192, elements: !570)
!569 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!570 = !{!571, !575, !579}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !568, file: !569, line: 27, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !567, !180, null}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !568, file: !569, line: 30, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!180, !567, !180}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !568, file: !569, line: 33, baseType: !580, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !353, line: 52, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !583, line: 32, baseType: !584)
!583 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stdarg.h", directory: "/home/mbarbar/software")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !349, line: 623, baseType: !585)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 192, elements: !38)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !349, line: 623, size: 192, elements: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !586, file: !349, line: 623, baseType: !70, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !586, file: !349, line: 623, baseType: !70, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !586, file: !349, line: 623, baseType: !53, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !586, file: !349, line: 623, baseType: !53, size: 64, offset: 128)
!592 = !DISubroutineType(types: !593)
!593 = !{!7, !180, !567}
!594 = !DISubroutineType(types: !595)
!595 = !{null, !180, !7, !413}
!596 = !{!597, !346, !600, !602, !605, !607}
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "mask", scope: !599, file: !349, line: 3051, type: !139, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "cached_umask", scope: !349, file: !349, line: 3049, type: !409, scopeLine: 3050, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !348, retainedNodes: !209)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !348, file: !349, line: 148, type: !180, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "zeros", scope: !604, file: !349, line: 351, type: !9, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "write_zeros", scope: !349, file: !349, line: 349, type: !538, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !348, retainedNodes: !209)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "nz", scope: !604, file: !349, line: 352, type: !55, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "fallback", scope: !604, file: !349, line: 359, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 1024)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !614, file: !615, line: 45, type: !175, isLocal: true, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !616, globals: !637, nameTableKind: None)
!615 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!616 = !{!53, !9, !544, !617, !619, !441, !443, !175, !625, !627, !629, !200, !631, !633, !635}
!617 = !DISubroutineType(types: !618)
!618 = !{null, !441, !443}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !615, line: 33, size: 192, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !620, file: !615, line: 35, baseType: !441, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !620, file: !615, line: 36, baseType: !443, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !620, file: !615, line: 40, baseType: !9, size: 64, offset: 128)
!625 = !DISubroutineType(types: !626)
!626 = !{!9, !441, !443}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!629 = !DISubroutineType(types: !630)
!630 = !{!9, !180, !441, !443}
!631 = !DISubroutineType(types: !632)
!632 = !{null, !53}
!633 = !DISubroutineType(types: !634)
!634 = !{!55, !513, !55}
!635 = !DISubroutineType(types: !636)
!636 = !{!142, !513, !513}
!637 = !{!612}
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !640, file: !641, line: 38, type: !653, isLocal: true, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !642, globals: !670, nameTableKind: None)
!641 = !DIFile(filename: "src/force-link.c", directory: "/home/mbarbar/software/coreutils-8.31")
!642 = !{!643, !7, !645, !9, !648, !650, !652, !55, !653, !656, !658, !180, !665}
!643 = !DISubroutineType(types: !644)
!644 = !{!7, !7, !180, !7, !180, !7, !142, !7}
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 256)
!648 = !DISubroutineType(types: !649)
!649 = !{!7, !180, !7, !180, !142, !7}
!650 = !DISubroutineType(types: !651)
!651 = !{!9, !180, !9}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 72, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 9)
!656 = !DISubroutineType(types: !657)
!657 = !{!7, !9, !53}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !641, line: 71, size: 192, elements: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !659, file: !641, line: 73, baseType: !7, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !659, file: !641, line: 74, baseType: !180, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !659, file: !641, line: 75, baseType: !7, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !659, file: !641, line: 76, baseType: !7, size: 32, offset: 160)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !641, line: 131, size: 128, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !666, file: !641, line: 133, baseType: !180, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !666, file: !641, line: 134, baseType: !7, size: 32, offset: 64)
!670 = !{!638}
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "Version", scope: !673, file: !674, line: 2, type: !180, isLocal: false, isDefinition: true)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !675, globals: !676, nameTableKind: None)
!674 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!675 = !{!180}
!676 = !{!671}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !679, file: !683, line: 82, type: !180, isLocal: false, isDefinition: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !689, globals: !713, nameTableKind: None)
!680 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!681 = !{!68, !682}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !683, line: 172, baseType: !70, size: 32, elements: !684)
!683 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!684 = !{!685, !686, !687, !688}
!685 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!686 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!687 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!688 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!689 = !{!53, !70, !55, !180, !202, !181, !690, !652, !692, !9, !693, !7, !697, !700, !709, !142, !10, !710, !31}
!690 = !DISubroutineType(types: !691)
!691 = !{!9, !7, !180, !68, !142}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !112, line: 108, baseType: !549)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !695, line: 127, baseType: !696)
!695 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !695, line: 127, flags: DIFlagFwdDecl)
!697 = !DISubroutineType(types: !698)
!698 = !{!682, !7, !184, !55, !55, !652, !699, !193}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !702, line: 22, size: 2240, elements: !703)
!702 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!703 = !{!704, !705, !706, !707, !708}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !701, file: !702, line: 25, baseType: !276, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !701, file: !702, line: 26, baseType: !29, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !701, file: !702, line: 31, baseType: !33, size: 16, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !701, file: !702, line: 32, baseType: !554, size: 8, offset: 144)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !701, file: !702, line: 33, baseType: !645, size: 2048, offset: 152)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !304)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !9, !55, !10, !7, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!713 = !{!677}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "backup_args", scope: !716, file: !736, line: 42, type: !728, isLocal: true, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, retainedTypes: !719, globals: !733, nameTableKind: None)
!717 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!718 = !{!68}
!719 = !{!180, !720, !9, !722, !181, !724, !728, !730}
!720 = !DISubroutineType(types: !721)
!721 = !{!9, !7, !180, !68}
!722 = !DISubroutineType(types: !723)
!723 = !{!68, !180, !180}
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 256, elements: !726)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!726 = !{!727}
!727 = !DISubrange(count: 8)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 576, elements: !654)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !731, line: 55, baseType: !732)
!731 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!733 = !{!734, !714}
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "backup_types", scope: !716, file: !736, line: 53, type: !724, isLocal: true, isDefinition: true)
!736 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "file_name", scope: !739, file: !778, line: 37, type: !180, isLocal: true, isDefinition: true)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !741, globals: !777, nameTableKind: None)
!740 = !DIFile(filename: "./lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!741 = !{!202, !180, !200, !142, !742, !7, !776}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !744, file: !4, line: 51, baseType: !7, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !744, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !744, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !744, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !744, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !744, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !744, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !744, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !744, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !744, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !744, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !744, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !744, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !744, file: !4, line: 70, baseType: !760, size: 64, offset: 832)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !744, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !744, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !744, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !744, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !744, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !744, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !744, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !744, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !744, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !744, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !744, file: !4, line: 93, baseType: !760, size: 64, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !744, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !744, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !744, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !744, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!777 = !{!737}
!778 = !DIFile(filename: "lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "file_name", scope: !781, file: !823, line: 46, type: !180, isLocal: true, isDefinition: true)
!781 = distinct !DICompileUnit(language: DW_LANG_C99, file: !782, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !783, globals: !820, nameTableKind: None)
!782 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!783 = !{!202, !180, !784, !142, !200, !786, !7, !776}
!784 = !DISubroutineType(types: !785)
!785 = !{null, !142}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !788, file: !4, line: 51, baseType: !7, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !788, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !788, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !788, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !788, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !788, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !788, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !788, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !788, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !788, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !788, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !788, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !788, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !788, file: !4, line: 70, baseType: !804, size: 64, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !788, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !788, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !788, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !788, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !788, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !788, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !788, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !788, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !788, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !788, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !788, file: !4, line: 93, baseType: !804, size: 64, offset: 1344)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !788, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !788, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !788, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !788, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!820 = !{!779, !821}
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !781, file: !823, line: 56, type: !142, isLocal: true, isDefinition: true)
!823 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "exit_failure", scope: !826, file: !830, line: 24, type: !776, isLocal: false, isDefinition: true)
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !827, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !828, globals: !829, nameTableKind: None)
!827 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!828 = !{!776}
!829 = !{!824}
!830 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "default_tuning", scope: !833, file: !842, line: 130, type: !858, isLocal: true, isDefinition: true)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !835, globals: !965, nameTableKind: None)
!834 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!835 = !{!57, !53, !55, !836, !839, !851, !845, !878, !880, !916, !872, !918, !920, !922, !923, !929, !554, !181, !931, !858, !934, !936, !840, !857, !869, !875, !937, !939, !941, !513, !863, !142, !944, !7, !946, !633, !635, !948, !950, !952, !954, !956, !958, !960, !963}
!836 = !DISubroutineType(types: !837)
!837 = !{!55, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !177, line: 69, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !842, line: 52, size: 640, elements: !843)
!842 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!843 = !{!844, !850, !853, !854, !855, !856, !868, !871, !874, !877}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !841, file: !842, line: 57, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !842, line: 46, size: 128, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !846, file: !842, line: 48, baseType: !53, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !842, line: 49, baseType: !845, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !841, file: !842, line: 58, baseType: !851, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !841, file: !842, line: 59, baseType: !55, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !841, file: !842, line: 60, baseType: !55, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !841, file: !842, line: 61, baseType: !55, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !841, file: !842, line: 64, baseType: !857, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !177, line: 65, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !177, line: 53, size: 160, elements: !861)
!861 = !{!862, !864, !865, !866, !867}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !860, file: !177, line: 58, baseType: !863, size: 32)
!863 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !860, file: !177, line: 59, baseType: !863, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !860, file: !177, line: 60, baseType: !863, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !860, file: !177, line: 61, baseType: !863, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !860, file: !177, line: 62, baseType: !142, size: 8, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !841, file: !842, line: 71, baseType: !869, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !177, line: 48, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !841, file: !842, line: 72, baseType: !872, size: 64, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !177, line: 49, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !841, file: !842, line: 73, baseType: !875, size: 64, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !177, line: 50, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !841, file: !842, line: 76, baseType: !845, size: 64, offset: 576)
!878 = !DISubroutineType(types: !879)
!879 = !{!142, !838}
!880 = !DISubroutineType(types: !881)
!881 = !{null, !838, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !884, file: !4, line: 51, baseType: !7, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !884, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !884, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !884, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !884, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !884, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !884, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !884, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !884, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !884, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !884, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !884, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !884, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !884, file: !4, line: 70, baseType: !900, size: 64, offset: 832)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !884, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !884, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !884, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !884, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !884, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !884, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !884, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !884, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !884, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !884, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !884, file: !4, line: 93, baseType: !900, size: 64, offset: 1344)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !884, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !884, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !884, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !884, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!916 = !DISubroutineType(types: !917)
!917 = !{!53, !838, !513}
!918 = !DISubroutineType(types: !919)
!919 = !{!53, !838}
!920 = !DISubroutineType(types: !921)
!921 = !{!55, !838, !922, !55}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!55, !838, !925, !53}
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_processor", file: !177, line: 51, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!142, !53, !53}
!929 = !DISubroutineType(types: !930)
!930 = !{!55, !180, !55}
!931 = !DISubroutineType(types: !932)
!932 = !{null, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!936, !55, !857, !869, !872, !875}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !936}
!939 = !DISubroutineType(types: !940)
!940 = !{!142, !936, !55}
!941 = !DISubroutineType(types: !942)
!942 = !{!7, !936, !513, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!53, !936, !513}
!946 = !DISubroutineType(types: !947)
!947 = !{!845, !838, !513}
!948 = !DISubroutineType(types: !949)
!949 = !{!142, !936}
!950 = !DISubroutineType(types: !951)
!951 = !{!55, !55, !857}
!952 = !DISubroutineType(types: !953)
!953 = !{!55, !55}
!954 = !DISubroutineType(types: !955)
!955 = !{!142, !55}
!956 = !DISubroutineType(types: !957)
!957 = !{!142, !936, !936, !142}
!958 = !DISubroutineType(types: !959)
!959 = !{null, !936, !845}
!960 = !DISubroutineType(types: !961)
!961 = !{!53, !936, !513, !962, !142}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!845, !936}
!965 = !{!831}
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "program_name", scope: !968, file: !1006, line: 33, type: !180, isLocal: false, isDefinition: true)
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !970, globals: !1005, nameTableKind: None)
!969 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!970 = !{!53, !9, !180, !202, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !973, file: !4, line: 51, baseType: !7, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !973, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !973, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !973, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !973, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !973, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !973, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !973, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !973, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !973, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !973, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !973, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !973, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !973, file: !4, line: 70, baseType: !989, size: 64, offset: 832)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !973, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !973, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !973, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !973, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !973, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !973, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !973, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !973, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !973, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !973, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !973, file: !4, line: 93, baseType: !989, size: 64, offset: 1344)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !973, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !973, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !973, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !973, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!1005 = !{!966}
!1006 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1009, file: !1038, line: 85, type: !1027, isLocal: false, isDefinition: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1011, retainedTypes: !1026, globals: !1132, nameTableKind: None)
!1010 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1011 = !{!1012}
!1012 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1013, line: 32, baseType: !70, size: 32, elements: !1014)
!1013 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mbarbar/software/coreutils-8.31")
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1015 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!1016 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!1017 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!1018 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!1019 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!1020 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!1021 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!1022 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!1023 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!1024 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!1025 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!1026 = !{!7, !33, !55, !1027, !1030, !1034, !1036, !1046, !1050, !1052, !554, !1054, !70, !1055, !1057, !180, !1059, !1048, !1061, !1063, !9, !200, !1065, !645, !1070, !1072, !218, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !142, !181, !1108, !1110, !1125, !1106, !1126, !1128, !1130}
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 704, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 11)
