; ModuleID = 'ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !3)
!2 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!3 = !{!4, !6, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !26, !27, !28, !29, !33, !35, !37, !41, !44, !46, !48, !49, !50, !51, !55, !56}
!4 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1, file: !2, line: 242, baseType: !5, size: 32)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1, file: !2, line: 260, baseType: !20, size: 64, offset: 768)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !21, file: !2, line: 157, baseType: !20, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !21, file: !2, line: 158, baseType: !0, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !21, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1, file: !2, line: 262, baseType: !0, size: 64, offset: 832)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 131, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!32 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!36 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !2, line: 150, baseType: null)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 132, baseType: !32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "llvm/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mohamad/clone")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 20)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !62, file: !63, line: 53, type: !5, isLocal: true, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !118, globals: !394, nameTableKind: None)
!63 = !DIFile(filename: "src/install.c", directory: "/home/mohamad/clone/coreutils")
!64 = !{!65, !73, !80, !86, !92, !97}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !66, line: 30, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mohamad/clone/coreutils")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !74, line: 69, baseType: !67, size: 32, elements: !75)
!74 = !DIFile(filename: "src/copy.h", directory: "/home/mohamad/clone/coreutils")
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !74, line: 60, baseType: !67, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !74, line: 26, baseType: !67, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !74, line: 47, baseType: !67, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !99, file: !98, line: 39, baseType: !67, size: 32, elements: !111)
!98 = !DIFile(filename: "./lib/savewd.h", directory: "/home/mohamad/clone/coreutils")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !98, line: 36, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !98, line: 66, baseType: !97, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !99, file: !98, line: 74, baseType: !103, size: 32, offset: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !99, file: !98, line: 69, size: 32, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !103, file: !98, line: 71, baseType: !5, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !103, file: !98, line: 72, baseType: !5, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !103, file: !98, line: 73, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !109, line: 98, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !31, line: 133, baseType: !5)
!111 = !{!112, !113, !114, !115, !116, !117}
!112 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!118 = !{!119, !7, !47, !124, !126, !128, !0, !177, !180, !182, !185, !188, !191, !194, !197, !200, !203, !5, !139, !206, !38, !207, !210, !213, !216, !228, !231, !234, !237, !240, !243, !246, !57, !137, !249, !252, !255, !258, !261, !264, !267, !136, !270, !273, !276, !279, !282, !285, !288, !301, !302, !305, !308, !311, !314, !317, !172, !52, !320, !331, !54, !125, !127, !339, !341, !344, !347, !350, !30, !353, !108, !356, !357, !364, !368, !371, !381, !384, !181, !387, !388, !391}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !120, line: 85, baseType: !121)
!120 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !5}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !109, line: 80, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !31, line: 125, baseType: !67)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !109, line: 65, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !31, line: 126, baseType: !67)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !74, line: 98, size: 640, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !176}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !129, file: !74, line: 100, baseType: !65, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !129, file: !74, line: 103, baseType: !73, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !129, file: !74, line: 108, baseType: !80, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !129, file: !74, line: 111, baseType: !86, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !129, file: !74, line: 115, baseType: !136, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !109, line: 70, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !31, line: 129, baseType: !67)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !129, file: !74, line: 119, baseType: !139, size: 8, offset: 160)
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !129, file: !74, line: 123, baseType: !139, size: 8, offset: 168)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !129, file: !74, line: 130, baseType: !139, size: 8, offset: 176)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !129, file: !74, line: 134, baseType: !139, size: 8, offset: 184)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !129, file: !74, line: 138, baseType: !139, size: 8, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !129, file: !74, line: 141, baseType: !139, size: 8, offset: 200)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !129, file: !74, line: 145, baseType: !139, size: 8, offset: 208)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !129, file: !74, line: 152, baseType: !139, size: 8, offset: 216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !129, file: !74, line: 156, baseType: !139, size: 8, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !129, file: !74, line: 160, baseType: !139, size: 8, offset: 232)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !129, file: !74, line: 161, baseType: !139, size: 8, offset: 240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !129, file: !74, line: 162, baseType: !139, size: 8, offset: 248)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !129, file: !74, line: 163, baseType: !139, size: 8, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !129, file: !74, line: 166, baseType: !139, size: 8, offset: 264)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !129, file: !74, line: 178, baseType: !139, size: 8, offset: 272)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !129, file: !74, line: 182, baseType: !139, size: 8, offset: 280)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !129, file: !74, line: 188, baseType: !139, size: 8, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !129, file: !74, line: 192, baseType: !139, size: 8, offset: 296)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !129, file: !74, line: 201, baseType: !139, size: 8, offset: 304)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !129, file: !74, line: 205, baseType: !139, size: 8, offset: 312)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !129, file: !74, line: 214, baseType: !139, size: 8, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !129, file: !74, line: 223, baseType: !139, size: 8, offset: 328)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !129, file: !74, line: 227, baseType: !139, size: 8, offset: 336)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !129, file: !74, line: 231, baseType: !139, size: 8, offset: 344)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !129, file: !74, line: 235, baseType: !139, size: 8, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !129, file: !74, line: 239, baseType: !139, size: 8, offset: 360)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !129, file: !74, line: 242, baseType: !139, size: 8, offset: 368)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !129, file: !74, line: 245, baseType: !139, size: 8, offset: 376)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !129, file: !74, line: 250, baseType: !139, size: 8, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !129, file: !74, line: 254, baseType: !139, size: 8, offset: 392)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !129, file: !74, line: 259, baseType: !5, size: 32, offset: 416)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !129, file: !74, line: 262, baseType: !92, size: 32, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !129, file: !74, line: 273, baseType: !172, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !174, line: 69, baseType: !175)
!174 = !DIFile(filename: "./lib/hash.h", directory: "/home/mohamad/clone/coreutils")
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !174, line: 67, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !129, file: !74, line: 276, baseType: !172, size: 64, offset: 576)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 312, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 39)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1320, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 165)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 3720, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 465)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 3208, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 401)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 4032, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 504)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2776, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 347)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 360, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 45)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 432, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 54)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 8)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 80, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 10)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 24)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 168, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 21)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 4608, elements: !226)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !219, line: 104, size: 256, elements: !220)
!219 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!220 = !{!221, !222, !223, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !219, line: 106, baseType: !180, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !218, file: !219, line: 109, baseType: !5, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !218, file: !219, line: 110, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !218, file: !219, line: 111, baseType: !5, size: 32, offset: 192)
!226 = !{!227}
!227 = !DISubrange(count: 18)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 304, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 38)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 584, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 73)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 536, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 67)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 112, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 14)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 16)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 488, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 61)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 456, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 57)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 232, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 29)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 12)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 336, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 42)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 400, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 50)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 560, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 70)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 136, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 17)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !269, line: 25, flags: DIFlagFwdDecl)
!269 = !DIFile(filename: "./lib/modechange.h", directory: "/home/mohamad/clone/coreutils")
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 576, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 72)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 464, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 58)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 688, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 86)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 600, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 75)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1768, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 221)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1776, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 222)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 896, elements: !299)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !292, file: !291, line: 633, size: 128, elements: !296)
!291 = !DIFile(filename: "src/system.h", directory: "/home/mohamad/clone/coreutils")
!292 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !291, file: !291, line: 631, type: !293, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !180}
!295 = !{}
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !290, file: !291, line: 633, baseType: !180, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !290, file: !291, line: 633, baseType: !180, size: 64, offset: 64)
!299 = !{!300}
!300 = !DISubrange(count: 7)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 184, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 23)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 320, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 40)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 4)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 568, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 71)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 216, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 27)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 408, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 51)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !322, line: 49, size: 384, elements: !323)
!322 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!323 = !{!324, !325, !326, !327, !328, !329, !330}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !321, file: !322, line: 51, baseType: !7, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !321, file: !322, line: 52, baseType: !7, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !321, file: !322, line: 53, baseType: !125, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !321, file: !322, line: 54, baseType: !127, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !321, file: !322, line: 55, baseType: !7, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !321, file: !322, line: 56, baseType: !7, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !321, file: !322, line: 57, baseType: !7, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !333, line: 42, size: 256, elements: !334)
!333 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !332, file: !333, line: 44, baseType: !7, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !332, file: !333, line: 45, baseType: !7, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !332, file: !333, line: 46, baseType: !127, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !332, file: !333, line: 47, baseType: !206, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 264, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 33)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 368, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 46)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 176, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 22)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 120, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 15)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32768, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 4096)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 144, elements: !226)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !358, file: !63, line: 564, size: 32, elements: !361)
!358 = distinct !DISubprogram(name: "strip", scope: !63, file: !63, line: 547, type: !359, scopeLine: 548, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !295)
!359 = !DISubroutineType(types: !360)
!360 = !{!139, !180}
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__in", scope: !357, file: !63, line: 564, baseType: !5, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__i", scope: !357, file: !63, line: 564, baseType: !5, size: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !358, file: !63, line: 564, size: 32, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__in", scope: !364, file: !63, line: 564, baseType: !5, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__i", scope: !364, file: !63, line: 564, baseType: !5, size: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 288, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 36)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 256, elements: !379)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !373, line: 120, size: 128, elements: !374)
!373 = !DIFile(filename: "/usr/include/time.h", directory: "")
!374 = !{!375, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !372, file: !373, line: 122, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !31, line: 139, baseType: !32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !372, file: !373, line: 123, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !31, line: 175, baseType: !32)
!379 = !{!380}
!380 = !DISubrange(count: 2)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 240, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 30)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 32)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !379)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 72, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 9)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 352, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 44)
!394 = !{!395, !397, !399, !401, !403, !60, !405, !407, !409, !411, !413, !415, !417, !419, !421, !426, !428}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "owner_name", scope: !62, file: !63, line: 74, type: !7, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "group_name", scope: !62, file: !63, line: 81, type: !7, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !62, file: !63, line: 102, type: !139, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "strip_files", scope: !62, file: !63, line: 105, type: !139, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "dir_arg", scope: !62, file: !63, line: 108, type: !139, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "long_options", scope: !62, file: !63, line: 121, type: !216, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "strip_program", scope: !62, file: !63, line: 111, type: !180, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !62, file: !63, line: 54, type: !139, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "mode", scope: !62, file: !63, line: 90, type: !136, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !62, file: !63, line: 99, type: !136, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "dir_mode", scope: !62, file: !63, line: 93, type: !136, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "owner_id", scope: !62, file: !63, line: 77, type: !124, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "group_id", scope: !62, file: !63, line: 84, type: !126, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "a_buff", scope: !423, file: !63, line: 149, type: !353, isLocal: true, isDefinition: true)
!423 = distinct !DISubprogram(name: "have_same_content", scope: !63, file: !63, line: 146, type: !424, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !295)
!424 = !DISubroutineType(types: !425)
!425 = !{!139, !5, !5}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "b_buff", scope: !423, file: !63, line: 150, type: !353, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "first_call", scope: !430, file: !63, line: 318, type: !139, isLocal: true, isDefinition: true)
!430 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !63, file: !63, line: 314, type: !293, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !295)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !433, file: !434, line: 147, type: !180, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !436, globals: !586, nameTableKind: None)
!434 = !DIFile(filename: "src/copy.c", directory: "/home/mohamad/clone/coreutils")
!435 = !{!65, !73, !80, !86, !92}
!436 = !{!136, !47, !67, !7, !54, !52, !437, !139, !5, !258, !439, !317, !442, !172, !210, !445, !448, !180, !451, !368, !228, !231, !350, !137, !305, !347, !454, !457, !460, !461, !462, !465, !264, !468, !252, !469, !197, !200, !388, !497, !213, !498, !203, !501, !506, !508, !314, !181, !387, !509, !381, !30, !249, !512, !125, !127, !515, !518, !57, !519, !341, !521, !524, !527, !565, !8, !237, !240, !568, !483, !485, !571, !578, !581, !583, !585, !584, !124, !126}
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !438, line: 90, baseType: !30)
!438 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 296, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 37)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 328, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 41)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 88, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 11)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 728, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 91)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 376, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 47)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 392, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 49)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 224, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 28)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !31, line: 124, baseType: !54)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !31, line: 127, baseType: !54)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 416, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 52)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 344, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 43)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !31, line: 130, baseType: !54)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !471, line: 46, size: 1152, elements: !472)
!471 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !486, !491, !492, !493}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !470, file: !471, line: 48, baseType: !460, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !470, file: !471, line: 53, baseType: !461, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !470, file: !471, line: 61, baseType: !468, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !470, file: !471, line: 62, baseType: !137, size: 32, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !470, file: !471, line: 64, baseType: !125, size: 32, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !470, file: !471, line: 65, baseType: !127, size: 32, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !470, file: !471, line: 67, baseType: !5, size: 32, offset: 288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !470, file: !471, line: 69, baseType: !460, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !470, file: !471, line: 74, baseType: !30, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !470, file: !471, line: 78, baseType: !483, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !31, line: 153, baseType: !32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !470, file: !471, line: 80, baseType: !485, size: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !31, line: 158, baseType: !32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !470, file: !471, line: 91, baseType: !487, size: 128, offset: 576)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !373, line: 120, size: 128, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !487, file: !373, line: 122, baseType: !376, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !487, file: !373, line: 123, baseType: !378, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !470, file: !471, line: 92, baseType: !487, size: 128, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !470, file: !471, line: 93, baseType: !487, size: 128, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !470, file: !471, line: 106, baseType: !494, size: 192, offset: 960)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 192, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 3)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 376, elements: !452)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 480, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 60)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !434, line: 125, size: 192, elements: !503)
!503 = !{!504, !505, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !502, file: !434, line: 127, baseType: !501, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !502, file: !434, line: 128, baseType: !506, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !109, line: 48, baseType: !461)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !502, file: !434, line: 129, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !109, line: 60, baseType: !460)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 504, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 63)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 248, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 31)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 25)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 256, elements: !379)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 104, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 13)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 648, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 81)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !528, file: !2, line: 242, baseType: !5, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !528, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !528, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !528, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !528, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !528, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !528, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !528, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !528, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !528, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !528, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !528, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !528, file: !2, line: 260, baseType: !543, size: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !544, file: !2, line: 157, baseType: !543, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !544, file: !2, line: 158, baseType: !527, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !544, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !528, file: !2, line: 262, baseType: !527, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !528, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !528, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !528, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !528, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !528, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !528, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !528, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !528, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !528, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !528, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !528, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !528, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !528, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !528, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !528, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 152, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 19)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 448, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 56)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !573, line: 23, size: 192, elements: !574)
!573 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mohamad/clone/coreutils")
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !572, file: !573, line: 26, baseType: !437, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !572, file: !573, line: 29, baseType: !437, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !572, file: !573, line: 32, baseType: !67, size: 32, offset: 128)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 1024)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !438, line: 102, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 172, baseType: !32)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!586 = !{!587, !431, !592, !594, !599, !601}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "mask", scope: !589, file: !434, line: 3089, type: !136, isLocal: true, isDefinition: true)
!589 = distinct !DISubprogram(name: "cached_umask", scope: !434, file: !434, line: 3087, type: !590, scopeLine: 3088, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !433, retainedNodes: !295)
!590 = !DISubroutineType(types: !591)
!591 = !{!136}
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !433, file: !434, line: 148, type: !180, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "zeros", scope: !596, file: !434, line: 387, type: !7, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "write_zeros", scope: !434, file: !434, line: 385, type: !597, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !433, retainedNodes: !295)
!597 = !DISubroutineType(types: !598)
!598 = !{!139, !5, !437}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "nz", scope: !596, file: !434, line: 388, type: !52, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "fallback", scope: !596, file: !434, line: 395, type: !578, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !605, file: !606, line: 45, type: !172, isLocal: true, isDefinition: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !607, globals: !618, nameTableKind: None)
!606 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mohamad/clone/coreutils")
!607 = !{!47, !7, !608, !610, !506, !508, !172, !616}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !609, line: 135, baseType: !54)
!609 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !606, line: 33, size: 192, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !611, file: !606, line: 35, baseType: !506, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !611, file: !606, line: 36, baseType: !508, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !606, line: 40, baseType: !7, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!618 = !{!603}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !621, file: !622, line: 38, type: !628, isLocal: true, isDefinition: true)
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !623, globals: !641, nameTableKind: None)
!622 = !DIFile(filename: "src/force-link.c", directory: "/home/mohamad/clone/coreutils")
!623 = !{!5, !624, !7, !627, !52, !628, !629, !180, !636}
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 256)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 35, baseType: !32)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 72, elements: !389)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !622, line: 71, size: 192, elements: !631)
!631 = !{!632, !633, !634, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !630, file: !622, line: 73, baseType: !5, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !630, file: !622, line: 74, baseType: !180, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !630, file: !622, line: 75, baseType: !5, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !622, line: 76, baseType: !5, size: 32, offset: 160)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !622, line: 131, size: 128, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !637, file: !622, line: 133, baseType: !180, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !637, file: !622, line: 134, baseType: !5, size: 32, offset: 64)
!641 = !{!619}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "Version", scope: !644, file: !645, line: 2, type: !180, isLocal: false, isDefinition: true)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !646, globals: !647, nameTableKind: None)
!645 = !DIFile(filename: "src/version.c", directory: "/home/mohamad/clone/coreutils")
!646 = !{!180}
!647 = !{!642}
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !650, file: !654, line: 82, type: !180, isLocal: false, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !660, globals: !678, nameTableKind: None)
!651 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!652 = !{!65, !653}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !654, line: 172, baseType: !67, size: 32, elements: !655)
!654 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!655 = !{!656, !657, !658, !659}
!656 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!657 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!658 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!659 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!660 = !{!47, !67, !52, !180, !213, !181, !387, !627, !661, !7, !662, !5, !8, !666, !675, !139, !624, !32}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !109, line: 109, baseType: !582)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !664, line: 127, baseType: !665)
!664 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !664, line: 127, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !668, line: 22, size: 2240, elements: !669)
!668 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!669 = !{!670, !671, !672, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !667, file: !668, line: 25, baseType: !461, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !667, file: !668, line: 26, baseType: !30, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !667, file: !668, line: 31, baseType: !34, size: 16, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !667, file: !668, line: 32, baseType: !585, size: 8, offset: 144)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !667, file: !668, line: 33, baseType: !624, size: 2048, offset: 152)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 40, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 5)
!678 = !{!648}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "backup_args", scope: !681, file: !699, line: 42, type: !689, isLocal: true, isDefinition: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !683, retainedTypes: !684, globals: !696, nameTableKind: None)
!682 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!683 = !{!65}
!684 = !{!685, !7, !181, !687, !689, !691, !264, !240}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 256, elements: !204)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 576, elements: !389)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !692, line: 61, baseType: !693)
!692 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mohamad/clone/coreutils")
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null}
!696 = !{!697, !679}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "backup_types", scope: !681, file: !699, line: 53, type: !687, isLocal: true, isDefinition: true)
!699 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "file_name", scope: !702, file: !747, line: 37, type: !180, isLocal: true, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !704, globals: !746, nameTableKind: None)
!703 = !DIFile(filename: "./lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!704 = !{!180, !139, !705, !565, !5, !743, !744, !745}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !706, file: !2, line: 242, baseType: !5, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !706, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !706, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !706, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !706, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !706, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !706, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !706, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !706, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !706, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !706, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !706, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !706, file: !2, line: 260, baseType: !721, size: 64, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !722, file: !2, line: 157, baseType: !721, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !722, file: !2, line: 158, baseType: !705, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !722, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !706, file: !2, line: 262, baseType: !705, size: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !706, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !706, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !706, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !706, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !706, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !706, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !706, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !706, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !706, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !706, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !706, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !706, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !706, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !706, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !706, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 56, elements: !299)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 24, elements: !495)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5)
!746 = !{!700}
!747 = !DIFile(filename: "lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "file_name", scope: !750, file: !794, line: 46, type: !180, isLocal: true, isDefinition: true)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !752, globals: !791, nameTableKind: None)
!751 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!752 = !{!180, !139, !753, !5, !252, !743, !744, !745}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !754, file: !2, line: 242, baseType: !5, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !754, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !754, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !754, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !754, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !754, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !754, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !754, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !754, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !754, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !754, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !754, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !754, file: !2, line: 260, baseType: !769, size: 64, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !770, file: !2, line: 157, baseType: !769, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !770, file: !2, line: 158, baseType: !753, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !770, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !754, file: !2, line: 262, baseType: !753, size: 64, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !754, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !754, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !754, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !754, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !754, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !754, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !754, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !754, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !754, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !754, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !754, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !754, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !754, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !754, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !754, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!791 = !{!748, !792}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !750, file: !794, line: 56, type: !139, isLocal: true, isDefinition: true)
!794 = !DIFile(filename: "lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "exit_failure", scope: !797, file: !801, line: 24, type: !745, isLocal: false, isDefinition: true)
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !799, globals: !800, nameTableKind: None)
!798 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!799 = !{!745}
!800 = !{!795}
!801 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "default_tuning", scope: !804, file: !810, line: 130, type: !826, isLocal: true, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !806, globals: !854, nameTableKind: None)
!805 = !DIFile(filename: "./lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!806 = !{!54, !47, !52, !807, !819, !813, !210, !341, !842, !852, !585, !181, !826, !853, !808, !825, !837, !847, !685, !831, !139, !5}
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !174, line: 69, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !810, line: 52, size: 640, elements: !811)
!810 = !DIFile(filename: "lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!811 = !{!812, !818, !821, !822, !823, !824, !836, !841, !846, !851}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !809, file: !810, line: 57, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !810, line: 46, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !814, file: !810, line: 48, baseType: !47, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !810, line: 49, baseType: !813, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !809, file: !810, line: 58, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !809, file: !810, line: 59, baseType: !52, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !809, file: !810, line: 60, baseType: !52, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !809, file: !810, line: 61, baseType: !52, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !809, file: !810, line: 64, baseType: !825, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !174, line: 65, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !174, line: 53, size: 160, elements: !829)
!829 = !{!830, !832, !833, !834, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !828, file: !174, line: 58, baseType: !831, size: 32)
!831 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !828, file: !174, line: 59, baseType: !831, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !828, file: !174, line: 60, baseType: !831, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !828, file: !174, line: 61, baseType: !831, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !828, file: !174, line: 62, baseType: !139, size: 8, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !809, file: !810, line: 71, baseType: !837, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !174, line: 48, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!52, !685, !52}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !809, file: !810, line: 72, baseType: !842, size: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !174, line: 49, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!139, !685, !685}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !809, file: !810, line: 73, baseType: !847, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !174, line: 50, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !47}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !809, file: !810, line: 76, baseType: !813, size: 64, offset: 576)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!854 = !{!802}
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "program_name", scope: !857, file: !899, line: 33, type: !180, isLocal: false, isDefinition: true)
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !859, globals: !898, nameTableKind: None)
!858 = !DIFile(filename: "./lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!859 = !{!47, !7, !180, !568, !860, !181, !203, !308}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !861, file: !2, line: 242, baseType: !5, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !861, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !861, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !861, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !861, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !861, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !861, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !861, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !861, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !861, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !861, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !861, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !861, file: !2, line: 260, baseType: !876, size: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !877, file: !2, line: 157, baseType: !876, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !877, file: !2, line: 158, baseType: !860, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !877, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !861, file: !2, line: 262, baseType: !860, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !861, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !861, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !861, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !861, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !861, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !861, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !861, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !861, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !861, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !861, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !861, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !861, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !861, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !861, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !861, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!898 = !{!855}
!899 = !DIFile(filename: "lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !902, file: !925, line: 85, type: !920, isLocal: false, isDefinition: true)
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !904, retainedTypes: !919, globals: !961, nameTableKind: None)
!903 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!904 = !{!905}
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !906, line: 32, baseType: !67, size: 32, elements: !907)
!906 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mohamad/clone/coreutils")
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!908 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!909 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!910 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!911 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!912 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!913 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!914 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!915 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!916 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!917 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!918 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!919 = !{!5, !34, !52, !920, !921, !923, !585, !933, !930, !67, !180, !934, !936, !7, !937, !624, !139, !387, !181, !942, !944, !955, !956, !958, !308, !203, !744}
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 704, elements: !446)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 320, elements: !208)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !925, line: 65, size: 448, elements: !926)
!925 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!926 = !{!927, !928, !929, !931, !932}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !924, file: !925, line: 68, baseType: !905, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !924, file: !925, line: 71, baseType: !5, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !924, file: !925, line: 75, baseType: !930, size: 256, offset: 64)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, elements: !204)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !924, file: !925, line: 78, baseType: !180, size: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !924, file: !925, line: 81, baseType: !180, size: 64, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !925, line: 834, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !938, file: !925, line: 836, baseType: !52, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !938, file: !925, line: 837, baseType: !7, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !945, line: 106, baseType: !946)
!945 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !945, line: 94, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !945, line: 82, size: 64, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !947, file: !945, line: 84, baseType: !5, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !947, file: !945, line: 93, baseType: !951, size: 32, offset: 32)
!951 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !947, file: !945, line: 85, size: 32, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !951, file: !945, line: 88, baseType: !67, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !951, file: !945, line: 92, baseType: !308, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !53, line: 74, baseType: !5)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 48, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 6)
!961 = !{!900, !962, !964, !966, !968, !970, !972, !974}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !902, file: !925, line: 101, type: !921, isLocal: false, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !902, file: !925, line: 1052, type: !924, isLocal: false, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !902, file: !925, line: 116, type: !924, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "slot0", scope: !902, file: !925, line: 842, type: !624, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "slotvec", scope: !902, file: !925, line: 845, type: !937, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "nslots", scope: !902, file: !925, line: 843, type: !5, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "slotvec0", scope: !902, file: !925, line: 844, type: !938, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !978, file: !991, line: 74, type: !1001, isLocal: true, isDefinition: true)
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !980, retainedTypes: !988, globals: !1015, nameTableKind: None)
!979 = !DIFile(filename: "./lib/savedir.c", directory: "/home/mohamad/clone/coreutils")
!980 = !{!981}
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !982, line: 26, baseType: !67, size: 32, elements: !983)
!982 = !DIFile(filename: "./lib/savedir.h", directory: "/home/mohamad/clone/coreutils")
!983 = !{!984, !985, !986, !987}
!984 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!985 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!986 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!987 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!988 = !{!47, !7, !52, !989, !5, !997, !1001, !1003, !180, !1012, !990, !461, !996, !8, !662, !1013, !1014}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "direntry_t", file: !991, line: 46, baseType: !992)
!991 = !DIFile(filename: "lib/savedir.c", directory: "/home/mohamad/clone/coreutils")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !991, line: 40, size: 128, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !991, line: 42, baseType: !7, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !992, file: !991, line: 44, baseType: !996, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !664, line: 34, baseType: !461)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !991, line: 72, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!5, !685, !685}
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 192, elements: !495)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !668, line: 22, size: 2240, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1005, file: !668, line: 25, baseType: !461, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1005, file: !668, line: 26, baseType: !30, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1005, file: !668, line: 31, baseType: !34, size: 16, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1005, file: !668, line: 32, baseType: !585, size: 8, offset: 144)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1005, file: !668, line: 33, baseType: !624, size: 2048, offset: 152)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1015 = !{!976}
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "letters", scope: !1018, file: !1033, line: 184, type: !1024, isLocal: true, isDefinition: true)
!1018 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1019, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 098fdcdeef42cde3f762b81318f3acc730a55c87) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !1020, globals: !1032, nameTableKind: None)
!1019 = !DIFile(filename: "./lib/tempname.c", directory: "/home/mohamad/clone/coreutils")
!1020 = !{!52, !7, !67, !5, !1021, !1024, !1025, !1028, !350, !1031, !387, !224}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !1023, line: 33, flags: DIFlagFwdDecl)
!1023 = !DIFile(filename: "./lib/randint.h", directory: "/home/mohamad/clone/coreutils")
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 504, elements: !510)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!5, !7, !47}
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 280, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 35)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 416, elements: !463)
!1032 = !{!1016}
!1033 = !DIFile(filename: "lib/tempname.c", directory: "/home/mohamad/clone/coreutils")
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "ht", scope: !1036, file: !1037, line: 163, type: !172, isLocal: true, isDefinition: true)
!1036 = distinct !DISubprogram(name: "utimecmpat", scope: !1037, file: !1037, line: 132, type: !1038, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1063, retainedNodes: !295)
!1037 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/mohamad/clone/coreutils")
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!5, !5, !180, !1040, !1040, !5}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !471, line: 46, size: 1152, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1060, !1061, !1062}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1042, file: !471, line: 48, baseType: !460, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1042, file: !471, line: 53, baseType: !461, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1042, file: !471, line: 61, baseType: !468, size: 64, offset: 128)
