; ModuleID = 'ls.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.dev_ino = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.fileinfo = type { i8*, i8*, i8*, %struct.stat, i32, i32, i8*, i8, i8, i32, i8, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.bin_str = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque

!122 = !DIEnumerator(name: "locale_time_style", value: 3, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 19, baseType: !6, size: 32, elements: !125)
!124 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/mbarbar/software/coreutils-8.31")
!125 = !{!126, !127, !128}
!126 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2475, baseType: !6, size: 32, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136}
!131 = !DIEnumerator(name: "PS_START", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "PS_2", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "PS_3", value: 3, isUnsigned: true)
!134 = !DIEnumerator(name: "PS_4", value: 4, isUnsigned: true)
!135 = !DIEnumerator(name: "PS_DONE", value: 5, isUnsigned: true)
!136 = !DIEnumerator(name: "PS_FAIL", value: 6, isUnsigned: true)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !138, file: !3, line: 2286, baseType: !6, size: 32, elements: !153)
!138 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2281, type: !139, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !142, !145, !141, !148}
!141 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !{}
!153 = !{!154, !155, !156, !157, !158, !159, !160}
!154 = !DIEnumerator(name: "ST_GND", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "ST_BACKSLASH", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "ST_OCTAL", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "ST_HEX", value: 3, isUnsigned: true)
!158 = !DIEnumerator(name: "ST_CARET", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "ST_END", value: 5, isUnsigned: true)
!160 = !DIEnumerator(name: "ST_ERROR", value: 6, isUnsigned: true)
!161 = !{!162, !167, !168, !149, !171, !148, !143, !151, !146, !27, !176, !177, !180, !183, !235, !237, !142, !141, !164, !219, !244, !248, !252, !253, !261, !268, !320, !324, !328, !174, !330, !331, !333, !335, !258, !337, !260, !339, !341, !343, !346, !348, !395, !397, !401, !403, !413, !417, !508, !510, !355, !511, !147, !516, !528, !532, !535, !537, !539, !543, !546, !550, !553, !557, !558, !560, !144, !561, !564, !565, !567, !325, !568, !570, !572, !574, !577, !579, !581, !586, !587, !589, !592, !593, !599, !602, !604, !139, !607, !609, !613, !195, !197, !591, !622, !625, !627, !629, !631, !635, !638, !641, !654, !655, !657, !659, !661, !663, !664, !666, !667, !201, !228, !212, !203, !205, !669, !199, !179, !672, !674, !676, !680, !682, !684, !686, !688, !690, !693, !695, !698, !700, !702, !704, !715, !723, !725, !727, !719, !728, !731, !733, !735, !737, !739, !399, !741, !743, !744, !745, !747, !749, !751, !753, !755, !762, !763, !765, !767, !769, !770, !773, !776, !778, !780, !782, !800, !802, !805, !807, !815}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !163, line: 7, baseType: !164)
!163 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !165, line: 160, baseType: !166)
!165 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!166 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !169, line: 102, baseType: !170)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !165, line: 73, baseType: !151)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !172, line: 72, baseType: !173)
!172 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !27}
!176 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !178, line: 85, baseType: !179)
!178 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !165, line: 152, baseType: !166)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 199, size: 1600, elements: !186)
!186 = !{!187, !188, !189, !190, !226, !227, !229, !230, !231, !232, !233, !234}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !3, line: 202, baseType: !143, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !185, file: !3, line: 205, baseType: !143, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !185, file: !3, line: 208, baseType: !143, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !185, file: !3, line: 210, baseType: !191, size: 1152, offset: 192)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !192, line: 46, size: 1152, elements: !193)
!192 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!193 = !{!194, !196, !198, !200, !202, !204, !206, !207, !208, !209, !211, !213, !220, !221, !222}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !191, file: !192, line: 48, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !165, line: 145, baseType: !151)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !191, file: !192, line: 53, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !165, line: 148, baseType: !151)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !191, file: !192, line: 61, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !165, line: 151, baseType: !151)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !191, file: !192, line: 62, baseType: !201, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !165, line: 150, baseType: !6)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !191, file: !192, line: 64, baseType: !203, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !165, line: 146, baseType: !6)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !191, file: !192, line: 65, baseType: !205, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !165, line: 147, baseType: !6)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !191, file: !192, line: 67, baseType: !27, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !191, file: !192, line: 69, baseType: !195, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !191, file: !192, line: 74, baseType: !179, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !191, file: !192, line: 78, baseType: !210, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !165, line: 174, baseType: !166)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !191, file: !192, line: 80, baseType: !212, size: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !165, line: 179, baseType: !166)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !191, file: !192, line: 91, baseType: !214, size: 128, offset: 576)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !215, line: 9, size: 128, elements: !216)
!215 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !214, file: !215, line: 11, baseType: !164, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !214, file: !215, line: 12, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !165, line: 196, baseType: !166)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !191, file: !192, line: 92, baseType: !214, size: 128, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !191, file: !192, line: 93, baseType: !214, size: 128, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !191, file: !192, line: 106, baseType: !223, size: 192, offset: 960)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 192, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !185, file: !3, line: 212, baseType: !36, size: 32, offset: 1344)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !185, file: !3, line: 216, baseType: !228, size: 32, offset: 1376)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !178, line: 69, baseType: !201)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !185, file: !3, line: 219, baseType: !143, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !185, file: !3, line: 221, baseType: !141, size: 8, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !185, file: !3, line: 225, baseType: !141, size: 8, offset: 1480)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !185, file: !3, line: 229, baseType: !48, size: 32, offset: 1504)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !185, file: !3, line: 232, baseType: !141, size: 8, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !185, file: !3, line: 235, baseType: !27, size: 32, offset: 1568)
!235 = !DISubroutineType(types: !236)
!236 = !{!27, !27, !142}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 367, size: 256, elements: !239)
!239 = !{!240, !241, !242, !243}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !3, line: 369, baseType: !143, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !238, file: !3, line: 373, baseType: !143, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !238, file: !3, line: 374, baseType: !141, size: 8, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !3, line: 375, baseType: !237, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !246, line: 69, baseType: !247)
!246 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !246, line: 67, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !249, line: 764, baseType: !250)
!249 = !DIFile(filename: "./lib/time.h", directory: "/home/mbarbar/software/coreutils-8.31")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !249, line: 764, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !255, line: 7, size: 128, elements: !256)
!255 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mbarbar/software/coreutils-8.31")
!256 = !{!257, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !254, file: !255, line: 9, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !178, line: 47, baseType: !197)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !254, file: !255, line: 10, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !178, line: 59, baseType: !195)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 3072, elements: !266)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 244, size: 128, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !262, file: !3, line: 246, baseType: !149, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !262, file: !3, line: 247, baseType: !146, size: 64, offset: 64)
!266 = !{!267}
!267 = !DISubrange(count: 24)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !270, line: 7, baseType: !271)
!270 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, elements: !273)
!272 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !289, !291, !292, !293, !294, !295, !297, !301, !304, !306, !309, !312, !313, !314, !315, !316}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !271, file: !272, line: 51, baseType: !27, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !271, file: !272, line: 54, baseType: !143, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !271, file: !272, line: 55, baseType: !143, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !271, file: !272, line: 56, baseType: !143, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !271, file: !272, line: 57, baseType: !143, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !271, file: !272, line: 58, baseType: !143, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !271, file: !272, line: 59, baseType: !143, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !271, file: !272, line: 60, baseType: !143, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !271, file: !272, line: 61, baseType: !143, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !271, file: !272, line: 64, baseType: !143, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !271, file: !272, line: 65, baseType: !143, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !271, file: !272, line: 66, baseType: !143, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !271, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !272, line: 36, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !271, file: !272, line: 70, baseType: !290, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !271, file: !272, line: 72, baseType: !27, size: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !271, file: !272, line: 73, baseType: !27, size: 32, offset: 928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !271, file: !272, line: 74, baseType: !179, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !271, file: !272, line: 77, baseType: !176, size: 16, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !271, file: !272, line: 78, baseType: !296, size: 8, offset: 1040)
!296 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !271, file: !272, line: 79, baseType: !298, size: 8, offset: 1048)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 1)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !271, file: !272, line: 81, baseType: !302, size: 64, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !272, line: 43, baseType: null)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !271, file: !272, line: 89, baseType: !305, size: 64, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !165, line: 153, baseType: !166)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !271, file: !272, line: 91, baseType: !307, size: 64, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !272, line: 37, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !271, file: !272, line: 92, baseType: !310, size: 64, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !272, line: 38, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !271, file: !272, line: 93, baseType: !290, size: 64, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !271, file: !272, line: 94, baseType: !167, size: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !271, file: !272, line: 95, baseType: !149, size: 64, offset: 1472)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !271, file: !272, line: 96, baseType: !27, size: 32, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !271, file: !272, line: 98, baseType: !317, size: 160, offset: 1568)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 160, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 20)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !322, line: 8, baseType: !323)
!322 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !165, line: 214, baseType: !27)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, elements: !326)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!326 = !{!327}
!327 = !DISubrange(count: -1)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !96, line: 270, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!331 = !DISubroutineType(types: !332)
!332 = !{!141, !53}
!333 = !DISubroutineType(types: !334)
!334 = !{!149, !181, !149}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!337 = !DISubroutineType(types: !338)
!338 = !{!141, !181, !181}
!339 = !DISubroutineType(types: !340)
!340 = !{null, !167}
!341 = !DISubroutineType(types: !342)
!342 = !{null}
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 2048, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 256)
!346 = !DISubroutineType(types: !347)
!347 = !{!254}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !351, line: 174, size: 704, elements: !352)
!351 = !DIFile(filename: "./lib/obstack.h", directory: "/home/mbarbar/software/coreutils-8.31")
!352 = !{!353, !354, !362, !363, !364, !365, !370, !371, !382, !391, !392, !393, !394}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !350, file: !351, line: 176, baseType: !149, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !350, file: !351, line: 177, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !351, line: 167, size: 128, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !356, file: !351, line: 169, baseType: !143, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !351, line: 170, baseType: !355, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !356, file: !351, line: 171, baseType: !361, offset: 128)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, elements: !326)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !350, file: !351, line: 178, baseType: !143, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !350, file: !351, line: 179, baseType: !143, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !350, file: !351, line: 180, baseType: !143, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !350, file: !351, line: 185, baseType: !366, size: 64, offset: 320)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !350, file: !351, line: 181, size: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !366, file: !351, line: 183, baseType: !149, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !366, file: !351, line: 184, baseType: !167, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !350, file: !351, line: 186, baseType: !149, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !350, file: !351, line: 193, baseType: !372, size: 64, offset: 448)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !350, file: !351, line: 189, size: 64, elements: !373)
!373 = !{!374, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !372, file: !351, line: 191, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!167, !149}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !372, file: !351, line: 192, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!167, !167, !149}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !350, file: !351, line: 198, baseType: !383, size: 64, offset: 512)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !350, file: !351, line: 194, size: 64, elements: !384)
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !383, file: !351, line: 196, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !383, file: !351, line: 197, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !167, !167}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !350, file: !351, line: 200, baseType: !167, size: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !350, file: !351, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !350, file: !351, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !350, file: !351, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !237}
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !141}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !404, line: 7, baseType: !405)
!404 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !406, line: 8, baseType: !407)
!406 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 5, size: 1024, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !407, file: !406, line: 7, baseType: !410, size: 1024)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 1024, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 16)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 384, elements: !415)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!415 = !{!416}
!416 = !DISubrange(count: 12)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !419, file: !418, line: 31, size: 64, elements: !426)
!418 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !418, line: 27, size: 1216, elements: !420)
!420 = !{!421, !422, !423, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !419, file: !418, line: 38, baseType: !417, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !419, file: !418, line: 46, baseType: !405, size: 1024, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !419, file: !418, line: 49, baseType: !27, size: 32, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !419, file: !418, line: 52, baseType: !425, size: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !417, file: !418, line: 34, baseType: !171, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !417, file: !418, line: 36, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !27, !432, !167}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !434, line: 124, baseType: !435)
!434 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 36, size: 1024, elements: !436)
!436 = !{!437, !438, !439, !440, !441}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !435, file: !434, line: 38, baseType: !27, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !435, file: !434, line: 40, baseType: !27, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !435, file: !434, line: 42, baseType: !27, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !435, file: !434, line: 48, baseType: !27, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !435, file: !434, line: 123, baseType: !442, size: 896, offset: 128)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !434, line: 51, size: 896, elements: !443)
!443 = !{!444, !448, !454, !466, !472, !481, !497, !502}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !442, file: !434, line: 53, baseType: !445, size: 896)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 896, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 28)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !442, file: !434, line: 60, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 56, size: 64, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !449, file: !434, line: 58, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !165, line: 154, baseType: !27)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !449, file: !434, line: 59, baseType: !203, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !442, file: !434, line: 68, baseType: !455, size: 128)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 63, size: 128, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !455, file: !434, line: 65, baseType: !27, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !455, file: !434, line: 66, baseType: !27, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !455, file: !434, line: 67, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !461, line: 30, baseType: !462)
!461 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !461, line: 24, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !462, file: !461, line: 26, baseType: !27, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !462, file: !461, line: 27, baseType: !167, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !442, file: !434, line: 76, baseType: !467, size: 128)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 71, size: 128, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !467, file: !434, line: 73, baseType: !452, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !467, file: !434, line: 74, baseType: !203, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !467, file: !434, line: 75, baseType: !460, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !442, file: !434, line: 86, baseType: !473, size: 256)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 79, size: 256, elements: !474)
!474 = !{!475, !476, !477, !478, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !473, file: !434, line: 81, baseType: !452, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !473, file: !434, line: 82, baseType: !203, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !473, file: !434, line: 83, baseType: !27, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !473, file: !434, line: 84, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !165, line: 156, baseType: !166)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !473, file: !434, line: 85, baseType: !479, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !442, file: !434, line: 105, baseType: !482, size: 256)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 89, size: 256, elements: !483)
!483 = !{!484, !485, !487}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !482, file: !434, line: 91, baseType: !167, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !482, file: !434, line: 93, baseType: !486, size: 16, offset: 64)
!486 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !482, file: !434, line: 104, baseType: !488, size: 128, offset: 128)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !434, line: 94, size: 128, elements: !489)
!489 = !{!490, !495}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !488, file: !434, line: 101, baseType: !491, size: 128)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !434, line: 97, size: 128, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !491, file: !434, line: 99, baseType: !167, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !491, file: !434, line: 100, baseType: !167, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !488, file: !434, line: 103, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !165, line: 42, baseType: !6)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !442, file: !434, line: 112, baseType: !498, size: 128)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 108, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !498, file: !434, line: 110, baseType: !166, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !498, file: !434, line: 111, baseType: !27, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !442, file: !434, line: 121, baseType: !503, size: 128)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !434, line: 116, size: 128, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !503, file: !434, line: 118, baseType: !167, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !503, file: !434, line: 119, baseType: !27, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !503, file: !434, line: 120, baseType: !6, size: 32, offset: 96)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !146, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 690, size: 128, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !512, file: !3, line: 692, baseType: !146, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !3, line: 693, baseType: !511, size: 64, offset: 64)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 11264, elements: !526)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !519, line: 50, size: 256, elements: !520)
!519 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!520 = !{!521, !522, !523, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !519, line: 52, baseType: !146, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !518, file: !519, line: 55, baseType: !27, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !519, line: 56, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !518, file: !519, line: 57, baseType: !27, size: 32, offset: 192)
!526 = !{!527}
!527 = !DISubrange(count: 44)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 160, elements: !530)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!530 = !{!531}
!531 = !DISubrange(count: 5)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 384, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 6)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !536, line: 55, baseType: !425)
!536 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 160, elements: !530)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 224, elements: !541)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!541 = !{!542}
!542 = !DISubrange(count: 7)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 512, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 8)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 288, elements: !548)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!548 = !{!549}
!549 = !DISubrange(count: 9)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 640, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 10)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 128, elements: !555)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!555 = !{!556}
!556 = !DISubrange(count: 4)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 320, elements: !530)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, elements: !326)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 48, elements: !533)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 128, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 2)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !150, line: 35, baseType: !166)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !555)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!141, !146}
!570 = !DISubroutineType(types: !571)
!571 = !{null, !146}
!572 = !DISubroutineType(types: !573)
!573 = !{!143, !146}
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 12288, elements: !575)
!575 = !{!416, !576}
!576 = !DISubrange(count: 128)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 24576, elements: !578)
!578 = !{!563, !416, !576}
!579 = !DISubroutineType(types: !580)
!580 = !{!146, !146}
!581 = !DISubroutineType(types: !582)
!582 = !{!141, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1024, elements: !585)
!585 = !{!576}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !124, line: 19, baseType: !123)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!589 = !DISubroutineType(types: !590)
!590 = !{!591, !144}
!591 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 24, elements: !224)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_ext_type", file: !3, line: 601, size: 320, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !594, file: !3, line: 603, baseType: !262, size: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !594, file: !3, line: 604, baseType: !262, size: 128, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !594, file: !3, line: 605, baseType: !593, size: 64, offset: 256)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 1600, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 25)
!602 = !DISubroutineType(types: !603)
!603 = !{!141}
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 34336, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 4292)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !146, !146, !141}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !611, line: 127, baseType: !612)
!611 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !611, line: 127, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !615, line: 22, size: 2240, elements: !616)
!615 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!616 = !{!617, !618, !619, !620, !621}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !614, file: !615, line: 25, baseType: !197, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !614, file: !615, line: 26, baseType: !179, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !614, file: !615, line: 31, baseType: !176, size: 16, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !614, file: !615, line: 32, baseType: !591, size: 8, offset: 144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !614, file: !615, line: 33, baseType: !343, size: 2048, offset: 152)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 5216, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 652)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !141, !146, !146}
!627 = !DISubroutineType(types: !628)
!628 = !{!141, !260, !258}
!629 = !DISubroutineType(types: !630)
!630 = !{null, !260, !258}
!631 = !DISubroutineType(types: !632)
!632 = !{!149, !146, !633, !27, !399, !141, !510, !146}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 65536, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 8192)
!638 = !DISubroutineType(types: !639)
!639 = !{!149, !142, !149, !143, !633, !27, !148, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !642, line: 6, baseType: !643)
!642 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !644, line: 21, baseType: !645)
!644 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 13, size: 64, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !645, file: !644, line: 15, baseType: !27, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !645, file: !644, line: 20, baseType: !649, size: 32, offset: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !645, file: !644, line: 16, size: 32, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !649, file: !644, line: 18, baseType: !6, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !649, file: !644, line: 19, baseType: !653, size: 32)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 32, elements: !555)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !150, line: 74, baseType: !27)
!655 = !DISubroutineType(types: !656)
!656 = !{!141, !399}
!657 = !DISubroutineType(types: !658)
!658 = !{!143, !146, !141}
!659 = !DISubroutineType(types: !660)
!660 = !{!141, !661, !146}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !252}
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 16, elements: !562)
!667 = !DISubroutineType(types: !668)
!668 = !{!168, !146, !36, !258, !141, !146}
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 168, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 21)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !143, !146, !146}
!674 = !DISubroutineType(types: !675)
!675 = !{!141, !146, !252}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "cap_t", file: !677, line: 39, baseType: !678)
!677 = !DIFile(filename: "/usr/include/sys/capability.h", directory: "")
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cap_struct", file: !677, line: 39, flags: DIFlagFwdDecl)
!680 = !DISubroutineType(types: !681)
!681 = !{!141, !27}
!682 = !DISubroutineType(types: !683)
!683 = !{!27, !146, !252, !141}
!684 = !DISubroutineType(types: !685)
!685 = !{!27, !146, !252}
!686 = !DISubroutineType(types: !687)
!687 = !{null, !146, !252, !141}
!688 = !DISubroutineType(types: !689)
!689 = !{!143, !146, !146}
!690 = !DISubroutineType(types: !691)
!691 = !{!27, !692}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !178, line: 79, baseType: !203)
!693 = !DISubroutineType(types: !694)
!694 = !{!27, !146, !151}
!695 = !DISubroutineType(types: !696)
!696 = !{!27, !697}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !178, line: 64, baseType: !205)
!698 = !DISubroutineType(types: !699)
!699 = !{!168, !177}
!700 = !DISubroutineType(types: !701)
!701 = !{null, !146, !141}
!702 = !DISubroutineType(types: !703)
!703 = !{!141, !183}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !705, line: 45, baseType: !706)
!705 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 1600, elements: !299)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !705, line: 33, size: 1600, elements: !708)
!708 = !{!709, !713, !714}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !707, file: !705, line: 39, baseType: !710, size: 512)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !711, line: 31, baseType: !712)
!711 = !DIFile(filename: "/usr/include/bits/setjmp.h", directory: "")
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 512, elements: !544)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !707, file: !705, line: 40, baseType: !27, size: 32, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !707, file: !705, line: 41, baseType: !405, size: 1024, offset: 576)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 3584, elements: !722)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "qsortFunc", file: !3, line: 3585, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!27, !721, !721}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "V", file: !3, line: 3584, baseType: !181)
!722 = !{!542, !563, !563, !563}
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 512, elements: !724)
!724 = !{!563, !563, !563}
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 256, elements: !726)
!726 = !{!563, !563}
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 128, elements: !562)
!728 = !DISubroutineType(types: !729)
!729 = !{!27, !183, !183, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!27, !146, !146}
!733 = !DISubroutineType(types: !734)
!734 = !{!27, !183, !183}
!735 = !DISubroutineType(types: !736)
!736 = !{!149, !183, !149}
!737 = !DISubroutineType(types: !738)
!738 = !{!143, !143, !149, !183}
!739 = !DISubroutineType(types: !740)
!740 = !{!149, !183, !141, !510, !149}
!741 = !DISubroutineType(types: !742)
!742 = !{!399, !183, !141}
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 320, elements: !551)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!745 = !DISubroutineType(types: !746)
!746 = !{!141, !141, !228, !36}
!747 = !DISubroutineType(types: !748)
!748 = !{!144, !141, !228, !36}
!749 = !DISubroutineType(types: !750)
!750 = !{null, !144}
!751 = !DISubroutineType(types: !752)
!752 = !{!149, !183}
!753 = !DISubroutineType(types: !754)
!754 = !{!149, !146, !633, !27}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "column_info", file: !3, line: 937, size: 192, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "valid_len", scope: !757, file: !3, line: 939, baseType: !141, size: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "line_len", scope: !757, file: !3, line: 940, baseType: !149, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "col_arr", scope: !757, file: !3, line: 941, baseType: !148, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!149, !141}
!765 = !DISubroutineType(types: !766)
!766 = !{null, !149, !149}
!767 = !DISubroutineType(types: !768)
!768 = !{null, !183}
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !415)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 29144, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 3643)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 88, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 11)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !692, !27, !141}
!778 = !DISubroutineType(types: !779)
!779 = !{null, !697, !27, !141}
!780 = !DISubroutineType(types: !781)
!781 = !{null, !146, !151, !27}
!782 = !DISubroutineType(types: !783)
!783 = !{!149, !143, !149, !141, !784, !248, !27}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !787, line: 7, size: 448, elements: !788)
!787 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !786, file: !787, line: 9, baseType: !27, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !786, file: !787, line: 10, baseType: !27, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !786, file: !787, line: 11, baseType: !27, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !786, file: !787, line: 12, baseType: !27, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !786, file: !787, line: 13, baseType: !27, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !786, file: !787, line: 14, baseType: !27, size: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !786, file: !787, line: 15, baseType: !27, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !786, file: !787, line: 16, baseType: !27, size: 32, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !786, file: !787, line: 17, baseType: !27, size: 32, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !786, file: !787, line: 20, baseType: !166, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !786, file: !787, line: 21, baseType: !146, size: 64, offset: 384)
!800 = !DISubroutineType(types: !801)
!801 = !{!27}
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8008, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 1001)
!805 = !DISubroutineType(types: !806)
!806 = !{!143, !162, !143}
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 896, elements: !541)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !811, file: !810, line: 633, size: 128, elements: !812)
!810 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!811 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !810, file: !810, line: 631, type: !570, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !809, file: !810, line: 633, baseType: !146, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !809, file: !810, line: 633, baseType: !146, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!816 = !{!817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !847, !849, !851, !853, !855, !857, !859, !861, !863, !865, !867, !869, !871, !0, !873, !875, !877, !879, !881, !883, !885, !887, !890, !892, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !926, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !956, !958, !960, !962, !964, !966, !968, !971, !973, !975, !977, !980, !982, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1011, !1014, !1017, !1019, !1021, !1023, !1026, !1029, !1031, !1033}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 319, type: !244, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 330, type: !252, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 333, type: !149, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 336, type: !149, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 355, type: !141, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 357, type: !146, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 378, type: !237, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 383, type: !214, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 385, type: !141, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 428, type: !5, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 481, type: !26, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 510, type: !141, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 525, type: !141, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 542, type: !20, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 559, type: !141, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !2, file: !3, line: 561, type: !141, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !2, file: !3, line: 645, type: !141, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 654, type: !13, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 659, type: !141, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 664, type: !141, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 668, type: !141, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 715, type: !328, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 724, type: !141, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 733, type: !248, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 738, type: !141, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 743, type: !141, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 792, type: !320, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 796, type: !320, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 960, type: !149, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 981, type: !350, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 988, type: !350, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 1002, type: !350, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "RFC3986", scope: !2, file: !3, line: 1083, type: !343, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 567, type: !141, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 608, type: !261, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "sig", scope: !889, file: !3, line: 1358, type: !413, isLocal: true, isDefinition: true)
!889 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1355, type: !401, scopeLine: 1356, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 788, type: !403, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !894, file: !3, line: 2181, type: !895, isLocal: true, isDefinition: true)
!894 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1688, type: !235, scopeLine: 1689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 56, elements: !541)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 711, type: !141, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 464, type: !79, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 489, type: !141, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 506, type: !141, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 649, type: !141, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 683, type: !85, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 696, type: !511, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 700, type: !511, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 729, type: !149, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 720, type: !149, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 839, type: !516, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 493, type: !141, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 513, type: !27, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 519, type: !27, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 516, type: !168, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 520, type: !168, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 501, type: !141, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 497, type: !141, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 905, type: !528, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 901, type: !532, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 915, type: !537, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 911, type: !532, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 894, type: !539, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 889, type: !543, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "when_types", scope: !2, file: !3, line: 928, type: !546, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "when_args", scope: !2, file: !3, line: 921, type: !550, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 549, type: !553, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 545, type: !557, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 948, type: !149, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 343, type: !141, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 716, type: !328, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 756, type: !561, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 441, type: !557, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 445, type: !565, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1107, type: !577, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1111, type: !141, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !970, line: 1, type: !604, isLocal: true, isDefinition: true)
!970 = !DIFile(filename: "src/dircolors.h", directory: "/home/mbarbar/software/coreutils-8.31")
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "color_buf", scope: !2, file: !3, line: 640, type: !143, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "color_ext_list", scope: !2, file: !3, line: 637, type: !593, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "indicator_name", scope: !2, file: !3, line: 594, type: !599, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "first", scope: !979, file: !3, line: 2725, type: !141, isLocal: true, isDefinition: true)
!979 = distinct !DISubprogram(name: "print_dir", scope: !3, file: !3, line: 2720, type: !607, scopeLine: 2721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "cwd_some_quoted", scope: !2, file: !3, line: 339, type: !141, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "sorted_file", scope: !2, file: !3, line: 347, type: !663, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "UNKNOWN_SECURITY_CONTEXT", scope: !2, file: !3, line: 386, type: !666, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "any_has_acl", scope: !2, file: !3, line: 391, type: !141, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "inode_number_width", scope: !2, file: !3, line: 397, type: !27, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "block_size_width", scope: !2, file: !3, line: 398, type: !27, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "nlink_width", scope: !2, file: !3, line: 399, type: !27, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "owner_width", scope: !2, file: !3, line: 401, type: !27, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "group_width", scope: !2, file: !3, line: 402, type: !27, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "author_width", scope: !2, file: !3, line: 403, type: !27, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "scontext_width", scope: !2, file: !3, line: 400, type: !27, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "major_device_number_width", scope: !2, file: !3, line: 404, type: !27, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "minor_device_number_width", scope: !2, file: !3, line: 405, type: !27, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "file_size_width", scope: !2, file: !3, line: 406, type: !27, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1010, file: !3, line: 3084, type: !260, isLocal: true, isDefinition: true)
!1010 = distinct !DISubprogram(name: "has_capability_cache", scope: !3, file: !3, line: 3080, type: !674, scopeLine: 3081, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1013, file: !3, line: 3029, type: !260, isLocal: true, isDefinition: true)
!1013 = distinct !DISubprogram(name: "getfilecon_cache", scope: !3, file: !3, line: 3025, type: !682, scopeLine: 3026, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1016, file: !3, line: 3059, type: !260, isLocal: true, isDefinition: true)
!1016 = distinct !DISubprogram(name: "file_has_acl_cache", scope: !3, file: !3, line: 3055, type: !684, scopeLine: 3056, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "sorted_file_alloc", scope: !2, file: !3, line: 348, type: !149, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "failed_strcoll", scope: !2, file: !3, line: 3564, type: !704, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "sort_functions", scope: !2, file: !3, line: 3741, type: !715, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "filetype_indicator", scope: !1025, file: !3, line: 4710, type: !743, isLocal: true, isDefinition: true)
!1025 = distinct !DISubprogram(name: "get_color_indicator", scope: !3, file: !3, line: 4682, type: !741, scopeLine: 4683, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "column_info_alloc", scope: !1028, file: !3, line: 5015, type: !149, isLocal: true, isDefinition: true)
!1028 = distinct !DISubprogram(name: "init_column_info", scope: !3, file: !3, line: 5009, type: !341, scopeLine: 5010, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "column_info", scope: !2, file: !3, line: 945, type: !762, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "filetype_letter", scope: !2, file: !3, line: 180, type: !773, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "width", scope: !1035, file: !3, line: 3895, type: !27, isLocal: true, isDefinition: true)
!1035 = distinct !DISubprogram(name: "long_time_expected_width", scope: !3, file: !3, line: 3893, type: !800, scopeLine: 3894, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "ls_mode", scope: !1038, file: !1039, line: 2, type: !27, isLocal: false, isDefinition: true)
!1038 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1039, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !801, globals: !1040, nameTableKind: None)
!1039 = !DIFile(filename: "src/ls-ls.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1040 = !{!1036}
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "Version", scope: !1043, file: !1044, line: 2, type: !146, isLocal: false, isDefinition: true)
!1043 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1044, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1045, globals: !1046, nameTableKind: None)
!1044 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1045 = !{!146}
!1046 = !{!1041}
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1049, file: !1097, line: 69, type: !535, isLocal: false, isDefinition: true)
!1049 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1050, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1051, globals: !1096, nameTableKind: None)
!1050 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1051 = !{!167, !535, !1052, !149, !564, !141, !567, !1054, !146, !1056, !1058, !1092, !1094, !341}
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!564, !146, !567, !146, !149}
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !146, !146, !564}
!1056 = !DISubroutineType(types: !1057)
!1057 = !{null, !567, !146, !149}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !270, line: 7, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1060, file: !272, line: 51, baseType: !27, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1060, file: !272, line: 54, baseType: !143, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1060, file: !272, line: 55, baseType: !143, size: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1060, file: !272, line: 56, baseType: !143, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1060, file: !272, line: 57, baseType: !143, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1060, file: !272, line: 58, baseType: !143, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1060, file: !272, line: 59, baseType: !143, size: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1060, file: !272, line: 60, baseType: !143, size: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1060, file: !272, line: 61, baseType: !143, size: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1060, file: !272, line: 64, baseType: !143, size: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1060, file: !272, line: 65, baseType: !143, size: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1060, file: !272, line: 66, baseType: !143, size: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1060, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1060, file: !272, line: 70, baseType: !1076, size: 64, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1060, file: !272, line: 72, baseType: !27, size: 32, offset: 896)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1060, file: !272, line: 73, baseType: !27, size: 32, offset: 928)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1060, file: !272, line: 74, baseType: !179, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1060, file: !272, line: 77, baseType: !176, size: 16, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1060, file: !272, line: 78, baseType: !296, size: 8, offset: 1040)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1060, file: !272, line: 79, baseType: !298, size: 8, offset: 1048)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1060, file: !272, line: 81, baseType: !302, size: 64, offset: 1088)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1060, file: !272, line: 89, baseType: !305, size: 64, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1060, file: !272, line: 91, baseType: !307, size: 64, offset: 1216)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1060, file: !272, line: 92, baseType: !310, size: 64, offset: 1280)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1060, file: !272, line: 93, baseType: !1076, size: 64, offset: 1344)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1060, file: !272, line: 94, baseType: !167, size: 64, offset: 1408)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1060, file: !272, line: 95, baseType: !149, size: 64, offset: 1472)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1060, file: !272, line: 96, baseType: !27, size: 32, offset: 1536)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1060, file: !272, line: 98, baseType: !317, size: 160, offset: 1568)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!564, !146, !146, !567, !146, !149, !535}
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!146, !146, !567, !146, !149}
!1096 = !{!1047}
!1097 = !DIFile(filename: "lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "file_name", scope: !1100, file: !1140, line: 46, type: !146, isLocal: true, isDefinition: true)
!1100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1101, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1102, globals: !1137, nameTableKind: None)
!1101 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1102 = !{!570, !146, !401, !141, !341, !1103, !27, !330}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !270, line: 7, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1105, file: !272, line: 51, baseType: !27, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1105, file: !272, line: 54, baseType: !143, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1105, file: !272, line: 55, baseType: !143, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1105, file: !272, line: 56, baseType: !143, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1105, file: !272, line: 57, baseType: !143, size: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1105, file: !272, line: 58, baseType: !143, size: 64, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1105, file: !272, line: 59, baseType: !143, size: 64, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1105, file: !272, line: 60, baseType: !143, size: 64, offset: 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1105, file: !272, line: 61, baseType: !143, size: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1105, file: !272, line: 64, baseType: !143, size: 64, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1105, file: !272, line: 65, baseType: !143, size: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1105, file: !272, line: 66, baseType: !143, size: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1105, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1105, file: !272, line: 70, baseType: !1121, size: 64, offset: 832)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1105, file: !272, line: 72, baseType: !27, size: 32, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1105, file: !272, line: 73, baseType: !27, size: 32, offset: 928)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1105, file: !272, line: 74, baseType: !179, size: 64, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1105, file: !272, line: 77, baseType: !176, size: 16, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1105, file: !272, line: 78, baseType: !296, size: 8, offset: 1040)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1105, file: !272, line: 79, baseType: !298, size: 8, offset: 1048)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1105, file: !272, line: 81, baseType: !302, size: 64, offset: 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1105, file: !272, line: 89, baseType: !305, size: 64, offset: 1152)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1105, file: !272, line: 91, baseType: !307, size: 64, offset: 1216)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1105, file: !272, line: 92, baseType: !310, size: 64, offset: 1280)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1105, file: !272, line: 93, baseType: !1121, size: 64, offset: 1344)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1105, file: !272, line: 94, baseType: !167, size: 64, offset: 1408)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1105, file: !272, line: 95, baseType: !149, size: 64, offset: 1472)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1105, file: !272, line: 96, baseType: !27, size: 32, offset: 1536)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1105, file: !272, line: 98, baseType: !317, size: 160, offset: 1568)
!1137 = !{!1098, !1138}
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1100, file: !1140, line: 56, type: !141, isLocal: true, isDefinition: true)
!1140 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1143, file: !1147, line: 24, type: !330, isLocal: false, isDefinition: true)
!1143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1144, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1145, globals: !1146, nameTableKind: None)
!1144 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1145 = !{!330}
!1146 = !{!1141}
!1147 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1150, file: !1159, line: 130, type: !1175, isLocal: true, isDefinition: true)
!1150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1151, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1152, globals: !1279, nameTableKind: None)
!1151 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1152 = !{!151, !167, !149, !1153, !1156, !1168, !1162, !1194, !1196, !1232, !1189, !1234, !1236, !663, !1238, !1244, !591, !147, !1246, !1175, !1249, !1251, !1157, !1174, !1186, !1192, !1252, !1254, !1256, !181, !1180, !141, !1258, !27, !1260, !333, !337, !1262, !1264, !1266, !1268, !1270, !1272, !1274, !1277}
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!149, !1155}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !246, line: 69, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1159, line: 52, size: 640, elements: !1160)
!1159 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1160 = !{!1161, !1167, !1170, !1171, !1172, !1173, !1185, !1188, !1191, !1193}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !1158, file: !1159, line: 57, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !1159, line: 46, size: 128, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !1159, line: 48, baseType: !167, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1163, file: !1159, line: 49, baseType: !1162, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !1158, file: !1159, line: 58, baseType: !1168, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1158, file: !1159, line: 59, baseType: !149, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !1158, file: !1159, line: 60, baseType: !149, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !1158, file: !1159, line: 61, baseType: !149, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !1158, file: !1159, line: 64, baseType: !1174, size: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !246, line: 65, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !246, line: 53, size: 160, elements: !1178)
!1178 = !{!1179, !1181, !1182, !1183, !1184}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1177, file: !246, line: 58, baseType: !1180, size: 32)
!1180 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1177, file: !246, line: 59, baseType: !1180, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1177, file: !246, line: 60, baseType: !1180, size: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1177, file: !246, line: 61, baseType: !1180, size: 32, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1177, file: !246, line: 62, baseType: !141, size: 8, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !1158, file: !1159, line: 71, baseType: !1186, size: 64, offset: 384)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !246, line: 48, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
