; ModuleID = 'ls.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.dev_ino = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.fileinfo = type { i8*, i8*, i8*, %struct.stat, i32, i32, i8*, i8, i8, i32, i8, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.bin_str = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!122 = !DIEnumerator(name: "locale_time_style", value: 3, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 19, baseType: !6, size: 32, elements: !125)
!124 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/mohamad/clone/coreutils")
!125 = !{!126, !127, !128}
!126 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2475, baseType: !6, size: 32, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136}
!131 = !DIEnumerator(name: "PS_START", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "PS_2", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "PS_3", value: 3, isUnsigned: true)
!134 = !DIEnumerator(name: "PS_4", value: 4, isUnsigned: true)
!135 = !DIEnumerator(name: "PS_DONE", value: 5, isUnsigned: true)
!136 = !DIEnumerator(name: "PS_FAIL", value: 6, isUnsigned: true)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !138, file: !3, line: 2286, baseType: !6, size: 32, elements: !153)
!138 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2281, type: !139, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !142, !145, !141, !148}
!141 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "llvm/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mohamad/clone")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !{}
!153 = !{!154, !155, !156, !157, !158, !159, !160}
!154 = !DIEnumerator(name: "ST_GND", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "ST_BACKSLASH", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "ST_OCTAL", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "ST_HEX", value: 3, isUnsigned: true)
!158 = !DIEnumerator(name: "ST_CARET", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "ST_END", value: 5, isUnsigned: true)
!160 = !DIEnumerator(name: "ST_ERROR", value: 6, isUnsigned: true)
!161 = !{!162, !167, !168, !149, !170, !148, !143, !151, !175, !146, !27, !177, !178, !181, !182, !233, !142, !235, !141, !164, !217, !242, !246, !250, !251, !259, !266, !315, !319, !323, !173, !325, !326, !328, !330, !256, !332, !258, !334, !336, !338, !341, !343, !390, !392, !394, !396, !398, !407, !411, !496, !498, !350, !499, !147, !504, !516, !520, !523, !525, !527, !531, !534, !538, !541, !545, !546, !548, !144, !549, !552, !553, !555, !320, !556, !558, !560, !562, !565, !567, !569, !574, !575, !577, !579, !580, !581, !587, !590, !592, !139, !145, !595, !597, !601, !194, !196, !610, !613, !615, !617, !619, !621, !623, !626, !628, !629, !641, !642, !644, !646, !648, !650, !651, !653, !654, !200, !226, !211, !202, !204, !656, !198, !180, !659, !661, !663, !665, !667, !669, !671, !673, !675, !676, !678, !680, !681, !683, !685, !687, !698, !706, !708, !710, !702, !704, !711, !713, !714, !716, !718, !720, !722, !724, !726, !727, !728, !730, !732, !734, !736, !738, !745, !746, !748, !750, !752, !753, !756, !759, !761, !763, !765, !767, !782, !784, !787, !789, !797}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !163, line: 75, baseType: !164)
!163 = !DIFile(filename: "/usr/include/time.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !165, line: 139, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!166 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !169, line: 135, baseType: !151)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !171, line: 85, baseType: !172)
!171 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !27}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !179, line: 86, baseType: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !165, line: 131, baseType: !166)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 199, size: 1600, elements: !185)
!185 = !{!186, !187, !188, !189, !224, !225, !227, !228, !229, !230, !231, !232}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !3, line: 202, baseType: !143, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !184, file: !3, line: 205, baseType: !143, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !184, file: !3, line: 208, baseType: !143, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !184, file: !3, line: 210, baseType: !190, size: 1152, offset: 192)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !191, line: 46, size: 1152, elements: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!192 = !{!193, !195, !197, !199, !201, !203, !205, !206, !207, !208, !210, !212, !218, !219, !220}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !190, file: !191, line: 48, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !165, line: 124, baseType: !151)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !190, file: !191, line: 53, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !165, line: 127, baseType: !151)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !190, file: !191, line: 61, baseType: !198, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !165, line: 130, baseType: !151)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !190, file: !191, line: 62, baseType: !200, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !165, line: 129, baseType: !6)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !190, file: !191, line: 64, baseType: !202, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !165, line: 125, baseType: !6)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !190, file: !191, line: 65, baseType: !204, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !165, line: 126, baseType: !6)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !190, file: !191, line: 67, baseType: !27, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !190, file: !191, line: 69, baseType: !194, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !190, file: !191, line: 74, baseType: !180, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !190, file: !191, line: 78, baseType: !209, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !165, line: 153, baseType: !166)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !190, file: !191, line: 80, baseType: !211, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !165, line: 158, baseType: !166)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !190, file: !191, line: 91, baseType: !213, size: 128, offset: 576)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !163, line: 120, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !213, file: !163, line: 122, baseType: !164, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !213, file: !163, line: 123, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !165, line: 175, baseType: !166)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !190, file: !191, line: 92, baseType: !213, size: 128, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !190, file: !191, line: 93, baseType: !213, size: 128, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !190, file: !191, line: 106, baseType: !221, size: 192, offset: 960)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 192, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !184, file: !3, line: 212, baseType: !36, size: 32, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !184, file: !3, line: 216, baseType: !226, size: 32, offset: 1376)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !179, line: 70, baseType: !200)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !184, file: !3, line: 219, baseType: !143, size: 64, offset: 1408)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !184, file: !3, line: 221, baseType: !141, size: 8, offset: 1472)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !184, file: !3, line: 225, baseType: !141, size: 8, offset: 1480)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !184, file: !3, line: 229, baseType: !48, size: 32, offset: 1504)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !184, file: !3, line: 232, baseType: !141, size: 8, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !184, file: !3, line: 235, baseType: !27, size: 32, offset: 1568)
!233 = !DISubroutineType(types: !234)
!234 = !{!27, !27, !142}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 367, size: 256, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !3, line: 369, baseType: !143, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !236, file: !3, line: 373, baseType: !143, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !236, file: !3, line: 374, baseType: !141, size: 8, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !3, line: 375, baseType: !235, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !244, line: 69, baseType: !245)
!244 = !DIFile(filename: "./lib/hash.h", directory: "/home/mohamad/clone/coreutils")
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !244, line: 67, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !247, line: 764, baseType: !248)
!247 = !DIFile(filename: "./lib/time.h", directory: "/home/mohamad/clone/coreutils")
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !247, line: 764, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !253, line: 7, size: 128, elements: !254)
!253 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mohamad/clone/coreutils")
!254 = !{!255, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !252, file: !253, line: 9, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !179, line: 48, baseType: !196)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !252, file: !253, line: 10, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !179, line: 60, baseType: !194)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 3072, elements: !264)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 244, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !260, file: !3, line: 246, baseType: !149, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !260, file: !3, line: 247, baseType: !146, size: 64, offset: 64)
!264 = !{!265}
!265 = !DISubrange(count: 24)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 241, size: 1728, elements: !269)
!268 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !289, !290, !291, !292, !293, !294, !296, !300, !303, !305, !306, !307, !308, !309, !310, !311}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !267, file: !268, line: 242, baseType: !27, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !267, file: !268, line: 247, baseType: !143, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !267, file: !268, line: 248, baseType: !143, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !267, file: !268, line: 249, baseType: !143, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !267, file: !268, line: 250, baseType: !143, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !267, file: !268, line: 251, baseType: !143, size: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !267, file: !268, line: 252, baseType: !143, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !267, file: !268, line: 253, baseType: !143, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !267, file: !268, line: 254, baseType: !143, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !267, file: !268, line: 256, baseType: !143, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !267, file: !268, line: 257, baseType: !143, size: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !267, file: !268, line: 258, baseType: !143, size: 64, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !267, file: !268, line: 260, baseType: !283, size: 64, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !268, line: 156, size: 192, elements: !285)
!285 = !{!286, !287, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !284, file: !268, line: 157, baseType: !283, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !284, file: !268, line: 158, baseType: !266, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !284, file: !268, line: 162, baseType: !27, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !267, file: !268, line: 262, baseType: !266, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !267, file: !268, line: 264, baseType: !27, size: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !267, file: !268, line: 268, baseType: !27, size: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !267, file: !268, line: 270, baseType: !180, size: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !267, file: !268, line: 274, baseType: !177, size: 16, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !267, file: !268, line: 275, baseType: !295, size: 8, offset: 1040)
!295 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !267, file: !268, line: 276, baseType: !297, size: 8, offset: 1048)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 1)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !267, file: !268, line: 280, baseType: !301, size: 64, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !268, line: 150, baseType: null)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !267, file: !268, line: 289, baseType: !304, size: 64, offset: 1152)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !165, line: 132, baseType: !166)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !267, file: !268, line: 297, baseType: !167, size: 64, offset: 1216)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !267, file: !268, line: 298, baseType: !167, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !267, file: !268, line: 299, baseType: !167, size: 64, offset: 1344)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !267, file: !268, line: 300, baseType: !167, size: 64, offset: 1408)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !267, file: !268, line: 302, baseType: !149, size: 64, offset: 1472)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !267, file: !268, line: 303, baseType: !27, size: 32, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !267, file: !268, line: 305, baseType: !312, size: 160, offset: 1568)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 160, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 20)
!315 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !171, line: 40, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !318, line: 22, baseType: !27)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "")
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, elements: !321)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!321 = !{!322}
!322 = !DISubrange(count: -1)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !96, line: 270, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!326 = !DISubroutineType(types: !327)
!327 = !{!141, !53}
!328 = !DISubroutineType(types: !329)
!329 = !{!149, !175, !149}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!332 = !DISubroutineType(types: !333)
!333 = !{!141, !175, !175}
!334 = !DISubroutineType(types: !335)
!335 = !{null, !167}
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 2048, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 256)
!341 = !DISubroutineType(types: !342)
!342 = !{!252}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !346, line: 174, size: 704, elements: !347)
!346 = !DIFile(filename: "./lib/obstack.h", directory: "/home/mohamad/clone/coreutils")
!347 = !{!348, !349, !357, !358, !359, !360, !365, !366, !377, !386, !387, !388, !389}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !345, file: !346, line: 176, baseType: !149, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !345, file: !346, line: 177, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !346, line: 167, size: 128, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !351, file: !346, line: 169, baseType: !143, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !351, file: !346, line: 170, baseType: !350, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !351, file: !346, line: 171, baseType: !356, offset: 128)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, elements: !321)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !345, file: !346, line: 178, baseType: !143, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !345, file: !346, line: 179, baseType: !143, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !345, file: !346, line: 180, baseType: !143, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !345, file: !346, line: 185, baseType: !361, size: 64, offset: 320)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !346, line: 181, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !361, file: !346, line: 183, baseType: !149, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !361, file: !346, line: 184, baseType: !167, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !345, file: !346, line: 186, baseType: !149, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !345, file: !346, line: 193, baseType: !367, size: 64, offset: 448)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !346, line: 189, size: 64, elements: !368)
!368 = !{!369, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !367, file: !346, line: 191, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!167, !149}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !367, file: !346, line: 192, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!167, !167, !149}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !345, file: !346, line: 198, baseType: !378, size: 64, offset: 512)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !346, line: 194, size: 64, elements: !379)
!379 = !{!380, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !378, file: !346, line: 196, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !378, file: !346, line: 197, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !167, !167}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !345, file: !346, line: 200, baseType: !167, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !345, file: !346, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !345, file: !346, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !345, file: !346, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !235}
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !141}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !399, line: 37, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !318, line: 30, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 27, size: 1024, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !401, file: !318, line: 29, baseType: !404, size: 1024)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 1024, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 16)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 384, elements: !409)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!409 = !{!410}
!410 = !DISubrange(count: 12)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !412, line: 28, size: 64, elements: !420)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !412, line: 24, size: 1216, elements: !414)
!414 = !{!415, !416, !417, !418}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !413, file: !412, line: 35, baseType: !411, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !413, file: !412, line: 43, baseType: !400, size: 1024, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !413, file: !412, line: 46, baseType: !27, size: 32, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !413, file: !412, line: 49, baseType: !419, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !411, file: !412, line: 31, baseType: !170, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !411, file: !412, line: 33, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !27, !426, !167}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !428, line: 133, baseType: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 62, size: 1024, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !429, file: !428, line: 64, baseType: !27, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !429, file: !428, line: 65, baseType: !27, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !429, file: !428, line: 67, baseType: !27, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !429, file: !428, line: 132, baseType: !435, size: 896, offset: 128)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !428, line: 69, size: 896, elements: !436)
!436 = !{!437, !441, !447, !458, !464, !474, !485, !490}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !435, file: !428, line: 71, baseType: !438, size: 896)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 896, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 28)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !435, file: !428, line: 78, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 74, size: 64, elements: !443)
!443 = !{!444, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !442, file: !428, line: 76, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !165, line: 133, baseType: !27)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !442, file: !428, line: 77, baseType: !202, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !435, file: !428, line: 86, baseType: !448, size: 128)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 81, size: 128, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !448, file: !428, line: 83, baseType: !27, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !448, file: !428, line: 84, baseType: !27, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !448, file: !428, line: 85, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !428, line: 36, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !428, line: 32, size: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !454, file: !428, line: 34, baseType: !27, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !454, file: !428, line: 35, baseType: !167, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !435, file: !428, line: 94, baseType: !459, size: 128)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 89, size: 128, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !459, file: !428, line: 91, baseType: !445, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !459, file: !428, line: 92, baseType: !202, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !459, file: !428, line: 93, baseType: !453, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !435, file: !428, line: 104, baseType: !465, size: 256)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 97, size: 256, elements: !466)
!466 = !{!467, !468, !469, !470, !473}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !465, file: !428, line: 99, baseType: !445, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !465, file: !428, line: 100, baseType: !202, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !465, file: !428, line: 101, baseType: !27, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !465, file: !428, line: 102, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !428, line: 58, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !165, line: 135, baseType: !166)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !465, file: !428, line: 103, baseType: !471, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !435, file: !428, line: 116, baseType: !475, size: 256)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 107, size: 256, elements: !476)
!476 = !{!477, !478, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !475, file: !428, line: 109, baseType: !167, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !475, file: !428, line: 110, baseType: !479, size: 16, offset: 64)
!479 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !475, file: !428, line: 115, baseType: !481, size: 128, offset: 128)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !428, line: 111, size: 128, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !481, file: !428, line: 113, baseType: !167, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !481, file: !428, line: 114, baseType: !167, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !435, file: !428, line: 123, baseType: !486, size: 128)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 119, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !486, file: !428, line: 121, baseType: !166, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !486, file: !428, line: 122, baseType: !27, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !435, file: !428, line: 131, baseType: !491, size: 128)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !428, line: 126, size: 128, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !491, file: !428, line: 128, baseType: !167, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !491, file: !428, line: 129, baseType: !27, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !491, file: !428, line: 130, baseType: !6, size: 32, offset: 96)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !146, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 690, size: 128, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !500, file: !3, line: 692, baseType: !146, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !3, line: 693, baseType: !499, size: 64, offset: 64)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 11264, elements: !514)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !507, line: 104, size: 256, elements: !508)
!507 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!508 = !{!509, !510, !511, !513}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !506, file: !507, line: 106, baseType: !146, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !506, file: !507, line: 109, baseType: !27, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !506, file: !507, line: 110, baseType: !512, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !506, file: !507, line: 111, baseType: !27, size: 32, offset: 192)
!514 = !{!515}
!515 = !DISubrange(count: 44)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 160, elements: !518)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!518 = !{!519}
!519 = !DISubrange(count: 5)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 384, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 6)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !524, line: 61, baseType: !419)
!524 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mohamad/clone/coreutils")
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 160, elements: !518)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 224, elements: !529)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!529 = !{!530}
!530 = !DISubrange(count: 7)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 512, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 8)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 288, elements: !536)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!536 = !{!537}
!537 = !DISubrange(count: 9)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 640, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 10)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 128, elements: !543)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!543 = !{!544}
!544 = !DISubrange(count: 4)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 320, elements: !518)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, elements: !321)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 48, elements: !521)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 128, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 2)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !150, line: 35, baseType: !166)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 128, elements: !543)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!141, !146}
!558 = !DISubroutineType(types: !559)
!559 = !{null, !146}
!560 = !DISubroutineType(types: !561)
!561 = !{!143, !146}
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 12288, elements: !563)
!563 = !{!410, !564}
!564 = !DISubrange(count: 128)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 24576, elements: !566)
!566 = !{!551, !410, !564}
!567 = !DISubroutineType(types: !568)
!568 = !{!146, !146}
!569 = !DISubroutineType(types: !570)
!570 = !{!141, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1024, elements: !573)
!573 = !{!564}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !124, line: 19, baseType: !123)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !144}
!579 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 24, elements: !222)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_ext_type", file: !3, line: 601, size: 320, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !582, file: !3, line: 603, baseType: !260, size: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !582, file: !3, line: 604, baseType: !260, size: 128, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !582, file: !3, line: 605, baseType: !581, size: 64, offset: 256)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 1600, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 25)
!590 = !DISubroutineType(types: !591)
!591 = !{!141}
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 34432, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 4304)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !146, !146, !141}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !599, line: 127, baseType: !600)
!599 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !599, line: 127, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !603, line: 22, size: 2240, elements: !604)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !602, file: !603, line: 25, baseType: !196, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !602, file: !603, line: 26, baseType: !180, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !602, file: !603, line: 31, baseType: !177, size: 16, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !602, file: !603, line: 32, baseType: !579, size: 8, offset: 144)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !602, file: !603, line: 33, baseType: !338, size: 2048, offset: 152)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 5216, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 652)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !141, !146, !146}
!615 = !DISubroutineType(types: !616)
!616 = !{!141, !258, !256}
!617 = !DISubroutineType(types: !618)
!618 = !{null, !258, !256}
!619 = !DISubroutineType(types: !620)
!620 = !{!149, !146, !621, !27, !394, !141, !498, !146}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 65536, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 8192)
!626 = !DISubroutineType(types: !627)
!627 = !{!149, !142, !149, !143, !621, !27, !148, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !630, line: 106, baseType: !631)
!630 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !630, line: 94, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 82, size: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !632, file: !630, line: 84, baseType: !27, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !632, file: !630, line: 93, baseType: !636, size: 32, offset: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !630, line: 85, size: 32, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !636, file: !630, line: 88, baseType: !6, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !636, file: !630, line: 92, baseType: !640, size: 32)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 32, elements: !543)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !150, line: 74, baseType: !27)
!642 = !DISubroutineType(types: !643)
!643 = !{!141, !394}
!644 = !DISubroutineType(types: !645)
!645 = !{!143, !146, !141}
!646 = !DISubroutineType(types: !647)
!647 = !{!141, !648, !146}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !250}
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 16, elements: !550)
!654 = !DISubroutineType(types: !655)
!655 = !{!168, !146, !36, !256, !141, !146}
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 168, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 21)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !143, !146, !146}
!661 = !DISubroutineType(types: !662)
!662 = !{!141, !146, !250}
!663 = !DISubroutineType(types: !664)
!664 = !{!141, !27}
!665 = !DISubroutineType(types: !666)
!666 = !{!27, !146, !250, !141}
!667 = !DISubroutineType(types: !668)
!668 = !{!27, !146, !250}
!669 = !DISubroutineType(types: !670)
!670 = !{null, !146, !250, !141}
!671 = !DISubroutineType(types: !672)
!672 = !{!143, !146, !146}
!673 = !DISubroutineType(types: !674)
!674 = !{!27, !675}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !179, line: 80, baseType: !202)
!676 = !DISubroutineType(types: !677)
!677 = !{!27, !146, !151}
!678 = !DISubroutineType(types: !679)
!679 = !{!27, !680}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !179, line: 65, baseType: !204)
!681 = !DISubroutineType(types: !682)
!682 = !{!168, !178}
!683 = !DISubroutineType(types: !684)
!684 = !{null, !146, !141}
!685 = !DISubroutineType(types: !686)
!686 = !{!141, !182}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !688, line: 48, baseType: !689)
!688 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 1600, elements: !298)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !688, line: 34, size: 1600, elements: !691)
!691 = !{!692, !696, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !690, file: !688, line: 40, baseType: !693, size: 512)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !694, line: 31, baseType: !695)
!694 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 512, elements: !532)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !690, file: !688, line: 41, baseType: !27, size: 32, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !690, file: !688, line: 42, baseType: !400, size: 1024, offset: 576)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 3584, elements: !705)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "qsortFunc", file: !3, line: 3585, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!27, !704, !704}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "V", file: !3, line: 3584, baseType: !175)
!705 = !{!530, !551, !551, !551}
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 512, elements: !707)
!707 = !{!551, !551, !551}
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 256, elements: !709)
!709 = !{!551, !551}
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 128, elements: !550)
!711 = !DISubroutineType(types: !712)
!712 = !{!27, !182, !182, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!27, !146, !146}
!716 = !DISubroutineType(types: !717)
!717 = !{!27, !182, !182}
!718 = !DISubroutineType(types: !719)
!719 = !{!149, !182, !149}
!720 = !DISubroutineType(types: !721)
!721 = !{!143, !143, !149, !182}
!722 = !DISubroutineType(types: !723)
!723 = !{!149, !182, !141, !498, !149}
!724 = !DISubroutineType(types: !725)
!725 = !{!394, !182, !141}
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 320, elements: !539)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!728 = !DISubroutineType(types: !729)
!729 = !{!141, !141, !226, !36}
!730 = !DISubroutineType(types: !731)
!731 = !{!144, !141, !226, !36}
!732 = !DISubroutineType(types: !733)
!733 = !{null, !144}
!734 = !DISubroutineType(types: !735)
!735 = !{!149, !182}
!736 = !DISubroutineType(types: !737)
!737 = !{!149, !146, !621, !27}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "column_info", file: !3, line: 937, size: 192, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "valid_len", scope: !740, file: !3, line: 939, baseType: !141, size: 8)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "line_len", scope: !740, file: !3, line: 940, baseType: !149, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "col_arr", scope: !740, file: !3, line: 941, baseType: !148, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!149, !141}
!748 = !DISubroutineType(types: !749)
!749 = !{null, !149, !149}
!750 = !DISubroutineType(types: !751)
!751 = !{null, !182}
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !409)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 29144, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 3643)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 88, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 11)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !675, !27, !141}
!761 = !DISubroutineType(types: !762)
!762 = !{null, !680, !27, !141}
!763 = !DISubroutineType(types: !764)
!764 = !{null, !146, !151, !27}
!765 = !DISubroutineType(types: !766)
!766 = !{!149, !143, !149, !141, !767, !246, !27}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !163, line: 133, size: 448, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !769, file: !163, line: 135, baseType: !27, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !769, file: !163, line: 136, baseType: !27, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !769, file: !163, line: 137, baseType: !27, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !769, file: !163, line: 138, baseType: !27, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !769, file: !163, line: 139, baseType: !27, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !769, file: !163, line: 140, baseType: !27, size: 32, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !769, file: !163, line: 141, baseType: !27, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !769, file: !163, line: 142, baseType: !27, size: 32, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !769, file: !163, line: 143, baseType: !27, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !769, file: !163, line: 146, baseType: !166, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !769, file: !163, line: 147, baseType: !146, size: 64, offset: 384)
!782 = !DISubroutineType(types: !783)
!783 = !{!27}
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8008, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 1001)
!787 = !DISubroutineType(types: !788)
!788 = !{!143, !162, !143}
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 896, elements: !529)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !793, file: !792, line: 633, size: 128, elements: !794)
!792 = !DIFile(filename: "src/system.h", directory: "/home/mohamad/clone/coreutils")
!793 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !792, file: !792, line: 631, type: !558, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !791, file: !792, line: 633, baseType: !146, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !791, file: !792, line: 633, baseType: !146, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!798 = !{!799, !801, !803, !805, !807, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !847, !849, !851, !853, !0, !855, !857, !859, !861, !863, !865, !867, !869, !872, !874, !878, !880, !882, !884, !886, !888, !890, !892, !894, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !926, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !953, !955, !957, !959, !962, !964, !966, !968, !970, !972, !974, !976, !978, !980, !982, !984, !986, !988, !990, !993, !996, !999, !1001, !1003, !1005, !1008, !1011, !1013, !1015}
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 319, type: !242, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 330, type: !250, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 333, type: !149, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 336, type: !149, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 355, type: !141, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 357, type: !146, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 378, type: !235, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 383, type: !213, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 385, type: !141, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 428, type: !5, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 481, type: !26, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 510, type: !141, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 525, type: !141, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 542, type: !20, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 559, type: !141, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !2, file: !3, line: 561, type: !141, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !2, file: !3, line: 645, type: !141, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 654, type: !13, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 659, type: !141, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 664, type: !141, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 668, type: !141, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 715, type: !323, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 724, type: !141, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 733, type: !246, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 738, type: !141, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 743, type: !141, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 792, type: !315, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 796, type: !315, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 960, type: !149, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 981, type: !345, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 988, type: !345, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 1002, type: !345, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "RFC3986", scope: !2, file: !3, line: 1083, type: !338, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 567, type: !141, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 608, type: !259, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "sig", scope: !871, file: !3, line: 1358, type: !407, isLocal: true, isDefinition: true)
!871 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1355, type: !396, scopeLine: 1356, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 788, type: !398, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !876, file: !3, line: 2181, type: !877, isLocal: true, isDefinition: true)
!876 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1688, type: !233, scopeLine: 1689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 56, elements: !529)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 711, type: !141, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 464, type: !79, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 489, type: !141, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 506, type: !141, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 649, type: !141, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 683, type: !85, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 696, type: !499, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 700, type: !499, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 729, type: !149, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 720, type: !149, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 839, type: !504, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 493, type: !141, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 513, type: !27, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 519, type: !27, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 516, type: !168, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 520, type: !168, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 501, type: !141, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 497, type: !141, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 905, type: !516, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 901, type: !520, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 915, type: !525, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 911, type: !520, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 894, type: !527, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 889, type: !531, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "when_types", scope: !2, file: !3, line: 928, type: !534, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "when_args", scope: !2, file: !3, line: 921, type: !538, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 549, type: !541, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 545, type: !545, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 948, type: !149, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 343, type: !141, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 716, type: !323, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 756, type: !549, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 441, type: !545, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 445, type: !553, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1107, type: !565, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1111, type: !141, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !952, line: 1, type: !592, isLocal: true, isDefinition: true)
!952 = !DIFile(filename: "src/dircolors.h", directory: "/home/mohamad/clone/coreutils")
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "color_buf", scope: !2, file: !3, line: 640, type: !143, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "color_ext_list", scope: !2, file: !3, line: 637, type: !581, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "indicator_name", scope: !2, file: !3, line: 594, type: !587, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "first", scope: !961, file: !3, line: 2725, type: !141, isLocal: true, isDefinition: true)
!961 = distinct !DISubprogram(name: "print_dir", scope: !3, file: !3, line: 2720, type: !595, scopeLine: 2721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "cwd_some_quoted", scope: !2, file: !3, line: 339, type: !141, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "sorted_file", scope: !2, file: !3, line: 347, type: !650, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "UNKNOWN_SECURITY_CONTEXT", scope: !2, file: !3, line: 386, type: !653, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "any_has_acl", scope: !2, file: !3, line: 391, type: !141, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "inode_number_width", scope: !2, file: !3, line: 397, type: !27, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "block_size_width", scope: !2, file: !3, line: 398, type: !27, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "nlink_width", scope: !2, file: !3, line: 399, type: !27, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "owner_width", scope: !2, file: !3, line: 401, type: !27, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "group_width", scope: !2, file: !3, line: 402, type: !27, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "author_width", scope: !2, file: !3, line: 403, type: !27, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "scontext_width", scope: !2, file: !3, line: 400, type: !27, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "major_device_number_width", scope: !2, file: !3, line: 404, type: !27, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "minor_device_number_width", scope: !2, file: !3, line: 405, type: !27, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "file_size_width", scope: !2, file: !3, line: 406, type: !27, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !992, file: !3, line: 3084, type: !258, isLocal: true, isDefinition: true)
!992 = distinct !DISubprogram(name: "has_capability_cache", scope: !3, file: !3, line: 3080, type: !661, scopeLine: 3081, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !995, file: !3, line: 3029, type: !258, isLocal: true, isDefinition: true)
!995 = distinct !DISubprogram(name: "getfilecon_cache", scope: !3, file: !3, line: 3025, type: !665, scopeLine: 3026, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !998, file: !3, line: 3059, type: !258, isLocal: true, isDefinition: true)
!998 = distinct !DISubprogram(name: "file_has_acl_cache", scope: !3, file: !3, line: 3055, type: !667, scopeLine: 3056, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "sorted_file_alloc", scope: !2, file: !3, line: 348, type: !149, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "failed_strcoll", scope: !2, file: !3, line: 3564, type: !687, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "sort_functions", scope: !2, file: !3, line: 3741, type: !698, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "filetype_indicator", scope: !1007, file: !3, line: 4710, type: !726, isLocal: true, isDefinition: true)
!1007 = distinct !DISubprogram(name: "get_color_indicator", scope: !3, file: !3, line: 4682, type: !724, scopeLine: 4683, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "column_info_alloc", scope: !1010, file: !3, line: 5015, type: !149, isLocal: true, isDefinition: true)
!1010 = distinct !DISubprogram(name: "init_column_info", scope: !3, file: !3, line: 5009, type: !336, scopeLine: 5010, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "column_info", scope: !2, file: !3, line: 945, type: !745, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "filetype_letter", scope: !2, file: !3, line: 180, type: !756, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "width", scope: !1017, file: !3, line: 3895, type: !27, isLocal: true, isDefinition: true)
!1017 = distinct !DISubprogram(name: "long_time_expected_width", scope: !3, file: !3, line: 3893, type: !782, scopeLine: 3894, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !152)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "ls_mode", scope: !1020, file: !1021, line: 2, type: !27, isLocal: false, isDefinition: true)
!1020 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1021, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !783, globals: !1022, nameTableKind: None)
!1021 = !DIFile(filename: "src/ls-ls.c", directory: "/home/mohamad/clone/coreutils")
!1022 = !{!1018}
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "Version", scope: !1025, file: !1026, line: 2, type: !146, isLocal: false, isDefinition: true)
!1025 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1026, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1027, globals: !1028, nameTableKind: None)
!1026 = !DIFile(filename: "src/version.c", directory: "/home/mohamad/clone/coreutils")
!1027 = !{!146}
!1028 = !{!1023}
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1031, file: !1083, line: 67, type: !523, isLocal: false, isDefinition: true)
!1031 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1032, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1033, globals: !1082, nameTableKind: None)
!1032 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/mohamad/clone/coreutils")
!1033 = !{!167, !146, !523, !1034, !552, !555, !175, !149, !141, !1036, !1038, !1040, !1078, !1080, !336}
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!552, !146, !555, !175, !149}
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !146, !146, !552}
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !555, !175, !149}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 241, size: 1728, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1041, file: !268, line: 242, baseType: !27, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1041, file: !268, line: 247, baseType: !143, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1041, file: !268, line: 248, baseType: !143, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1041, file: !268, line: 249, baseType: !143, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1041, file: !268, line: 250, baseType: !143, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1041, file: !268, line: 251, baseType: !143, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1041, file: !268, line: 252, baseType: !143, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1041, file: !268, line: 253, baseType: !143, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1041, file: !268, line: 254, baseType: !143, size: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1041, file: !268, line: 256, baseType: !143, size: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1041, file: !268, line: 257, baseType: !143, size: 64, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1041, file: !268, line: 258, baseType: !143, size: 64, offset: 704)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1041, file: !268, line: 260, baseType: !1056, size: 64, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !268, line: 156, size: 192, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1057, file: !268, line: 157, baseType: !1056, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1057, file: !268, line: 158, baseType: !1040, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1057, file: !268, line: 162, baseType: !27, size: 32, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1041, file: !268, line: 262, baseType: !1040, size: 64, offset: 832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1041, file: !268, line: 264, baseType: !27, size: 32, offset: 896)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1041, file: !268, line: 268, baseType: !27, size: 32, offset: 928)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1041, file: !268, line: 270, baseType: !180, size: 64, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1041, file: !268, line: 274, baseType: !177, size: 16, offset: 1024)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1041, file: !268, line: 275, baseType: !295, size: 8, offset: 1040)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1041, file: !268, line: 276, baseType: !297, size: 8, offset: 1048)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1041, file: !268, line: 280, baseType: !301, size: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1041, file: !268, line: 289, baseType: !304, size: 64, offset: 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1041, file: !268, line: 297, baseType: !167, size: 64, offset: 1216)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1041, file: !268, line: 298, baseType: !167, size: 64, offset: 1280)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1041, file: !268, line: 299, baseType: !167, size: 64, offset: 1344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1041, file: !268, line: 300, baseType: !167, size: 64, offset: 1408)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1041, file: !268, line: 302, baseType: !149, size: 64, offset: 1472)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1041, file: !268, line: 303, baseType: !27, size: 32, offset: 1536)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1041, file: !268, line: 305, baseType: !312, size: 160, offset: 1568)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!552, !146, !146, !555, !175, !149, !523}
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!146, !175, !555, !175, !149}
!1082 = !{!1029}
!1083 = !DIFile(filename: "lib/argmatch.c", directory: "/home/mohamad/clone/coreutils")
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "file_name", scope: !1086, file: !1130, line: 46, type: !146, isLocal: true, isDefinition: true)
!1086 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1087, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1088, globals: !1127, nameTableKind: None)
!1087 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!1088 = !{!558, !146, !396, !141, !336, !1089, !27, !325}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 241, size: 1728, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1090, file: !268, line: 242, baseType: !27, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1090, file: !268, line: 247, baseType: !143, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1090, file: !268, line: 248, baseType: !143, size: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1090, file: !268, line: 249, baseType: !143, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1090, file: !268, line: 250, baseType: !143, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1090, file: !268, line: 251, baseType: !143, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1090, file: !268, line: 252, baseType: !143, size: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1090, file: !268, line: 253, baseType: !143, size: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1090, file: !268, line: 254, baseType: !143, size: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1090, file: !268, line: 256, baseType: !143, size: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1090, file: !268, line: 257, baseType: !143, size: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1090, file: !268, line: 258, baseType: !143, size: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1090, file: !268, line: 260, baseType: !1105, size: 64, offset: 768)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !268, line: 156, size: 192, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1106, file: !268, line: 157, baseType: !1105, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1106, file: !268, line: 158, baseType: !1089, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1106, file: !268, line: 162, baseType: !27, size: 32, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1090, file: !268, line: 262, baseType: !1089, size: 64, offset: 832)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1090, file: !268, line: 264, baseType: !27, size: 32, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1090, file: !268, line: 268, baseType: !27, size: 32, offset: 928)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1090, file: !268, line: 270, baseType: !180, size: 64, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1090, file: !268, line: 274, baseType: !177, size: 16, offset: 1024)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1090, file: !268, line: 275, baseType: !295, size: 8, offset: 1040)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1090, file: !268, line: 276, baseType: !297, size: 8, offset: 1048)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1090, file: !268, line: 280, baseType: !301, size: 64, offset: 1088)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1090, file: !268, line: 289, baseType: !304, size: 64, offset: 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1090, file: !268, line: 297, baseType: !167, size: 64, offset: 1216)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1090, file: !268, line: 298, baseType: !167, size: 64, offset: 1280)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1090, file: !268, line: 299, baseType: !167, size: 64, offset: 1344)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1090, file: !268, line: 300, baseType: !167, size: 64, offset: 1408)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1090, file: !268, line: 302, baseType: !149, size: 64, offset: 1472)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1090, file: !268, line: 303, baseType: !27, size: 32, offset: 1536)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1090, file: !268, line: 305, baseType: !312, size: 160, offset: 1568)
!1127 = !{!1084, !1128}
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1086, file: !1130, line: 56, type: !141, isLocal: true, isDefinition: true)
!1130 = !DIFile(filename: "lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1133, file: !1137, line: 24, type: !325, isLocal: false, isDefinition: true)
!1133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1134, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1135, globals: !1136, nameTableKind: None)
!1134 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!1135 = !{!325}
!1136 = !{!1131}
!1137 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1140, file: !1149, line: 130, type: !1165, isLocal: true, isDefinition: true)
!1140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1141, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !1142, globals: !1276, nameTableKind: None)
!1141 = !DIFile(filename: "./lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!1142 = !{!151, !167, !149, !1143, !1145, !1146, !1158, !1152, !1184, !141, !1186, !1188, !1229, !175, !1179, !1231, !1233, !650, !1235, !1237, !1241, !146, !579, !147, !1243, !1245, !1165, !1246, !1248, !1164, !1176, !1182, !1147, !1249, !1251, !1253, !27, !181, !1170, !1255, !1257, !328, !332, !1259, !1261, !1263, !1265, !1267, !1269, !1271, !1273, !1274}
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!149, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !244, line: 69, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1149, line: 52, size: 640, elements: !1150)
!1149 = !DIFile(filename: "lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!1150 = !{!1151, !1157, !1160, !1161, !1162, !1163, !1175, !1178, !1181, !1183}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !1148, file: !1149, line: 57, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !1149, line: 46, size: 128, elements: !1154)
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !1149, line: 48, baseType: !167, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !1149, line: 49, baseType: !1152, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !1148, file: !1149, line: 58, baseType: !1158, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1148, file: !1149, line: 59, baseType: !149, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !1148, file: !1149, line: 60, baseType: !149, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !1148, file: !1149, line: 61, baseType: !149, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !1148, file: !1149, line: 64, baseType: !1164, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !244, line: 65, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !244, line: 53, size: 160, elements: !1168)
!1168 = !{!1169, !1171, !1172, !1173, !1174}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1167, file: !244, line: 58, baseType: !1170, size: 32)
!1170 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1167, file: !244, line: 59, baseType: !1170, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1167, file: !244, line: 60, baseType: !1170, size: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1167, file: !244, line: 61, baseType: !1170, size: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1167, file: !244, line: 62, baseType: !141, size: 8, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !1148, file: !1149, line: 71, baseType: !1176, size: 64, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !244, line: 48, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !1148, file: !1149, line: 72, baseType: !1179, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !244, line: 49, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
