; ModuleID = 'mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "software/llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 56, type: !121, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !112, globals: !236, nameTableKind: None)
!66 = !DIFile(filename: "src/mv.c", directory: "/home/mbarbar/clone/coreutils")
!67 = !{!68, !76, !83, !89, !95, !100, !106}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !69, line: 30, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mbarbar/clone/coreutils")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !77, line: 69, baseType: !70, size: 32, elements: !78)
!77 = !DIFile(filename: "src/copy.h", directory: "/home/mbarbar/clone/coreutils")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !77, line: 60, baseType: !70, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !77, line: 26, baseType: !70, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !77, line: 47, baseType: !70, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !101, line: 23, baseType: !70, size: 32, elements: !102)
!101 = !DIFile(filename: "src/remove.h", directory: "/home/mbarbar/clone/coreutils")
!102 = !{!103, !104, !105}
!103 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !101, line: 78, baseType: !70, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!110 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!112 = !{!9, !53, !113, !0, !115, !117, !7, !120, !119, !121, !133, !134, !136, !138, !149, !150, !160, !195, !200, !202, !206, !208, !211, !222}
!113 = !DISubroutineType(types: !114)
!114 = !{null, !7}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!117 = !DISubroutineType(types: !118)
!118 = !{!7, !7, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 3584, elements: !131)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !124, line: 50, size: 256, elements: !125)
!124 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 52, baseType: !115, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !123, file: !124, line: 55, baseType: !7, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !124, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !124, line: 57, baseType: !7, size: 32, offset: 192)
!131 = !{!132}
!132 = !DISubrange(count: 14)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !70)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DISubroutineType(types: !137)
!137 = !{null, !115}
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 896, elements: !147)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !142, file: !141, line: 633, size: 128, elements: !144)
!141 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/clone/coreutils")
!142 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !141, file: !141, line: 631, type: !136, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !143)
!143 = !{}
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !140, file: !141, line: 633, baseType: !115, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !141, line: 633, baseType: !115, size: 64, offset: 64)
!147 = !{!148}
!148 = !DISubrange(count: 7)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !199}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !153, file: !77, line: 100, baseType: !68, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !153, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !153, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !153, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !153, file: !77, line: 115, baseType: !160, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !161, line: 69, baseType: !133)
!161 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !153, file: !77, line: 119, baseType: !120, size: 8, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !153, file: !77, line: 123, baseType: !120, size: 8, offset: 168)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !153, file: !77, line: 130, baseType: !120, size: 8, offset: 176)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !153, file: !77, line: 134, baseType: !120, size: 8, offset: 184)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !153, file: !77, line: 138, baseType: !120, size: 8, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !153, file: !77, line: 141, baseType: !120, size: 8, offset: 200)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !153, file: !77, line: 145, baseType: !120, size: 8, offset: 208)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !153, file: !77, line: 152, baseType: !120, size: 8, offset: 216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !153, file: !77, line: 156, baseType: !120, size: 8, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !153, file: !77, line: 160, baseType: !120, size: 8, offset: 232)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !153, file: !77, line: 161, baseType: !120, size: 8, offset: 240)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !153, file: !77, line: 162, baseType: !120, size: 8, offset: 248)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !153, file: !77, line: 163, baseType: !120, size: 8, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !153, file: !77, line: 166, baseType: !120, size: 8, offset: 264)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !153, file: !77, line: 178, baseType: !120, size: 8, offset: 272)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !153, file: !77, line: 182, baseType: !120, size: 8, offset: 280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !153, file: !77, line: 188, baseType: !120, size: 8, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !153, file: !77, line: 192, baseType: !120, size: 8, offset: 296)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !153, file: !77, line: 201, baseType: !120, size: 8, offset: 304)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !153, file: !77, line: 205, baseType: !120, size: 8, offset: 312)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !153, file: !77, line: 214, baseType: !120, size: 8, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !153, file: !77, line: 223, baseType: !120, size: 8, offset: 328)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !153, file: !77, line: 227, baseType: !120, size: 8, offset: 336)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !153, file: !77, line: 231, baseType: !120, size: 8, offset: 344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !153, file: !77, line: 235, baseType: !120, size: 8, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !153, file: !77, line: 239, baseType: !120, size: 8, offset: 360)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !153, file: !77, line: 242, baseType: !120, size: 8, offset: 368)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !153, file: !77, line: 245, baseType: !120, size: 8, offset: 376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !153, file: !77, line: 250, baseType: !120, size: 8, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !153, file: !77, line: 254, baseType: !120, size: 8, offset: 392)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !153, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !153, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !153, file: !77, line: 273, baseType: !195, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !197, line: 69, baseType: !198)
!197 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/clone/coreutils")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !197, line: 67, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !153, file: !77, line: 276, baseType: !195, size: 64, offset: 576)
!200 = !DISubroutineType(types: !201)
!201 = !{!120, !115}
!202 = !DISubroutineType(types: !203)
!203 = !{!120, !9, !9, !120, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!206 = !DISubroutineType(types: !207)
!207 = !{!120, !115, !115, !204}
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !101, line: 32, size: 256, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !232, !233, !234, !235}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !214, file: !101, line: 35, baseType: !120, size: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !214, file: !101, line: 38, baseType: !100, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !214, file: !101, line: 47, baseType: !120, size: 8, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !214, file: !101, line: 50, baseType: !120, size: 8, offset: 72)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !214, file: !101, line: 53, baseType: !120, size: 8, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !214, file: !101, line: 57, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !224, line: 7, size: 128, elements: !225)
!224 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mbarbar/clone/coreutils")
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !223, file: !224, line: 9, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !161, line: 47, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !223, file: !224, line: 10, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !161, line: 59, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !214, file: !101, line: 61, baseType: !120, size: 8, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !214, file: !101, line: 64, baseType: !120, size: 8, offset: 200)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !214, file: !101, line: 67, baseType: !120, size: 8, offset: 208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !214, file: !101, line: 75, baseType: !120, size: 8, offset: 216)
!236 = !{!237, !63, !239}
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !65, file: !66, line: 54, type: !120, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !241, file: !66, line: 96, type: !223, isLocal: true, isDefinition: true)
!241 = distinct !DISubprogram(name: "rm_option_init", scope: !66, file: !66, line: 75, type: !211, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !143)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !244, file: !245, line: 147, type: !115, isLocal: true, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !246, retainedTypes: !247, globals: !512, nameTableKind: None)
!245 = !DIFile(filename: "src/copy.c", directory: "/home/mbarbar/clone/coreutils")
!246 = !{!68, !76, !83, !89, !95}
!247 = !{!160, !53, !70, !9, !57, !55, !248, !250, !120, !7, !295, !297, !195, !300, !115, !303, !305, !307, !309, !311, !313, !133, !231, !228, !323, !356, !350, !227, !230, !116, !29, !326, !328, !357, !358, !360, !362, !315, !364, !366, !368, !370, !373, !200, !10, !407, !409, !411, !415, !417, !333, !419, !421, !423, !335, !425, !429, !431, !438, !450, !452, !454, !456, !462, !464, !466, !468, !467, !469, !134, !471, !475, !477, !478, !479, !481, !497, !493, !508, !510}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !249, line: 63, baseType: !29)
!249 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!250 = !DISubroutineType(types: !251)
!251 = !{!120, !115, !115, !160, !120, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !254, file: !77, line: 100, baseType: !68, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !254, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !254, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !254, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !254, file: !77, line: 115, baseType: !160, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !254, file: !77, line: 119, baseType: !120, size: 8, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !254, file: !77, line: 123, baseType: !120, size: 8, offset: 168)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !254, file: !77, line: 130, baseType: !120, size: 8, offset: 176)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !254, file: !77, line: 134, baseType: !120, size: 8, offset: 184)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !254, file: !77, line: 138, baseType: !120, size: 8, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !254, file: !77, line: 141, baseType: !120, size: 8, offset: 200)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !254, file: !77, line: 145, baseType: !120, size: 8, offset: 208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !254, file: !77, line: 152, baseType: !120, size: 8, offset: 216)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !254, file: !77, line: 156, baseType: !120, size: 8, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !254, file: !77, line: 160, baseType: !120, size: 8, offset: 232)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !254, file: !77, line: 161, baseType: !120, size: 8, offset: 240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !254, file: !77, line: 162, baseType: !120, size: 8, offset: 248)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !254, file: !77, line: 163, baseType: !120, size: 8, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !254, file: !77, line: 166, baseType: !120, size: 8, offset: 264)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !254, file: !77, line: 178, baseType: !120, size: 8, offset: 272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !254, file: !77, line: 182, baseType: !120, size: 8, offset: 280)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !254, file: !77, line: 188, baseType: !120, size: 8, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !254, file: !77, line: 192, baseType: !120, size: 8, offset: 296)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !254, file: !77, line: 201, baseType: !120, size: 8, offset: 304)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !254, file: !77, line: 205, baseType: !120, size: 8, offset: 312)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !254, file: !77, line: 214, baseType: !120, size: 8, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !254, file: !77, line: 223, baseType: !120, size: 8, offset: 328)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !254, file: !77, line: 227, baseType: !120, size: 8, offset: 336)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !254, file: !77, line: 231, baseType: !120, size: 8, offset: 344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !254, file: !77, line: 235, baseType: !120, size: 8, offset: 352)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !254, file: !77, line: 239, baseType: !120, size: 8, offset: 360)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !254, file: !77, line: 242, baseType: !120, size: 8, offset: 368)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !254, file: !77, line: 245, baseType: !120, size: 8, offset: 376)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !254, file: !77, line: 250, baseType: !120, size: 8, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !254, file: !77, line: 254, baseType: !120, size: 8, offset: 392)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !254, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !254, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !254, file: !77, line: 273, baseType: !195, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !254, file: !77, line: 276, baseType: !195, size: 64, offset: 576)
!295 = !DISubroutineType(types: !296)
!296 = !{!120, !115, !120, !120, !252}
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!120, !115, !115, !120, !252, !302, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!120, !252}
!305 = !DISubroutineType(types: !306)
!306 = !{!160}
!307 = !DISubroutineType(types: !308)
!308 = !{!120, !7}
!309 = !DISubroutineType(types: !310)
!310 = !{!7, !115, !160}
!311 = !DISubroutineType(types: !312)
!312 = !{!120, !115, !120, !120}
!313 = !DISubroutineType(types: !314)
!314 = !{!120, !115, !115, !120, !315, !350, !252, !120, !302, !302, !302}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !318, line: 46, size: 1152, elements: !319)
!318 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!319 = !{!320, !321, !322, !324, !325, !327, !329, !330, !331, !332, !334, !336, !344, !345, !346}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !317, file: !318, line: 48, baseType: !231, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !317, file: !318, line: 53, baseType: !228, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !317, file: !318, line: 61, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !317, file: !318, line: 62, baseType: !133, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !317, file: !318, line: 64, baseType: !326, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !70)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !317, file: !318, line: 65, baseType: !328, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !70)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !317, file: !318, line: 67, baseType: !7, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !317, file: !318, line: 69, baseType: !231, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !317, file: !318, line: 74, baseType: !29, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !317, file: !318, line: 78, baseType: !333, size: 64, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !317, file: !318, line: 80, baseType: !335, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !317, file: !318, line: 91, baseType: !337, size: 128, offset: 576)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !338, line: 9, size: 128, elements: !339)
!338 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !337, file: !338, line: 11, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !337, file: !338, line: 12, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !317, file: !318, line: 92, baseType: !337, size: 128, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !317, file: !318, line: 93, baseType: !337, size: 128, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !317, file: !318, line: 106, baseType: !347, size: 192, offset: 960)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 3)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !245, line: 125, size: 192, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !351, file: !245, line: 127, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !351, file: !245, line: 128, baseType: !227, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !351, file: !245, line: 129, baseType: !230, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 256, elements: !209)
!358 = !DISubroutineType(types: !359)
!359 = !{!7, !7, !115, !356, !7}
!360 = !DISubroutineType(types: !361)
!361 = !{!120, !252, !120}
!362 = !DISubroutineType(types: !363)
!363 = !{!120, !115, !315, !115, !315, !252, !302}
!364 = !DISubroutineType(types: !365)
!365 = !{!120, !115, !115, !120, !120, !120}
!366 = !DISubroutineType(types: !367)
!367 = !{!120, !252, !115, !315}
!368 = !DISubroutineType(types: !369)
!369 = !{!120, !115, !160}
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 12)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !375, file: !4, line: 51, baseType: !7, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !375, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !375, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !375, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !375, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !375, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !375, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !375, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !375, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !375, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !375, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !375, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !375, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !375, file: !4, line: 70, baseType: !391, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !375, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !375, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !375, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !375, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !375, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !375, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !375, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !375, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !375, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !375, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !375, file: !4, line: 93, baseType: !391, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !375, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !375, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !375, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !375, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!407 = !DISubroutineType(types: !408)
!408 = !{!120, !115, !315, !115}
!409 = !DISubroutineType(types: !410)
!410 = !{null, !115, !115, !115}
!411 = !DISubroutineType(types: !412)
!412 = !{!120, !315, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!415 = !DISubroutineType(types: !416)
!416 = !{!120, !115, !115, !120, !315, !350, !252, !302, !302}
!417 = !DISubroutineType(types: !418)
!418 = !{!120, !115, !115, !252, !160, !160, !302, !315}
!419 = !DISubroutineType(types: !420)
!420 = !{!7, !7, !7}
!421 = !DISubroutineType(types: !422)
!422 = !{!55, !317}
!423 = !DISubroutineType(types: !424)
!424 = !{!120, !315}
!425 = !DISubroutineType(types: !426)
!426 = !{!53, !427, !55}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!429 = !DISubroutineType(types: !430)
!430 = !{!120, !7, !7, !9, !55, !55, !248, !89, !115, !115, !302}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !433, line: 23, size: 192, elements: !434)
!433 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mbarbar/clone/coreutils")
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !432, file: !433, line: 26, baseType: !248, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !432, file: !433, line: 29, baseType: !248, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !432, file: !433, line: 32, baseType: !70, size: 32, offset: 128)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !433, line: 36, size: 384, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !441, file: !433, line: 39, baseType: !7, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !441, file: !433, line: 42, baseType: !248, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !441, file: !433, line: 45, baseType: !70, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !441, file: !433, line: 48, baseType: !55, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !441, file: !433, line: 52, baseType: !120, size: 8, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !441, file: !433, line: 55, baseType: !120, size: 8, offset: 264)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !441, file: !433, line: 58, baseType: !431, size: 64, offset: 320)
!450 = !DISubroutineType(types: !451)
!451 = !{!120, !7, !115, !120, !248}
!452 = !DISubroutineType(types: !453)
!453 = !{!120, !7, !248}
!454 = !DISubroutineType(types: !455)
!455 = !{!7, !7, !248, !248}
!456 = !DISubroutineType(types: !457)
!457 = !{!120, !7, !7, !9, !55, !55, !120, !115, !115, !458, !461, !302}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !459, line: 102, baseType: !460)
!459 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !249, line: 77, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!464 = !DISubroutineType(types: !465)
!465 = !{!120, !427, !55}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!469 = !DISubroutineType(types: !470)
!470 = !{!7, !7, !115, !160}
!471 = !DISubroutineType(types: !472)
!472 = !{!7, !115, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!475 = !DISubroutineType(types: !476)
!476 = !{!7, !252, !115, !7, !315, !120, !315}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !161, line: 79, baseType: !326)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !161, line: 64, baseType: !328)
!479 = !DISubroutineType(types: !480)
!480 = !{!120, !115, !7, !115, !7, !252}
!481 = !DISubroutineType(types: !482)
!482 = !{null, !483, !115}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !485, line: 25, size: 192, elements: !486)
!485 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!486 = !{!487, !491, !495}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !484, file: !485, line: 27, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !483, !115, null}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !484, file: !485, line: 30, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!115, !483, !115}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !484, file: !485, line: 33, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !249, line: 52, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !499, line: 32, baseType: !500)
!499 = !DIFile(filename: "software/llvm9/build/lib/clang/9.0.0/include/stdarg.h", directory: "/home/mbarbar")
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !245, line: 659, baseType: !501)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 192, elements: !38)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !245, line: 659, size: 192, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !502, file: !245, line: 659, baseType: !70, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !502, file: !245, line: 659, baseType: !70, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !502, file: !245, line: 659, baseType: !53, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !502, file: !245, line: 659, baseType: !53, size: 64, offset: 128)
!508 = !DISubroutineType(types: !509)
!509 = !{!7, !115, !483}
!510 = !DISubroutineType(types: !511)
!511 = !{null, !115, !7, !315}
!512 = !{!513, !242, !516, !518, !521, !523}
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "mask", scope: !515, file: !245, line: 3089, type: !160, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "cached_umask", scope: !245, file: !245, line: 3087, type: !305, scopeLine: 3088, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !244, retainedNodes: !143)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !244, file: !245, line: 148, type: !115, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "zeros", scope: !520, file: !245, line: 387, type: !9, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "write_zeros", scope: !245, file: !245, line: 385, type: !452, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !244, retainedNodes: !143)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "nz", scope: !520, file: !245, line: 388, type: !55, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "fallback", scope: !520, file: !245, line: 395, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 1024)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !530, file: !531, line: 45, type: !195, isLocal: true, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !532, globals: !553, nameTableKind: None)
!531 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mbarbar/clone/coreutils")
!532 = !{!53, !9, !458, !533, !535, !227, !230, !195, !541, !543, !545, !134, !547, !549, !551}
!533 = !DISubroutineType(types: !534)
!534 = !{null, !227, !230}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !531, line: 33, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !536, file: !531, line: 35, baseType: !227, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !536, file: !531, line: 36, baseType: !230, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !536, file: !531, line: 40, baseType: !9, size: 64, offset: 128)
!541 = !DISubroutineType(types: !542)
!542 = !{!9, !227, !230}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!545 = !DISubroutineType(types: !546)
!546 = !{!9, !115, !227, !230}
!547 = !DISubroutineType(types: !548)
!548 = !{null, !53}
!549 = !DISubroutineType(types: !550)
!550 = !{!55, !427, !55}
!551 = !DISubroutineType(types: !552)
!552 = !{!120, !427, !427}
!553 = !{!528}
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !556, file: !557, line: 38, type: !569, isLocal: true, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !558, globals: !586, nameTableKind: None)
!557 = !DIFile(filename: "src/force-link.c", directory: "/home/mbarbar/clone/coreutils")
!558 = !{!559, !7, !561, !9, !564, !566, !568, !55, !569, !572, !574, !115, !581}
!559 = !DISubroutineType(types: !560)
!560 = !{!7, !7, !115, !7, !115, !7, !120, !7}
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 256)
!564 = !DISubroutineType(types: !565)
!565 = !{!7, !115, !7, !115, !120, !7}
!566 = !DISubroutineType(types: !567)
!567 = !{!9, !115, !9}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 72, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 9)
!572 = !DISubroutineType(types: !573)
!573 = !{!7, !9, !53}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !557, line: 71, size: 192, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !575, file: !557, line: 73, baseType: !7, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !575, file: !557, line: 74, baseType: !115, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !575, file: !557, line: 75, baseType: !7, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !575, file: !557, line: 76, baseType: !7, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !557, line: 131, size: 128, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !582, file: !557, line: 133, baseType: !115, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !582, file: !557, line: 134, baseType: !7, size: 32, offset: 64)
!586 = !{!554}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "Version", scope: !589, file: !590, line: 2, type: !115, isLocal: false, isDefinition: true)
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !591, globals: !592, nameTableKind: None)
!590 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/clone/coreutils")
!591 = !{!115}
!592 = !{!587}
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !595, file: !599, line: 82, type: !115, isLocal: false, isDefinition: true)
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !597, retainedTypes: !605, globals: !629, nameTableKind: None)
!596 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mbarbar/clone/coreutils")
!597 = !{!68, !598}
!598 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !599, line: 172, baseType: !70, size: 32, elements: !600)
!599 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mbarbar/clone/coreutils")
!600 = !{!601, !602, !603, !604}
!601 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!602 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!603 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!604 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!605 = !{!53, !70, !55, !115, !136, !116, !606, !568, !608, !9, !609, !7, !613, !616, !625, !120, !10, !626, !31}
!606 = !DISubroutineType(types: !607)
!607 = !{!9, !7, !115, !68, !120}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !161, line: 108, baseType: !463)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !611, line: 127, baseType: !612)
!611 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !611, line: 127, flags: DIFlagFwdDecl)
!613 = !DISubroutineType(types: !614)
!614 = !{!598, !7, !119, !55, !55, !568, !615, !129}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !618, line: 22, size: 2240, elements: !619)
!618 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!619 = !{!620, !621, !622, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !617, file: !618, line: 25, baseType: !228, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !617, file: !618, line: 26, baseType: !29, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !617, file: !618, line: 31, baseType: !33, size: 16, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !617, file: !618, line: 32, baseType: !468, size: 8, offset: 144)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !617, file: !618, line: 33, baseType: !561, size: 2048, offset: 152)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !209)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !9, !55, !10, !7, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!629 = !{!593}
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "backup_args", scope: !632, file: !652, line: 42, type: !644, isLocal: true, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !635, globals: !649, nameTableKind: None)
!633 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mbarbar/clone/coreutils")
!634 = !{!68}
!635 = !{!427, !636, !9, !638, !116, !640, !644, !646}
!636 = !DISubroutineType(types: !637)
!637 = !{!9, !7, !115, !68}
!638 = !DISubroutineType(types: !639)
!639 = !{!68, !115, !115}
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 256, elements: !642)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!642 = !{!643}
!643 = !DISubrange(count: 8)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 576, elements: !570)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !647, line: 61, baseType: !648)
!647 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/clone/coreutils")
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!649 = !{!650, !630}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "backup_types", scope: !632, file: !652, line: 53, type: !640, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mbarbar/clone/coreutils")
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "file_name", scope: !655, file: !694, line: 37, type: !115, isLocal: true, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !657, globals: !693, nameTableKind: None)
!656 = !DIFile(filename: "./lib/closein.c", directory: "/home/mbarbar/clone/coreutils")
!657 = !{!136, !115, !134, !120, !658, !7, !692}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !660, file: !4, line: 51, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !660, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !660, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !660, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !660, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !660, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !660, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !660, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !660, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !660, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !660, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !660, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !660, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !660, file: !4, line: 70, baseType: !676, size: 64, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !660, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !660, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !660, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !660, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !660, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !660, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !660, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !660, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !660, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !660, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !660, file: !4, line: 93, baseType: !676, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !660, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !660, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !660, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !660, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!692 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!693 = !{!653}
!694 = !DIFile(filename: "lib/closein.c", directory: "/home/mbarbar/clone/coreutils")
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "file_name", scope: !697, file: !739, line: 46, type: !115, isLocal: true, isDefinition: true)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !699, globals: !736, nameTableKind: None)
!698 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/clone/coreutils")
!699 = !{!136, !115, !700, !120, !134, !702, !7, !692}
!700 = !DISubroutineType(types: !701)
!701 = !{null, !120}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !704, file: !4, line: 51, baseType: !7, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !704, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !704, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !704, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !704, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !704, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !704, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !704, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !704, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !704, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !704, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !704, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !704, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !704, file: !4, line: 70, baseType: !720, size: 64, offset: 832)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !704, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !704, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !704, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !704, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !704, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !704, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !704, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !704, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !704, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !704, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !704, file: !4, line: 93, baseType: !720, size: 64, offset: 1344)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !704, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !704, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !704, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !704, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!736 = !{!695, !737}
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !697, file: !739, line: 56, type: !120, isLocal: true, isDefinition: true)
!739 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/clone/coreutils")
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "exit_failure", scope: !742, file: !746, line: 24, type: !692, isLocal: false, isDefinition: true)
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !744, globals: !745, nameTableKind: None)
!743 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/clone/coreutils")
!744 = !{!692}
!745 = !{!740}
!746 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/clone/coreutils")
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "default_tuning", scope: !749, file: !758, line: 130, type: !774, isLocal: true, isDefinition: true)
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !751, globals: !881, nameTableKind: None)
!750 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/clone/coreutils")
!751 = !{!57, !53, !55, !752, !755, !767, !761, !794, !796, !832, !788, !834, !836, !838, !839, !845, !468, !116, !847, !774, !850, !852, !756, !773, !785, !791, !853, !855, !857, !427, !779, !120, !860, !7, !862, !549, !551, !864, !866, !868, !870, !872, !874, !876, !879}
!752 = !DISubroutineType(types: !753)
!753 = !{!55, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !197, line: 69, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !758, line: 52, size: 640, elements: !759)
!758 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/clone/coreutils")
!759 = !{!760, !766, !769, !770, !771, !772, !784, !787, !790, !793}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !757, file: !758, line: 57, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !758, line: 46, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !762, file: !758, line: 48, baseType: !53, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !758, line: 49, baseType: !761, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !757, file: !758, line: 58, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !757, file: !758, line: 59, baseType: !55, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !757, file: !758, line: 60, baseType: !55, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !757, file: !758, line: 61, baseType: !55, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !757, file: !758, line: 64, baseType: !773, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !197, line: 65, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !197, line: 53, size: 160, elements: !777)
!777 = !{!778, !780, !781, !782, !783}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !776, file: !197, line: 58, baseType: !779, size: 32)
!779 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !776, file: !197, line: 59, baseType: !779, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !776, file: !197, line: 60, baseType: !779, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !776, file: !197, line: 61, baseType: !779, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !776, file: !197, line: 62, baseType: !120, size: 8, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !757, file: !758, line: 71, baseType: !785, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !197, line: 48, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !757, file: !758, line: 72, baseType: !788, size: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !197, line: 49, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !757, file: !758, line: 73, baseType: !791, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !197, line: 50, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !757, file: !758, line: 76, baseType: !761, size: 64, offset: 576)
!794 = !DISubroutineType(types: !795)
!795 = !{!120, !754}
!796 = !DISubroutineType(types: !797)
!797 = !{null, !754, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !800, file: !4, line: 51, baseType: !7, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !800, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !800, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !800, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !800, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !800, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !800, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !800, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !800, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !800, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !800, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !800, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !800, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !800, file: !4, line: 70, baseType: !816, size: 64, offset: 832)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !800, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !800, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !800, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !800, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !800, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !800, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !800, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !800, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !800, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !800, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !800, file: !4, line: 93, baseType: !816, size: 64, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !800, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !800, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !800, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !800, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!832 = !DISubroutineType(types: !833)
!833 = !{!53, !754, !427}
!834 = !DISubroutineType(types: !835)
!835 = !{!53, !754}
!836 = !DISubroutineType(types: !837)
!837 = !{!55, !754, !838, !55}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!55, !754, !841, !53}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_processor", file: !197, line: 51, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!120, !53, !53}
!845 = !DISubroutineType(types: !846)
!846 = !{!55, !115, !55}
!847 = !DISubroutineType(types: !848)
!848 = !{null, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !55, !773, !785, !788, !791}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !852}
!855 = !DISubroutineType(types: !856)
!856 = !{!120, !852, !55}
!857 = !DISubroutineType(types: !858)
!858 = !{!7, !852, !427, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!53, !852, !427}
!862 = !DISubroutineType(types: !863)
!863 = !{!761, !754, !427}
!864 = !DISubroutineType(types: !865)
!865 = !{!120, !852}
!866 = !DISubroutineType(types: !867)
!867 = !{!55, !55, !773}
!868 = !DISubroutineType(types: !869)
!869 = !{!55, !55}
!870 = !DISubroutineType(types: !871)
!871 = !{!120, !55}
!872 = !DISubroutineType(types: !873)
!873 = !{!120, !852, !852, !120}
!874 = !DISubroutineType(types: !875)
!875 = !{null, !852, !761}
!876 = !DISubroutineType(types: !877)
!877 = !{!53, !852, !427, !878, !120}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!761, !852}
!881 = !{!747}
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "program_name", scope: !884, file: !922, line: 33, type: !115, isLocal: false, isDefinition: true)
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !886, globals: !921, nameTableKind: None)
!885 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/clone/coreutils")
!886 = !{!53, !9, !115, !136, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !889, file: !4, line: 51, baseType: !7, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !889, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !889, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !889, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !889, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !889, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !889, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !889, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !889, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !889, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !889, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !889, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !889, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !889, file: !4, line: 70, baseType: !905, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !889, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !889, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !889, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !889, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !889, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !889, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !889, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !889, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !889, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !889, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !889, file: !4, line: 93, baseType: !905, size: 64, offset: 1344)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !889, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !889, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !889, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !889, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!921 = !{!882}
!922 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/clone/coreutils")
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !925, file: !954, line: 85, type: !943, isLocal: false, isDefinition: true)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !927, retainedTypes: !942, globals: !1050, nameTableKind: None)
!926 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/clone/coreutils")
!927 = !{!928}
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !929, line: 32, baseType: !70, size: 32, elements: !930)
!929 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mbarbar/clone/coreutils")
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!931 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!932 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!933 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!934 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!935 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!936 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!937 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!938 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!939 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!940 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!941 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!942 = !{!7, !33, !55, !943, !946, !950, !952, !962, !966, !968, !468, !970, !70, !971, !973, !115, !975, !964, !977, !979, !9, !134, !981, !561, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !120, !116, !1026, !1028, !1043, !1024, !1044, !1046, !1048}
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 704, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 11)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 320, elements: !948)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!948 = !{!949}
!949 = !DISubrange(count: 10)
!950 = !DISubroutineType(types: !951)
!951 = !{!952, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !954, line: 65, size: 448, elements: !955)
!954 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mbarbar/clone/coreutils")
!955 = !{!956, !957, !958, !960, !961}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !953, file: !954, line: 68, baseType: !928, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !954, line: 71, baseType: !7, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !953, file: !954, line: 75, baseType: !959, size: 256, offset: 64)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, elements: !642)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !953, file: !954, line: 78, baseType: !115, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !953, file: !954, line: 81, baseType: !115, size: 64, offset: 384)
!962 = !DISubroutineType(types: !963)
!963 = !{!928, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !952, !928}
!968 = !DISubroutineType(types: !969)
!969 = !{!7, !952, !10, !7}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!7, !952, !7}
!973 = !DISubroutineType(types: !974)
!974 = !{null, !952, !115, !115}
!975 = !DISubroutineType(types: !976)
!976 = !{!55, !9, !55, !115, !55, !964}
!977 = !DISubroutineType(types: !978)
!978 = !{!9, !115, !55, !964}
!979 = !DISubroutineType(types: !980)
!980 = !{!9, !115, !55, !628, !964}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !954, line: 834, size: 128, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !982, file: !954, line: 836, baseType: !55, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !982, file: !954, line: 837, baseType: !9, size: 64, offset: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!9, !7, !115}
!988 = !DISubroutineType(types: !989)
!989 = !{!9, !7, !115, !55}
!990 = !DISubroutineType(types: !991)
!991 = !{!9, !115}
!992 = !DISubroutineType(types: !993)
!993 = !{!9, !115, !55}
!994 = !DISubroutineType(types: !995)
!995 = !{!9, !7, !928, !115}
!996 = !DISubroutineType(types: !997)
!997 = !{!9, !7, !928, !115, !55}
!998 = !DISubroutineType(types: !999)
!999 = !{!9, !928, !115}
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!9, !928, !115, !55}
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!9, !115, !55, !10}
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!9, !115, !10}
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!9, !7, !115, !115, !115}
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!9, !7, !115, !115, !115, !55}
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!9, !115, !115, !115}
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!9, !115, !115, !115, !55}
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!115, !7, !115, !55}
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!115, !115, !55}
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!115, !7, !115}
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!115, !115}
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!55, !9, !55, !115, !55, !928, !7, !1024, !115, !115}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1029, line: 6, baseType: !1030)
!1029 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1031, line: 21, baseType: !1032)
!1031 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1031, line: 13, size: 64, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1032, file: !1031, line: 15, baseType: !7, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1032, file: !1031, line: 20, baseType: !1036, size: 32, offset: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1032, file: !1031, line: 16, size: 32, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1036, file: !1031, line: 18, baseType: !70, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1036, file: !1031, line: 19, baseType: !1040, size: 32)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 4)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !56, line: 74, baseType: !7)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!115, !115, !928}
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!9, !7, !115, !55, !964}
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!953, !928}
!1050 = !{!923, !1051, !1053, !1055, !1057, !1059, !1061, !1063}
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !925, file: !954, line: 101, type: !946, isLocal: false, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !925, file: !954, line: 1052, type: !953, isLocal: false, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !925, file: !954, line: 116, type: !953, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "slot0", scope: !925, file: !954, line: 842, type: !561, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(name: "slotvec", scope: !925, file: !954, line: 845, type: !981, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "nslots", scope: !925, file: !954, line: 843, type: !7, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "slotvec0", scope: !925, file: !954, line: 844, type: !982, isLocal: true, isDefinition: true)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !1067, file: !1082, line: 74, type: !1092, isLocal: true, isDefinition: true)
!1067 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1068, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1069, retainedTypes: !1077, globals: !1107, nameTableKind: None)
!1068 = !DIFile(filename: "./lib/savedir.c", directory: "/home/mbarbar/clone/coreutils")
!1069 = !{!1070}
!1070 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !1071, line: 26, baseType: !70, size: 32, elements: !1072)
!1071 = !DIFile(filename: "./lib/savedir.h", directory: "/home/mbarbar/clone/coreutils")
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
