; ModuleID = 'mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 56, type: !121, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !112, globals: !236, nameTableKind: None)
!66 = !DIFile(filename: "src/mv.c", directory: "/home/mbarbar/software/coreutils-8.31")
!67 = !{!68, !76, !83, !89, !95, !100, !106}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !69, line: 30, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mbarbar/software/coreutils-8.31")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !77, line: 69, baseType: !70, size: 32, elements: !78)
!77 = !DIFile(filename: "src/copy.h", directory: "/home/mbarbar/software/coreutils-8.31")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !77, line: 60, baseType: !70, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !77, line: 26, baseType: !70, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !77, line: 47, baseType: !70, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !101, line: 23, baseType: !70, size: 32, elements: !102)
!101 = !DIFile(filename: "src/remove.h", directory: "/home/mbarbar/software/coreutils-8.31")
!102 = !{!103, !104, !105}
!103 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !101, line: 78, baseType: !70, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!110 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!112 = !{!9, !53, !113, !0, !115, !117, !7, !120, !119, !121, !133, !134, !136, !138, !149, !150, !160, !195, !200, !202, !206, !208, !211, !222}
!113 = !DISubroutineType(types: !114)
!114 = !{null, !7}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!117 = !DISubroutineType(types: !118)
!118 = !{!7, !7, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 3584, elements: !131)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !124, line: 50, size: 256, elements: !125)
!124 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 52, baseType: !115, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !123, file: !124, line: 55, baseType: !7, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !124, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !124, line: 57, baseType: !7, size: 32, offset: 192)
!131 = !{!132}
!132 = !DISubrange(count: 14)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !70)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DISubroutineType(types: !137)
!137 = !{null, !115}
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 896, elements: !147)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !142, file: !141, line: 633, size: 128, elements: !144)
!141 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!142 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !141, file: !141, line: 631, type: !136, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !143)
!143 = !{}
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !140, file: !141, line: 633, baseType: !115, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !141, line: 633, baseType: !115, size: 64, offset: 64)
!147 = !{!148}
!148 = !DISubrange(count: 7)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !199}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !153, file: !77, line: 100, baseType: !68, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !153, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !153, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !153, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !153, file: !77, line: 115, baseType: !160, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !161, line: 69, baseType: !133)
!161 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !153, file: !77, line: 119, baseType: !120, size: 8, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !153, file: !77, line: 123, baseType: !120, size: 8, offset: 168)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !153, file: !77, line: 130, baseType: !120, size: 8, offset: 176)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !153, file: !77, line: 134, baseType: !120, size: 8, offset: 184)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !153, file: !77, line: 138, baseType: !120, size: 8, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !153, file: !77, line: 141, baseType: !120, size: 8, offset: 200)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !153, file: !77, line: 145, baseType: !120, size: 8, offset: 208)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !153, file: !77, line: 152, baseType: !120, size: 8, offset: 216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !153, file: !77, line: 156, baseType: !120, size: 8, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !153, file: !77, line: 160, baseType: !120, size: 8, offset: 232)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !153, file: !77, line: 161, baseType: !120, size: 8, offset: 240)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !153, file: !77, line: 162, baseType: !120, size: 8, offset: 248)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !153, file: !77, line: 163, baseType: !120, size: 8, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !153, file: !77, line: 166, baseType: !120, size: 8, offset: 264)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !153, file: !77, line: 178, baseType: !120, size: 8, offset: 272)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !153, file: !77, line: 182, baseType: !120, size: 8, offset: 280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !153, file: !77, line: 188, baseType: !120, size: 8, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !153, file: !77, line: 192, baseType: !120, size: 8, offset: 296)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !153, file: !77, line: 201, baseType: !120, size: 8, offset: 304)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !153, file: !77, line: 205, baseType: !120, size: 8, offset: 312)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !153, file: !77, line: 214, baseType: !120, size: 8, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !153, file: !77, line: 223, baseType: !120, size: 8, offset: 328)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !153, file: !77, line: 227, baseType: !120, size: 8, offset: 336)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !153, file: !77, line: 231, baseType: !120, size: 8, offset: 344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !153, file: !77, line: 235, baseType: !120, size: 8, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !153, file: !77, line: 239, baseType: !120, size: 8, offset: 360)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !153, file: !77, line: 242, baseType: !120, size: 8, offset: 368)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !153, file: !77, line: 245, baseType: !120, size: 8, offset: 376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !153, file: !77, line: 250, baseType: !120, size: 8, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !153, file: !77, line: 254, baseType: !120, size: 8, offset: 392)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !153, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !153, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !153, file: !77, line: 273, baseType: !195, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !197, line: 69, baseType: !198)
!197 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !197, line: 67, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !153, file: !77, line: 276, baseType: !195, size: 64, offset: 576)
!200 = !DISubroutineType(types: !201)
!201 = !{!120, !115}
!202 = !DISubroutineType(types: !203)
!203 = !{!120, !9, !9, !120, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!206 = !DISubroutineType(types: !207)
!207 = !{!120, !115, !115, !204}
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !101, line: 32, size: 256, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !232, !233, !234, !235}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !214, file: !101, line: 35, baseType: !120, size: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !214, file: !101, line: 38, baseType: !100, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !214, file: !101, line: 47, baseType: !120, size: 8, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !214, file: !101, line: 50, baseType: !120, size: 8, offset: 72)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !214, file: !101, line: 53, baseType: !120, size: 8, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !214, file: !101, line: 57, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !224, line: 7, size: 128, elements: !225)
!224 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mbarbar/software/coreutils-8.31")
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !223, file: !224, line: 9, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !161, line: 47, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !223, file: !224, line: 10, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !161, line: 59, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !214, file: !101, line: 61, baseType: !120, size: 8, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !214, file: !101, line: 64, baseType: !120, size: 8, offset: 200)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !214, file: !101, line: 67, baseType: !120, size: 8, offset: 208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !214, file: !101, line: 75, baseType: !120, size: 8, offset: 216)
!236 = !{!237, !63, !239}
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !65, file: !66, line: 54, type: !120, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !241, file: !66, line: 96, type: !223, isLocal: true, isDefinition: true)
!241 = distinct !DISubprogram(name: "rm_option_init", scope: !66, file: !66, line: 75, type: !211, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !143)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !244, file: !245, line: 147, type: !115, isLocal: true, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !246, retainedTypes: !247, globals: !510, nameTableKind: None)
!245 = !DIFile(filename: "src/copy.c", directory: "/home/mbarbar/software/coreutils-8.31")
!246 = !{!68, !76, !83, !89, !95}
!247 = !{!160, !53, !70, !9, !57, !55, !248, !250, !120, !7, !295, !297, !195, !300, !115, !303, !305, !307, !309, !311, !313, !133, !231, !228, !323, !356, !350, !227, !230, !116, !29, !326, !328, !357, !358, !360, !315, !362, !364, !366, !368, !371, !200, !10, !405, !407, !409, !413, !415, !333, !417, !419, !421, !335, !423, !427, !429, !436, !448, !450, !452, !454, !460, !462, !464, !466, !465, !467, !134, !469, !473, !475, !476, !477, !479, !495, !491, !506, !508}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !249, line: 63, baseType: !29)
!249 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!250 = !DISubroutineType(types: !251)
!251 = !{!120, !115, !115, !160, !120, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !77, line: 98, size: 640, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !254, file: !77, line: 100, baseType: !68, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !254, file: !77, line: 103, baseType: !76, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !254, file: !77, line: 108, baseType: !83, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !254, file: !77, line: 111, baseType: !89, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !254, file: !77, line: 115, baseType: !160, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !254, file: !77, line: 119, baseType: !120, size: 8, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !254, file: !77, line: 123, baseType: !120, size: 8, offset: 168)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !254, file: !77, line: 130, baseType: !120, size: 8, offset: 176)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !254, file: !77, line: 134, baseType: !120, size: 8, offset: 184)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !254, file: !77, line: 138, baseType: !120, size: 8, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !254, file: !77, line: 141, baseType: !120, size: 8, offset: 200)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !254, file: !77, line: 145, baseType: !120, size: 8, offset: 208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !254, file: !77, line: 152, baseType: !120, size: 8, offset: 216)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !254, file: !77, line: 156, baseType: !120, size: 8, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !254, file: !77, line: 160, baseType: !120, size: 8, offset: 232)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !254, file: !77, line: 161, baseType: !120, size: 8, offset: 240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !254, file: !77, line: 162, baseType: !120, size: 8, offset: 248)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !254, file: !77, line: 163, baseType: !120, size: 8, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !254, file: !77, line: 166, baseType: !120, size: 8, offset: 264)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !254, file: !77, line: 178, baseType: !120, size: 8, offset: 272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !254, file: !77, line: 182, baseType: !120, size: 8, offset: 280)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !254, file: !77, line: 188, baseType: !120, size: 8, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !254, file: !77, line: 192, baseType: !120, size: 8, offset: 296)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !254, file: !77, line: 201, baseType: !120, size: 8, offset: 304)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !254, file: !77, line: 205, baseType: !120, size: 8, offset: 312)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !254, file: !77, line: 214, baseType: !120, size: 8, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !254, file: !77, line: 223, baseType: !120, size: 8, offset: 328)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !254, file: !77, line: 227, baseType: !120, size: 8, offset: 336)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !254, file: !77, line: 231, baseType: !120, size: 8, offset: 344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !254, file: !77, line: 235, baseType: !120, size: 8, offset: 352)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !254, file: !77, line: 239, baseType: !120, size: 8, offset: 360)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !254, file: !77, line: 242, baseType: !120, size: 8, offset: 368)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !254, file: !77, line: 245, baseType: !120, size: 8, offset: 376)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !254, file: !77, line: 250, baseType: !120, size: 8, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !254, file: !77, line: 254, baseType: !120, size: 8, offset: 392)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !254, file: !77, line: 259, baseType: !7, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !254, file: !77, line: 262, baseType: !95, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !254, file: !77, line: 273, baseType: !195, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !254, file: !77, line: 276, baseType: !195, size: 64, offset: 576)
!295 = !DISubroutineType(types: !296)
!296 = !{!120, !115, !120, !120, !252}
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!120, !115, !115, !120, !252, !302, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!120, !252}
!305 = !DISubroutineType(types: !306)
!306 = !{!160}
!307 = !DISubroutineType(types: !308)
!308 = !{!120, !7}
!309 = !DISubroutineType(types: !310)
!310 = !{!7, !115, !160}
!311 = !DISubroutineType(types: !312)
!312 = !{!120, !115, !120, !120}
!313 = !DISubroutineType(types: !314)
!314 = !{!120, !115, !115, !120, !315, !350, !252, !120, !302, !302, !302}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !318, line: 46, size: 1152, elements: !319)
!318 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!319 = !{!320, !321, !322, !324, !325, !327, !329, !330, !331, !332, !334, !336, !344, !345, !346}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !317, file: !318, line: 48, baseType: !231, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !317, file: !318, line: 53, baseType: !228, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !317, file: !318, line: 61, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !317, file: !318, line: 62, baseType: !133, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !317, file: !318, line: 64, baseType: !326, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !70)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !317, file: !318, line: 65, baseType: !328, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !70)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !317, file: !318, line: 67, baseType: !7, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !317, file: !318, line: 69, baseType: !231, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !317, file: !318, line: 74, baseType: !29, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !317, file: !318, line: 78, baseType: !333, size: 64, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !317, file: !318, line: 80, baseType: !335, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !317, file: !318, line: 91, baseType: !337, size: 128, offset: 576)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !338, line: 9, size: 128, elements: !339)
!338 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !337, file: !338, line: 11, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !337, file: !338, line: 12, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !317, file: !318, line: 92, baseType: !337, size: 128, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !317, file: !318, line: 93, baseType: !337, size: 128, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !317, file: !318, line: 106, baseType: !347, size: 192, offset: 960)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 3)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !245, line: 125, size: 192, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !351, file: !245, line: 127, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !351, file: !245, line: 128, baseType: !227, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !351, file: !245, line: 129, baseType: !230, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 256, elements: !209)
!358 = !DISubroutineType(types: !359)
!359 = !{!120, !252, !120}
!360 = !DISubroutineType(types: !361)
!361 = !{!120, !115, !315, !115, !315, !252, !302}
!362 = !DISubroutineType(types: !363)
!363 = !{!120, !115, !115, !120, !120, !120}
!364 = !DISubroutineType(types: !365)
!365 = !{!120, !252, !115, !315}
!366 = !DISubroutineType(types: !367)
!367 = !{!120, !115, !160}
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 12)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !373, file: !4, line: 51, baseType: !7, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !373, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !373, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !373, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !373, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !373, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !373, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !373, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !373, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !373, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !373, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !373, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !373, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !373, file: !4, line: 70, baseType: !389, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !373, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !373, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !373, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !373, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !373, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !373, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !373, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !373, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !373, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !373, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !373, file: !4, line: 93, baseType: !389, size: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !373, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !373, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !373, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !373, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!405 = !DISubroutineType(types: !406)
!406 = !{!120, !115, !315, !115}
!407 = !DISubroutineType(types: !408)
!408 = !{null, !115, !115, !115}
!409 = !DISubroutineType(types: !410)
!410 = !{!120, !315, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!413 = !DISubroutineType(types: !414)
!414 = !{!120, !115, !115, !120, !315, !350, !252, !302, !302}
!415 = !DISubroutineType(types: !416)
!416 = !{!120, !115, !115, !252, !160, !160, !302, !315}
!417 = !DISubroutineType(types: !418)
!418 = !{!7, !7, !7}
!419 = !DISubroutineType(types: !420)
!420 = !{!55, !317}
!421 = !DISubroutineType(types: !422)
!422 = !{!120, !315}
!423 = !DISubroutineType(types: !424)
!424 = !{!53, !425, !55}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!427 = !DISubroutineType(types: !428)
!428 = !{!120, !7, !7, !9, !55, !55, !248, !89, !115, !115, !302}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !431, line: 23, size: 192, elements: !432)
!431 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mbarbar/software/coreutils-8.31")
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !430, file: !431, line: 26, baseType: !248, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !430, file: !431, line: 29, baseType: !248, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !430, file: !431, line: 32, baseType: !70, size: 32, offset: 128)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !431, line: 36, size: 384, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !439, file: !431, line: 39, baseType: !7, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !439, file: !431, line: 42, baseType: !248, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !439, file: !431, line: 45, baseType: !70, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !439, file: !431, line: 48, baseType: !55, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !439, file: !431, line: 52, baseType: !120, size: 8, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !439, file: !431, line: 55, baseType: !120, size: 8, offset: 264)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !439, file: !431, line: 58, baseType: !429, size: 64, offset: 320)
!448 = !DISubroutineType(types: !449)
!449 = !{!120, !7, !115, !120, !248}
!450 = !DISubroutineType(types: !451)
!451 = !{!120, !7, !248}
!452 = !DISubroutineType(types: !453)
!453 = !{!7, !7, !248, !248}
!454 = !DISubroutineType(types: !455)
!455 = !{!120, !7, !7, !9, !55, !55, !120, !115, !115, !456, !459, !302}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !457, line: 102, baseType: !458)
!457 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !249, line: 77, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!462 = !DISubroutineType(types: !463)
!463 = !{!120, !425, !55}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!467 = !DISubroutineType(types: !468)
!468 = !{!7, !7, !115, !160}
!469 = !DISubroutineType(types: !470)
!470 = !{!7, !115, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!473 = !DISubroutineType(types: !474)
!474 = !{!7, !252, !115, !7, !315, !120, !315}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !161, line: 79, baseType: !326)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !161, line: 64, baseType: !328)
!477 = !DISubroutineType(types: !478)
!478 = !{!120, !115, !7, !115, !7, !252}
!479 = !DISubroutineType(types: !480)
!480 = !{null, !481, !115}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !483, line: 25, size: 192, elements: !484)
!483 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!484 = !{!485, !489, !493}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !482, file: !483, line: 27, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !481, !115, null}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !482, file: !483, line: 30, baseType: !490, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!115, !481, !115}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !482, file: !483, line: 33, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !249, line: 52, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !497, line: 32, baseType: !498)
!497 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stdarg.h", directory: "/home/mbarbar/software")
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !245, line: 623, baseType: !499)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 192, elements: !38)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !245, line: 623, size: 192, elements: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !500, file: !245, line: 623, baseType: !70, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !500, file: !245, line: 623, baseType: !70, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !500, file: !245, line: 623, baseType: !53, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !500, file: !245, line: 623, baseType: !53, size: 64, offset: 128)
!506 = !DISubroutineType(types: !507)
!507 = !{!7, !115, !481}
!508 = !DISubroutineType(types: !509)
!509 = !{null, !115, !7, !315}
!510 = !{!511, !242, !514, !516, !519, !521}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "mask", scope: !513, file: !245, line: 3051, type: !160, isLocal: true, isDefinition: true)
!513 = distinct !DISubprogram(name: "cached_umask", scope: !245, file: !245, line: 3049, type: !305, scopeLine: 3050, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !244, retainedNodes: !143)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !244, file: !245, line: 148, type: !115, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "zeros", scope: !518, file: !245, line: 351, type: !9, isLocal: true, isDefinition: true)
!518 = distinct !DISubprogram(name: "write_zeros", scope: !245, file: !245, line: 349, type: !450, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !244, retainedNodes: !143)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "nz", scope: !518, file: !245, line: 352, type: !55, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "fallback", scope: !518, file: !245, line: 359, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 1024)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !528, file: !529, line: 45, type: !195, isLocal: true, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !530, globals: !551, nameTableKind: None)
!529 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!530 = !{!53, !9, !456, !531, !533, !227, !230, !195, !539, !541, !543, !134, !545, !547, !549}
!531 = !DISubroutineType(types: !532)
!532 = !{null, !227, !230}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !529, line: 33, size: 192, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !534, file: !529, line: 35, baseType: !227, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !534, file: !529, line: 36, baseType: !230, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !529, line: 40, baseType: !9, size: 64, offset: 128)
!539 = !DISubroutineType(types: !540)
!540 = !{!9, !227, !230}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!543 = !DISubroutineType(types: !544)
!544 = !{!9, !115, !227, !230}
!545 = !DISubroutineType(types: !546)
!546 = !{null, !53}
!547 = !DISubroutineType(types: !548)
!548 = !{!55, !425, !55}
!549 = !DISubroutineType(types: !550)
!550 = !{!120, !425, !425}
!551 = !{!526}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !554, file: !555, line: 38, type: !567, isLocal: true, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !556, globals: !584, nameTableKind: None)
!555 = !DIFile(filename: "src/force-link.c", directory: "/home/mbarbar/software/coreutils-8.31")
!556 = !{!557, !7, !559, !9, !562, !564, !566, !55, !567, !570, !572, !115, !579}
!557 = !DISubroutineType(types: !558)
!558 = !{!7, !7, !115, !7, !115, !7, !120, !7}
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 256)
!562 = !DISubroutineType(types: !563)
!563 = !{!7, !115, !7, !115, !120, !7}
!564 = !DISubroutineType(types: !565)
!565 = !{!9, !115, !9}
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 72, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 9)
!570 = !DISubroutineType(types: !571)
!571 = !{!7, !9, !53}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !555, line: 71, size: 192, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !573, file: !555, line: 73, baseType: !7, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !573, file: !555, line: 74, baseType: !115, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !573, file: !555, line: 75, baseType: !7, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !573, file: !555, line: 76, baseType: !7, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !555, line: 131, size: 128, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !580, file: !555, line: 133, baseType: !115, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !580, file: !555, line: 134, baseType: !7, size: 32, offset: 64)
!584 = !{!552}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "Version", scope: !587, file: !588, line: 2, type: !115, isLocal: false, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !589, globals: !590, nameTableKind: None)
!588 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!589 = !{!115}
!590 = !{!585}
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !593, file: !597, line: 82, type: !115, isLocal: false, isDefinition: true)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !595, retainedTypes: !603, globals: !627, nameTableKind: None)
!594 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!595 = !{!68, !596}
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !597, line: 172, baseType: !70, size: 32, elements: !598)
!597 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!598 = !{!599, !600, !601, !602}
!599 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!600 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!601 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!602 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!603 = !{!53, !70, !55, !115, !136, !116, !604, !566, !606, !9, !607, !7, !611, !614, !623, !120, !10, !624, !31}
!604 = !DISubroutineType(types: !605)
!605 = !{!9, !7, !115, !68, !120}
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !161, line: 108, baseType: !461)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !609, line: 127, baseType: !610)
!609 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !609, line: 127, flags: DIFlagFwdDecl)
!611 = !DISubroutineType(types: !612)
!612 = !{!596, !7, !119, !55, !55, !566, !613, !129}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !616, line: 22, size: 2240, elements: !617)
!616 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !615, file: !616, line: 25, baseType: !228, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !615, file: !616, line: 26, baseType: !29, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !615, file: !616, line: 31, baseType: !33, size: 16, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !615, file: !616, line: 32, baseType: !466, size: 8, offset: 144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !615, file: !616, line: 33, baseType: !559, size: 2048, offset: 152)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !209)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !9, !55, !10, !7, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!627 = !{!591}
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "backup_args", scope: !630, file: !650, line: 42, type: !642, isLocal: true, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, retainedTypes: !633, globals: !647, nameTableKind: None)
!631 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!632 = !{!68}
!633 = !{!115, !634, !9, !636, !116, !638, !642, !644}
!634 = !DISubroutineType(types: !635)
!635 = !{!9, !7, !115, !68}
!636 = !DISubroutineType(types: !637)
!637 = !{!68, !115, !115}
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 256, elements: !640)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!640 = !{!641}
!641 = !DISubrange(count: 8)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 576, elements: !568)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !645, line: 55, baseType: !646)
!645 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!647 = !{!648, !628}
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "backup_types", scope: !630, file: !650, line: 53, type: !638, isLocal: true, isDefinition: true)
!650 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "file_name", scope: !653, file: !692, line: 37, type: !115, isLocal: true, isDefinition: true)
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !655, globals: !691, nameTableKind: None)
!654 = !DIFile(filename: "./lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!655 = !{!136, !115, !134, !120, !656, !7, !690}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !658, file: !4, line: 51, baseType: !7, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !658, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !658, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !658, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !658, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !658, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !658, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !658, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !658, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !658, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !658, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !658, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !658, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !658, file: !4, line: 70, baseType: !674, size: 64, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !658, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !658, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !658, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !658, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !658, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !658, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !658, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !658, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !658, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !658, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !658, file: !4, line: 93, baseType: !674, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !658, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !658, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !658, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !658, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!691 = !{!651}
!692 = !DIFile(filename: "lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "file_name", scope: !695, file: !737, line: 46, type: !115, isLocal: true, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !697, globals: !734, nameTableKind: None)
!696 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!697 = !{!136, !115, !698, !120, !134, !700, !7, !690}
!698 = !DISubroutineType(types: !699)
!699 = !{null, !120}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !702, file: !4, line: 51, baseType: !7, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !702, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !702, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !702, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !702, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !702, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !702, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !702, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !702, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !702, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !702, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !702, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !702, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !702, file: !4, line: 70, baseType: !718, size: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !702, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !702, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !702, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !702, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !702, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !702, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !702, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !702, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !702, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !702, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !702, file: !4, line: 93, baseType: !718, size: 64, offset: 1344)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !702, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !702, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !702, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !702, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!734 = !{!693, !735}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !695, file: !737, line: 56, type: !120, isLocal: true, isDefinition: true)
!737 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "exit_failure", scope: !740, file: !744, line: 24, type: !690, isLocal: false, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !742, globals: !743, nameTableKind: None)
!741 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!742 = !{!690}
!743 = !{!738}
!744 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "default_tuning", scope: !747, file: !756, line: 130, type: !772, isLocal: true, isDefinition: true)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !749, globals: !879, nameTableKind: None)
!748 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!749 = !{!57, !53, !55, !750, !753, !765, !759, !792, !794, !830, !786, !832, !834, !836, !837, !843, !466, !116, !845, !772, !848, !850, !754, !771, !783, !789, !851, !853, !855, !425, !777, !120, !858, !7, !860, !547, !549, !862, !864, !866, !868, !870, !872, !874, !877}
!750 = !DISubroutineType(types: !751)
!751 = !{!55, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !197, line: 69, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !756, line: 52, size: 640, elements: !757)
!756 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!757 = !{!758, !764, !767, !768, !769, !770, !782, !785, !788, !791}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !755, file: !756, line: 57, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !756, line: 46, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !756, line: 48, baseType: !53, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !756, line: 49, baseType: !759, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !755, file: !756, line: 58, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !755, file: !756, line: 59, baseType: !55, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !755, file: !756, line: 60, baseType: !55, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !755, file: !756, line: 61, baseType: !55, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !755, file: !756, line: 64, baseType: !771, size: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !197, line: 65, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !197, line: 53, size: 160, elements: !775)
!775 = !{!776, !778, !779, !780, !781}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !774, file: !197, line: 58, baseType: !777, size: 32)
!777 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !774, file: !197, line: 59, baseType: !777, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !774, file: !197, line: 60, baseType: !777, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !774, file: !197, line: 61, baseType: !777, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !774, file: !197, line: 62, baseType: !120, size: 8, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !755, file: !756, line: 71, baseType: !783, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !197, line: 48, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !755, file: !756, line: 72, baseType: !786, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !197, line: 49, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !755, file: !756, line: 73, baseType: !789, size: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !197, line: 50, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !755, file: !756, line: 76, baseType: !759, size: 64, offset: 576)
!792 = !DISubroutineType(types: !793)
!793 = !{!120, !752}
!794 = !DISubroutineType(types: !795)
!795 = !{null, !752, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !798, file: !4, line: 51, baseType: !7, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !798, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !798, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !798, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !798, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !798, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !798, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !798, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !798, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !798, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !798, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !798, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !798, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !798, file: !4, line: 70, baseType: !814, size: 64, offset: 832)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !798, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !798, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !798, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !798, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !798, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !798, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !798, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !798, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !798, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !798, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !798, file: !4, line: 93, baseType: !814, size: 64, offset: 1344)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !798, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !798, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !798, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !798, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!830 = !DISubroutineType(types: !831)
!831 = !{!53, !752, !425}
!832 = !DISubroutineType(types: !833)
!833 = !{!53, !752}
!834 = !DISubroutineType(types: !835)
!835 = !{!55, !752, !836, !55}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!55, !752, !839, !53}
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_processor", file: !197, line: 51, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!120, !53, !53}
!843 = !DISubroutineType(types: !844)
!844 = !{!55, !115, !55}
!845 = !DISubroutineType(types: !846)
!846 = !{null, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!850, !55, !771, !783, !786, !789}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !850}
!853 = !DISubroutineType(types: !854)
!854 = !{!120, !850, !55}
!855 = !DISubroutineType(types: !856)
!856 = !{!7, !850, !425, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!53, !850, !425}
!860 = !DISubroutineType(types: !861)
!861 = !{!759, !752, !425}
!862 = !DISubroutineType(types: !863)
!863 = !{!120, !850}
!864 = !DISubroutineType(types: !865)
!865 = !{!55, !55, !771}
!866 = !DISubroutineType(types: !867)
!867 = !{!55, !55}
!868 = !DISubroutineType(types: !869)
!869 = !{!120, !55}
!870 = !DISubroutineType(types: !871)
!871 = !{!120, !850, !850, !120}
!872 = !DISubroutineType(types: !873)
!873 = !{null, !850, !759}
!874 = !DISubroutineType(types: !875)
!875 = !{!53, !850, !425, !876, !120}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!759, !850}
!879 = !{!745}
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "program_name", scope: !882, file: !920, line: 33, type: !115, isLocal: false, isDefinition: true)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !884, globals: !919, nameTableKind: None)
!883 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!884 = !{!53, !9, !115, !136, !885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !887, file: !4, line: 51, baseType: !7, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !887, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !887, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !887, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !887, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !887, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !887, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !887, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !887, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !887, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !887, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !887, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !887, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !887, file: !4, line: 70, baseType: !903, size: 64, offset: 832)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !887, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !887, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !887, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !887, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !887, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !887, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !887, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !887, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !887, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !887, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !887, file: !4, line: 93, baseType: !903, size: 64, offset: 1344)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !887, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !887, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !887, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !887, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!919 = !{!880}
!920 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !923, file: !952, line: 85, type: !941, isLocal: false, isDefinition: true)
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !925, retainedTypes: !940, globals: !1048, nameTableKind: None)
!924 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!925 = !{!926}
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !927, line: 32, baseType: !70, size: 32, elements: !928)
!927 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mbarbar/software/coreutils-8.31")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!929 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!930 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!931 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!932 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!933 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!934 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!935 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!936 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!937 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!938 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!939 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!940 = !{!7, !33, !55, !941, !944, !948, !950, !960, !964, !966, !466, !968, !70, !969, !971, !115, !973, !962, !975, !977, !9, !134, !979, !559, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !120, !116, !1024, !1026, !1041, !1022, !1042, !1044, !1046}
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 704, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 11)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 320, elements: !946)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!946 = !{!947}
!947 = !DISubrange(count: 10)
!948 = !DISubroutineType(types: !949)
!949 = !{!950, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !952, line: 65, size: 448, elements: !953)
!952 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!953 = !{!954, !955, !956, !958, !959}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !951, file: !952, line: 68, baseType: !926, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !951, file: !952, line: 71, baseType: !7, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !951, file: !952, line: 75, baseType: !957, size: 256, offset: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, elements: !640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !951, file: !952, line: 78, baseType: !115, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !951, file: !952, line: 81, baseType: !115, size: 64, offset: 384)
!960 = !DISubroutineType(types: !961)
!961 = !{!926, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !950, !926}
!966 = !DISubroutineType(types: !967)
!967 = !{!7, !950, !10, !7}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!7, !950, !7}
!971 = !DISubroutineType(types: !972)
!972 = !{null, !950, !115, !115}
!973 = !DISubroutineType(types: !974)
!974 = !{!55, !9, !55, !115, !55, !962}
!975 = !DISubroutineType(types: !976)
!976 = !{!9, !115, !55, !962}
!977 = !DISubroutineType(types: !978)
!978 = !{!9, !115, !55, !626, !962}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !952, line: 834, size: 128, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !980, file: !952, line: 836, baseType: !55, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !980, file: !952, line: 837, baseType: !9, size: 64, offset: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!9, !7, !115}
!986 = !DISubroutineType(types: !987)
!987 = !{!9, !7, !115, !55}
!988 = !DISubroutineType(types: !989)
!989 = !{!9, !115}
!990 = !DISubroutineType(types: !991)
!991 = !{!9, !115, !55}
!992 = !DISubroutineType(types: !993)
!993 = !{!9, !7, !926, !115}
!994 = !DISubroutineType(types: !995)
!995 = !{!9, !7, !926, !115, !55}
!996 = !DISubroutineType(types: !997)
!997 = !{!9, !926, !115}
!998 = !DISubroutineType(types: !999)
!999 = !{!9, !926, !115, !55}
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!9, !115, !55, !10}
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!9, !115, !10}
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!9, !7, !115, !115, !115}
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!9, !7, !115, !115, !115, !55}
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!9, !115, !115, !115}
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!9, !115, !115, !115, !55}
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!115, !7, !115, !55}
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!115, !115, !55}
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!115, !7, !115}
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!115, !115}
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!55, !9, !55, !115, !55, !926, !7, !1022, !115, !115}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1027, line: 6, baseType: !1028)
!1027 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1029, line: 21, baseType: !1030)
!1029 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1029, line: 13, size: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1030, file: !1029, line: 15, baseType: !7, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1030, file: !1029, line: 20, baseType: !1034, size: 32, offset: 32)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1030, file: !1029, line: 16, size: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1034, file: !1029, line: 18, baseType: !70, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1034, file: !1029, line: 19, baseType: !1038, size: 32)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 4)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !56, line: 74, baseType: !7)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!115, !115, !926}
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!9, !7, !115, !55, !962}
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!951, !926}
!1048 = !{!921, !1049, !1051, !1053, !1055, !1057, !1059, !1061}
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !923, file: !952, line: 101, type: !944, isLocal: false, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !923, file: !952, line: 1052, type: !951, isLocal: false, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !923, file: !952, line: 116, type: !951, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "slot0", scope: !923, file: !952, line: 842, type: !559, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "slotvec", scope: !923, file: !952, line: 845, type: !979, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(name: "nslots", scope: !923, file: !952, line: 843, type: !7, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "slotvec0", scope: !923, file: !952, line: 844, type: !980, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !1065, file: !1080, line: 74, type: !1090, isLocal: true, isDefinition: true)
!1065 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1066, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1067, retainedTypes: !1075, globals: !1105, nameTableKind: None)
!1066 = !DIFile(filename: "./lib/savedir.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1067 = !{!1068}
!1068 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !1069, line: 26, baseType: !70, size: 32, elements: !1070)
