; ModuleID = 'mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.timespec*, i8, i8, i8, i8 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !3)
!2 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!3 = !{!4, !6, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !26, !27, !28, !29, !33, !35, !37, !41, !44, !46, !48, !49, !50, !51, !55, !56}
!4 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1, file: !2, line: 242, baseType: !5, size: 32)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1, file: !2, line: 260, baseType: !20, size: 64, offset: 768)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !21, file: !2, line: 157, baseType: !20, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !21, file: !2, line: 158, baseType: !0, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !21, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1, file: !2, line: 262, baseType: !0, size: 64, offset: 832)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 131, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!32 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!36 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !2, line: 150, baseType: null)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 132, baseType: !32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "llvm/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mohamad/clone")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 20)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "long_options", scope: !62, file: !63, line: 56, type: !150, isLocal: true, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !109, globals: !265, nameTableKind: None)
!63 = !DIFile(filename: "src/mv.c", directory: "/home/mohamad/clone/coreutils")
!64 = !{!65, !73, !80, !86, !92, !97, !103}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !66, line: 30, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mohamad/clone/coreutils")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !74, line: 69, baseType: !67, size: 32, elements: !75)
!74 = !DIFile(filename: "src/copy.h", directory: "/home/mohamad/clone/coreutils")
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !74, line: 60, baseType: !67, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !74, line: 26, baseType: !67, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !74, line: 47, baseType: !67, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !98, line: 23, baseType: !67, size: 32, elements: !99)
!98 = !DIFile(filename: "src/remove.h", directory: "/home/mohamad/clone/coreutils")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !98, line: 78, baseType: !67, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!109 = !{!7, !47, !0, !110, !113, !115, !118, !121, !124, !127, !130, !133, !136, !5, !139, !140, !38, !141, !144, !147, !150, !162, !57, !165, !166, !169, !170, !173, !176, !179, !182, !185, !188, !191, !194, !197, !200, !203, !206, !219, !220, !221, !224, !227, !230, !233, !236, !238, !242, !245, !248, !251, !261, !264}
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 312, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 39)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1016, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 127)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 448, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 56)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 3344, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 418)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1472, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 184)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 4216, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 527)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 360, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 45)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 432, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 54)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 24, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 80, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 10)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 24)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 104, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 13)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 3584, elements: !160)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 104, size: 256, elements: !154)
!153 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!154 = !{!155, !156, !157, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 106, baseType: !113, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !152, file: !153, line: 109, baseType: !5, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !153, line: 110, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !152, file: !153, line: 111, baseType: !5, size: 32, offset: 192)
!160 = !{!161}
!161 = !DISubrange(count: 14)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 304, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 38)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !31, line: 129, baseType: !67)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 232, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 29)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 112, elements: !160)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 12)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 16)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 168, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 21)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 336, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 42)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 560, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 70)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 136, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 17)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 72, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 9)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 184, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 23)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 456, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 57)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 600, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 75)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1768, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 221)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1776, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 222)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 896, elements: !217)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !210, file: !209, line: 633, size: 128, elements: !214)
!209 = !DIFile(filename: "src/system.h", directory: "/home/mohamad/clone/coreutils")
!210 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !209, file: !209, line: 631, type: !211, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !113}
!213 = !{}
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !208, file: !209, line: 633, baseType: !113, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !208, file: !209, line: 633, baseType: !113, size: 64, offset: 64)
!217 = !{!218}
!218 = !DISubrange(count: 7)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 184, elements: !192)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 320, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 40)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 4)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 568, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 71)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 216, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 27)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 408, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 51)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !237, line: 70, baseType: !165)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !240, line: 69, baseType: !241)
!240 = !DIFile(filename: "./lib/hash.h", directory: "/home/mohamad/clone/coreutils")
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !240, line: 67, flags: DIFlagFwdDecl)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 176, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 22)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 552, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 69)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !253, line: 7, size: 128, elements: !254)
!253 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mohamad/clone/coreutils")
!254 = !{!255, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !252, file: !253, line: 9, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !237, line: 48, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !31, line: 127, baseType: !54)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !252, file: !253, line: 10, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !237, line: 60, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !31, line: 124, baseType: !54)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 248, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 31)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !243)
!265 = !{!266, !60, !268}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !62, file: !63, line: 54, type: !139, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !270, file: !63, line: 96, type: !252, isLocal: true, isDefinition: true)
!270 = distinct !DISubprogram(name: "rm_option_init", scope: !63, file: !63, line: 75, type: !271, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !213)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !98, line: 32, size: 256, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !274, file: !98, line: 35, baseType: !139, size: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !274, file: !98, line: 38, baseType: !97, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !274, file: !98, line: 47, baseType: !139, size: 8, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !274, file: !98, line: 50, baseType: !139, size: 8, offset: 72)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !274, file: !98, line: 53, baseType: !139, size: 8, offset: 80)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !274, file: !98, line: 57, baseType: !251, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !274, file: !98, line: 61, baseType: !139, size: 8, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !274, file: !98, line: 64, baseType: !139, size: 8, offset: 200)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !274, file: !98, line: 67, baseType: !139, size: 8, offset: 208)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !274, file: !98, line: 75, baseType: !139, size: 8, offset: 216)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !288, file: !289, line: 147, type: !113, isLocal: true, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !290, retainedTypes: !291, globals: !454, nameTableKind: None)
!289 = !DIFile(filename: "src/copy.c", directory: "/home/mohamad/clone/coreutils")
!290 = !{!65, !73, !80, !86, !92}
!291 = !{!236, !47, !67, !7, !54, !52, !292, !139, !5, !294, !297, !233, !300, !238, !144, !303, !306, !113, !309, !312, !162, !315, !318, !165, !221, !245, !321, !324, !260, !257, !327, !330, !185, !333, !170, !334, !130, !133, !188, !365, !176, !366, !369, !372, !256, !259, !230, !114, !264, !378, !381, !30, !166, !261, !343, !345, !384, !387, !57, !388, !390, !147, !393, !396, !434, !8, !169, !173, !118, !350, !352, !437, !444, !447, !449, !451, !450, !452, !453}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !293, line: 90, baseType: !30)
!293 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 400, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 50)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 296, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 37)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 328, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 41)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 88, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 11)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 728, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 91)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 376, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 47)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 288, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 36)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 584, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 73)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 120, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 15)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 392, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 49)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 224, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 28)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 416, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 52)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 344, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 43)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !31, line: 130, baseType: !54)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !336, line: 46, size: 1152, elements: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!337 = !{!338, !339, !340, !341, !342, !344, !346, !347, !348, !349, !351, !353, !361, !362, !363}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !335, file: !336, line: 48, baseType: !260, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !335, file: !336, line: 53, baseType: !257, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !335, file: !336, line: 61, baseType: !333, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !335, file: !336, line: 62, baseType: !165, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !335, file: !336, line: 64, baseType: !343, size: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !31, line: 125, baseType: !67)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !335, file: !336, line: 65, baseType: !345, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !31, line: 126, baseType: !67)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !335, file: !336, line: 67, baseType: !5, size: 32, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !335, file: !336, line: 69, baseType: !260, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !335, file: !336, line: 74, baseType: !30, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !335, file: !336, line: 78, baseType: !350, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !31, line: 153, baseType: !32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !335, file: !336, line: 80, baseType: !352, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !31, line: 158, baseType: !32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !335, file: !336, line: 91, baseType: !354, size: 128, offset: 576)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !355, line: 120, size: 128, elements: !356)
!355 = !DIFile(filename: "/usr/include/time.h", directory: "")
!356 = !{!357, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !354, file: !355, line: 122, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !31, line: 139, baseType: !32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !354, file: !355, line: 123, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !31, line: 175, baseType: !32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !335, file: !336, line: 92, baseType: !354, size: 128, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !335, file: !336, line: 93, baseType: !354, size: 128, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !335, file: !336, line: 106, baseType: !364, size: 192, offset: 960)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 192, elements: !137)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 376, elements: !310)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 480, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 60)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 8)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !289, line: 125, size: 192, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !373, file: !289, line: 127, baseType: !372, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !373, file: !289, line: 128, baseType: !256, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !373, file: !289, line: 129, baseType: !259, size: 64, offset: 128)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 504, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 63)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 240, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 30)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 25)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 256, elements: !243)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 264, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 33)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 648, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 81)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !397, file: !2, line: 242, baseType: !5, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !397, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !397, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !397, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !397, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !397, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !397, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !397, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !397, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !397, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !397, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !397, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !397, file: !2, line: 260, baseType: !412, size: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !413, file: !2, line: 157, baseType: !412, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !413, file: !2, line: 158, baseType: !396, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !413, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !397, file: !2, line: 262, baseType: !396, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !397, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !397, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !397, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !397, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !397, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !397, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !397, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !397, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !397, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !397, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !397, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !397, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !397, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !397, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !397, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 152, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 19)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !439, line: 23, size: 192, elements: !440)
!439 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mohamad/clone/coreutils")
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !438, file: !439, line: 26, baseType: !292, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !438, file: !439, line: 29, baseType: !292, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !438, file: !439, line: 32, baseType: !67, size: 32, offset: 128)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 1024)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !293, line: 102, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 172, baseType: !32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !237, line: 80, baseType: !343)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !237, line: 65, baseType: !345)
!454 = !{!455, !286, !460, !462, !467, !469}
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "mask", scope: !457, file: !289, line: 3089, type: !236, isLocal: true, isDefinition: true)
!457 = distinct !DISubprogram(name: "cached_umask", scope: !289, file: !289, line: 3087, type: !458, scopeLine: 3088, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !288, retainedNodes: !213)
!458 = !DISubroutineType(types: !459)
!459 = !{!236}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !288, file: !289, line: 148, type: !113, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "zeros", scope: !464, file: !289, line: 387, type: !7, isLocal: true, isDefinition: true)
!464 = distinct !DISubprogram(name: "write_zeros", scope: !289, file: !289, line: 385, type: !465, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !288, retainedNodes: !213)
!465 = !DISubroutineType(types: !466)
!466 = !{!139, !5, !292}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "nz", scope: !464, file: !289, line: 388, type: !52, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "fallback", scope: !464, file: !289, line: 395, type: !444, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !473, file: !474, line: 45, type: !238, isLocal: true, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !475, globals: !486, nameTableKind: None)
!474 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mohamad/clone/coreutils")
!475 = !{!47, !7, !476, !478, !256, !259, !238, !484}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !477, line: 135, baseType: !54)
!477 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !474, line: 33, size: 192, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !479, file: !474, line: 35, baseType: !256, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !479, file: !474, line: 36, baseType: !259, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !474, line: 40, baseType: !7, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!486 = !{!471}
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !489, file: !490, line: 38, type: !496, isLocal: true, isDefinition: true)
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !491, globals: !509, nameTableKind: None)
!490 = !DIFile(filename: "src/force-link.c", directory: "/home/mohamad/clone/coreutils")
!491 = !{!5, !492, !7, !495, !52, !496, !497, !113, !504}
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 256)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 35, baseType: !32)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 72, elements: !189)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !490, line: 71, size: 192, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !498, file: !490, line: 73, baseType: !5, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !498, file: !490, line: 74, baseType: !113, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !498, file: !490, line: 75, baseType: !5, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !498, file: !490, line: 76, baseType: !5, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !490, line: 131, size: 128, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !505, file: !490, line: 133, baseType: !113, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !505, file: !490, line: 134, baseType: !5, size: 32, offset: 64)
!509 = !{!487}
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "Version", scope: !512, file: !513, line: 2, type: !113, isLocal: false, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !514, globals: !515, nameTableKind: None)
!513 = !DIFile(filename: "src/version.c", directory: "/home/mohamad/clone/coreutils")
!514 = !{!113}
!515 = !{!510}
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !518, file: !522, line: 82, type: !113, isLocal: false, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !520, retainedTypes: !528, globals: !546, nameTableKind: None)
!519 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!520 = !{!65, !521}
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !522, line: 172, baseType: !67, size: 32, elements: !523)
!522 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!523 = !{!524, !525, !526, !527}
!524 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!525 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!526 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!527 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!528 = !{!47, !67, !52, !113, !176, !114, !264, !495, !529, !7, !530, !5, !8, !534, !543, !139, !492, !32}
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !237, line: 109, baseType: !448)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !532, line: 127, baseType: !533)
!532 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !532, line: 127, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !536, line: 22, size: 2240, elements: !537)
!536 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!537 = !{!538, !539, !540, !541, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !535, file: !536, line: 25, baseType: !257, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !535, file: !536, line: 26, baseType: !30, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !535, file: !536, line: 31, baseType: !34, size: 16, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !535, file: !536, line: 32, baseType: !451, size: 8, offset: 144)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !535, file: !536, line: 33, baseType: !492, size: 2048, offset: 152)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 40, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 5)
!546 = !{!516}
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "backup_args", scope: !549, file: !567, line: 42, type: !557, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, retainedTypes: !552, globals: !564, nameTableKind: None)
!550 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!551 = !{!65}
!552 = !{!553, !7, !114, !555, !557, !559, !185, !173}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 256, elements: !370)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 576, elements: !189)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !560, line: 61, baseType: !561)
!560 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mohamad/clone/coreutils")
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null}
!564 = !{!565, !547}
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "backup_types", scope: !549, file: !567, line: 53, type: !555, isLocal: true, isDefinition: true)
!567 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "file_name", scope: !570, file: !614, line: 37, type: !113, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !572, globals: !613, nameTableKind: None)
!571 = !DIFile(filename: "./lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!572 = !{!113, !139, !573, !434, !5, !611, !136, !612}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !574, file: !2, line: 242, baseType: !5, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !574, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !574, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !574, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !574, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !574, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !574, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !574, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !574, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !574, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !574, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !574, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !574, file: !2, line: 260, baseType: !589, size: 64, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !590, file: !2, line: 157, baseType: !589, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !590, file: !2, line: 158, baseType: !573, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !590, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !574, file: !2, line: 262, baseType: !573, size: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !574, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !574, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !574, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !574, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !574, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !574, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !574, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !574, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !574, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !574, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !574, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !574, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !574, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !574, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !574, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 56, elements: !217)
!612 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5)
!613 = !{!568}
!614 = !DIFile(filename: "lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "file_name", scope: !617, file: !661, line: 46, type: !113, isLocal: true, isDefinition: true)
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !619, globals: !658, nameTableKind: None)
!618 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!619 = !{!113, !139, !620, !5, !170, !611, !136, !612}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !621, file: !2, line: 242, baseType: !5, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !621, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !621, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !621, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !621, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !621, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !621, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !621, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !621, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !621, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !621, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !621, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !621, file: !2, line: 260, baseType: !636, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !637, file: !2, line: 157, baseType: !636, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !637, file: !2, line: 158, baseType: !620, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !637, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !621, file: !2, line: 262, baseType: !620, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !621, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !621, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !621, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !621, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !621, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !621, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !621, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !621, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !621, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !621, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !621, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !621, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !621, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !621, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !621, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!658 = !{!615, !659}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !617, file: !661, line: 56, type: !139, isLocal: true, isDefinition: true)
!661 = !DIFile(filename: "lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "exit_failure", scope: !664, file: !668, line: 24, type: !612, isLocal: false, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !666, globals: !667, nameTableKind: None)
!665 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!666 = !{!612}
!667 = !{!662}
!668 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "default_tuning", scope: !671, file: !677, line: 130, type: !693, isLocal: true, isDefinition: true)
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !673, globals: !721, nameTableKind: None)
!672 = !DIFile(filename: "./lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!673 = !{!54, !47, !52, !674, !686, !680, !144, !390, !709, !719, !451, !114, !693, !720, !675, !692, !704, !714, !553, !698, !139, !5}
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !240, line: 69, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !677, line: 52, size: 640, elements: !678)
!677 = !DIFile(filename: "lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!678 = !{!679, !685, !688, !689, !690, !691, !703, !708, !713, !718}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !676, file: !677, line: 57, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !677, line: 46, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !681, file: !677, line: 48, baseType: !47, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !681, file: !677, line: 49, baseType: !680, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !676, file: !677, line: 58, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !676, file: !677, line: 59, baseType: !52, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !676, file: !677, line: 60, baseType: !52, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !676, file: !677, line: 61, baseType: !52, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !676, file: !677, line: 64, baseType: !692, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !240, line: 65, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !240, line: 53, size: 160, elements: !696)
!696 = !{!697, !699, !700, !701, !702}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !695, file: !240, line: 58, baseType: !698, size: 32)
!698 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !695, file: !240, line: 59, baseType: !698, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !695, file: !240, line: 60, baseType: !698, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !695, file: !240, line: 61, baseType: !698, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !695, file: !240, line: 62, baseType: !139, size: 8, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !676, file: !677, line: 71, baseType: !704, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !240, line: 48, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!52, !553, !52}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !676, file: !677, line: 72, baseType: !709, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !240, line: 49, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!139, !553, !553}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !676, file: !677, line: 73, baseType: !714, size: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !240, line: 50, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !47}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !676, file: !677, line: 76, baseType: !680, size: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!721 = !{!669}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "program_name", scope: !724, file: !766, line: 33, type: !113, isLocal: false, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !726, globals: !765, nameTableKind: None)
!725 = !DIFile(filename: "./lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!726 = !{!47, !7, !113, !118, !727, !114, !369, !224}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !728, file: !2, line: 242, baseType: !5, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !728, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !728, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !728, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !728, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !728, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !728, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !728, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !728, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !728, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !728, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !728, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !728, file: !2, line: 260, baseType: !743, size: 64, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !744, file: !2, line: 157, baseType: !743, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !744, file: !2, line: 158, baseType: !727, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !744, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !728, file: !2, line: 262, baseType: !727, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !728, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !728, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !728, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !728, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !728, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !728, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !728, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !728, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !728, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !728, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !728, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !728, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !728, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !728, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !728, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!765 = !{!722}
!766 = !DIFile(filename: "lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !769, file: !792, line: 85, type: !787, isLocal: false, isDefinition: true)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !771, retainedTypes: !786, globals: !828, nameTableKind: None)
!770 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!771 = !{!772}
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !773, line: 32, baseType: !67, size: 32, elements: !774)
!773 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mohamad/clone/coreutils")
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!775 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!776 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!777 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!778 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!779 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!780 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!781 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!782 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!783 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!784 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!785 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!786 = !{!5, !34, !52, !787, !788, !790, !451, !800, !797, !67, !113, !801, !803, !7, !804, !492, !139, !264, !114, !809, !811, !822, !823, !825, !224, !369, !136}
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 704, elements: !304)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 320, elements: !142)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !792, line: 65, size: 448, elements: !793)
!792 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!793 = !{!794, !795, !796, !798, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !791, file: !792, line: 68, baseType: !772, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !791, file: !792, line: 71, baseType: !5, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !791, file: !792, line: 75, baseType: !797, size: 256, offset: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, elements: !370)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !791, file: !792, line: 78, baseType: !113, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !791, file: !792, line: 81, baseType: !113, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !792, line: 834, size: 128, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !805, file: !792, line: 836, baseType: !52, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !805, file: !792, line: 837, baseType: !7, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !812, line: 106, baseType: !813)
!812 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !812, line: 94, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !812, line: 82, size: 64, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !814, file: !812, line: 84, baseType: !5, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !814, file: !812, line: 93, baseType: !818, size: 32, offset: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !814, file: !812, line: 85, size: 32, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !818, file: !812, line: 88, baseType: !67, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !818, file: !812, line: 92, baseType: !224, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !53, line: 74, baseType: !5)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 48, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 6)
!828 = !{!767, !829, !831, !833, !835, !837, !839, !841}
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !769, file: !792, line: 101, type: !788, isLocal: false, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !769, file: !792, line: 1052, type: !791, isLocal: false, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !769, file: !792, line: 116, type: !791, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "slot0", scope: !769, file: !792, line: 842, type: !492, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "slotvec", scope: !769, file: !792, line: 845, type: !804, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "nslots", scope: !769, file: !792, line: 843, type: !5, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "slotvec0", scope: !769, file: !792, line: 844, type: !805, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !845, file: !858, line: 74, type: !868, isLocal: true, isDefinition: true)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !847, retainedTypes: !855, globals: !882, nameTableKind: None)
!846 = !DIFile(filename: "./lib/savedir.c", directory: "/home/mohamad/clone/coreutils")
!847 = !{!848}
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !849, line: 26, baseType: !67, size: 32, elements: !850)
!849 = !DIFile(filename: "./lib/savedir.h", directory: "/home/mohamad/clone/coreutils")
!850 = !{!851, !852, !853, !854}
!851 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!852 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!853 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!854 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!855 = !{!47, !7, !52, !856, !5, !864, !868, !870, !113, !879, !857, !257, !863, !8, !530, !880, !881}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "direntry_t", file: !858, line: 46, baseType: !859)
!858 = !DIFile(filename: "lib/savedir.c", directory: "/home/mohamad/clone/coreutils")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !858, line: 40, size: 128, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !859, file: !858, line: 42, baseType: !7, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !859, file: !858, line: 44, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !532, line: 34, baseType: !257)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !858, line: 72, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!5, !553, !553}
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 192, elements: !137)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !536, line: 22, size: 2240, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !872, file: !536, line: 25, baseType: !257, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !872, file: !536, line: 26, baseType: !30, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !872, file: !536, line: 31, baseType: !34, size: 16, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !872, file: !536, line: 32, baseType: !451, size: 8, offset: 144)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !872, file: !536, line: 33, baseType: !492, size: 2048, offset: 152)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!882 = !{!843}
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "letters", scope: !885, file: !900, line: 184, type: !891, isLocal: true, isDefinition: true)
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !887, globals: !899, nameTableKind: None)
!886 = !DIFile(filename: "./lib/tempname.c", directory: "/home/mohamad/clone/coreutils")
!887 = !{!52, !7, !67, !5, !888, !891, !892, !895, !318, !898, !264, !158}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !890, line: 33, flags: DIFlagFwdDecl)
!890 = !DIFile(filename: "./lib/randint.h", directory: "/home/mohamad/clone/coreutils")
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 504, elements: !379)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!5, !7, !47}
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 280, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 35)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 416, elements: !328)
!899 = !{!883}
!900 = !DIFile(filename: "lib/tempname.c", directory: "/home/mohamad/clone/coreutils")
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "ht", scope: !903, file: !904, line: 163, type: !238, isLocal: true, isDefinition: true)
!903 = distinct !DISubprogram(name: "utimecmpat", scope: !904, file: !904, line: 132, type: !905, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !930, retainedNodes: !213)
!904 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/mohamad/clone/coreutils")
!905 = !DISubroutineType(types: !906)
!906 = !{!5, !5, !113, !907, !907, !5}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !336, line: 46, size: 1152, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !927, !928, !929}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !909, file: !336, line: 48, baseType: !260, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !909, file: !336, line: 53, baseType: !257, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !909, file: !336, line: 61, baseType: !333, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !909, file: !336, line: 62, baseType: !165, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !909, file: !336, line: 64, baseType: !343, size: 32, offset: 224)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !909, file: !336, line: 65, baseType: !345, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !909, file: !336, line: 67, baseType: !5, size: 32, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !909, file: !336, line: 69, baseType: !260, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !909, file: !336, line: 74, baseType: !30, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !909, file: !336, line: 78, baseType: !350, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !909, file: !336, line: 80, baseType: !352, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !909, file: !336, line: 91, baseType: !923, size: 128, offset: 576)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !355, line: 120, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !923, file: !355, line: 122, baseType: !358, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !923, file: !355, line: 123, baseType: !360, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !909, file: !336, line: 92, baseType: !923, size: 128, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !909, file: !336, line: 93, baseType: !923, size: 128, offset: 832)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !909, file: !336, line: 106, baseType: !364, size: 192, offset: 960)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !932, globals: !943, nameTableKind: None)
!931 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/mohamad/clone/coreutils")
!932 = !{!933, !358, !5, !934, !139, !260, !259, !940, !360, !941}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !355, line: 75, baseType: !358)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !904, line: 66, size: 128, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !935, file: !904, line: 69, baseType: !259, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !935, file: !904, line: 76, baseType: !5, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !935, file: !904, line: 80, baseType: !139, size: 8, offset: 96)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, elements: !243)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!943 = !{!901, !944}
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !903, file: !904, line: 166, type: !934, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !948, file: !968, line: 75, type: !5, isLocal: true, isDefinition: true)
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !950, globals: !965, nameTableKind: None)
!949 = !DIFile(filename: "./lib/utimens.c", directory: "/home/mohamad/clone/coreutils")
!950 = !{!951, !956, !5, !360, !957, !964, !358, !963, !139, !933, !165}
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 256, elements: !243)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !355, line: 120, size: 128, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !952, file: !355, line: 122, baseType: !358, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !952, file: !355, line: 123, baseType: !360, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, elements: !243)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !959, line: 30, size: 128, elements: !960)
!959 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "")
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !958, file: !959, line: 32, baseType: !358, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !958, file: !959, line: 33, baseType: !963, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !31, line: 141, baseType: !32)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!965 = !{!946, !966}
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !948, file: !968, line: 76, type: !5, isLocal: true, isDefinition: true)
!968 = !DIFile(filename: "lib/utimens.c", directory: "/home/mohamad/clone/coreutils")
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !971, file: !975, line: 26, type: !309, isLocal: false, isDefinition: true)
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !973, globals: !974, nameTableKind: None)
!972 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/mohamad/clone/coreutils")
!973 = !{!309}
!974 = !{!969}
!975 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/mohamad/clone/coreutils")
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "initialized", scope: !978, file: !979, line: 34, type: !139, isLocal: true, isDefinition: true)
!978 = distinct !DISubprogram(name: "can_write_any_file", scope: !979, file: !979, line: 32, type: !980, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !982, retainedNodes: !213)
!979 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/mohamad/clone/coreutils")
!980 = !DISubroutineType(types: !981)
!981 = !{!139}
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !981, globals: !984, nameTableKind: None)
!983 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/mohamad/clone/coreutils")
!984 = !{!976, !985}
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "can_write", scope: !978, file: !979, line: 35, type: !139, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !989, file: !1032, line: 67, type: !559, isLocal: false, isDefinition: true)
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang 705b46f1517a61e41433abeac21f36fdcdd90bc1) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !991, globals: !1031, nameTableKind: None)
!990 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/mohamad/clone/coreutils")
!991 = !{!47, !113, !559, !52, !495, !139, !992, !114, !230, !166, !176, !993, !369, !543}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !994, file: !2, line: 242, baseType: !5, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !994, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !994, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !994, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !994, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !994, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !994, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !994, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !994, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !994, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !994, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !994, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !994, file: !2, line: 260, baseType: !1009, size: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1010, file: !2, line: 157, baseType: !1009, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1010, file: !2, line: 158, baseType: !993, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1010, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !994, file: !2, line: 262, baseType: !993, size: 64, offset: 832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !994, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !994, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !994, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !994, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !994, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !994, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !994, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !994, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !994, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !994, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !994, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !994, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
