; ModuleID = 'mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.timespec*, i8, i8, i8, i8 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !3)
!2 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!3 = !{!4, !6, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !26, !27, !28, !29, !33, !35, !37, !41, !44, !46, !48, !49, !50, !51, !55, !56}
!4 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1, file: !2, line: 242, baseType: !5, size: 32)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1, file: !2, line: 260, baseType: !20, size: 64, offset: 768)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !21, file: !2, line: 157, baseType: !20, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !21, file: !2, line: 158, baseType: !0, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !21, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1, file: !2, line: 262, baseType: !0, size: 64, offset: 832)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 131, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!32 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!36 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !2, line: 150, baseType: null)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 132, baseType: !32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "llvm/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mohamad/clone")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 20)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "long_options", scope: !62, file: !63, line: 56, type: !118, isLocal: true, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !109, globals: !233, nameTableKind: None)
!63 = !DIFile(filename: "src/mv.c", directory: "/home/mohamad/clone/coreutils")
!64 = !{!65, !73, !80, !86, !92, !97, !103}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !66, line: 30, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mohamad/clone/coreutils")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !74, line: 69, baseType: !67, size: 32, elements: !75)
!74 = !DIFile(filename: "src/copy.h", directory: "/home/mohamad/clone/coreutils")
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !74, line: 60, baseType: !67, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !74, line: 26, baseType: !67, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !74, line: 47, baseType: !67, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !98, line: 23, baseType: !67, size: 32, elements: !99)
!98 = !DIFile(filename: "src/remove.h", directory: "/home/mohamad/clone/coreutils")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !98, line: 78, baseType: !67, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!109 = !{!7, !47, !110, !5, !0, !112, !114, !116, !117, !118, !130, !131, !133, !135, !146, !147, !149, !157, !192, !197, !199, !201, !203, !205, !208, !210, !219}
!110 = !DISubroutineType(types: !111)
!111 = !{null, !5}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!114 = !DISubroutineType(types: !115)
!115 = !{!5, !5, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!117 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 3584, elements: !128)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !121, line: 104, size: 256, elements: !122)
!121 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!122 = !{!123, !124, !125, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !121, line: 106, baseType: !112, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !120, file: !121, line: 109, baseType: !5, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !120, file: !121, line: 110, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !120, file: !121, line: 111, baseType: !5, size: 32, offset: 192)
!128 = !{!129}
!129 = !DISubrange(count: 14)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !31, line: 129, baseType: !67)
!131 = !DISubroutineType(types: !132)
!132 = !{null}
!133 = !DISubroutineType(types: !134)
!134 = !{null, !112}
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 896, elements: !144)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !139, file: !138, line: 633, size: 128, elements: !141)
!138 = !DIFile(filename: "src/system.h", directory: "/home/mohamad/clone/coreutils")
!139 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !138, file: !138, line: 631, type: !133, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !140)
!140 = !{}
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !137, file: !138, line: 633, baseType: !112, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !137, file: !138, line: 633, baseType: !112, size: 64, offset: 64)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !74, line: 98, size: 640, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !196}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !150, file: !74, line: 100, baseType: !65, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !150, file: !74, line: 103, baseType: !73, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !150, file: !74, line: 108, baseType: !80, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !150, file: !74, line: 111, baseType: !86, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !150, file: !74, line: 115, baseType: !157, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !158, line: 70, baseType: !130)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !150, file: !74, line: 119, baseType: !117, size: 8, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !150, file: !74, line: 123, baseType: !117, size: 8, offset: 168)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !150, file: !74, line: 130, baseType: !117, size: 8, offset: 176)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !150, file: !74, line: 134, baseType: !117, size: 8, offset: 184)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !150, file: !74, line: 138, baseType: !117, size: 8, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !150, file: !74, line: 141, baseType: !117, size: 8, offset: 200)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !150, file: !74, line: 145, baseType: !117, size: 8, offset: 208)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !150, file: !74, line: 152, baseType: !117, size: 8, offset: 216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !150, file: !74, line: 156, baseType: !117, size: 8, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !150, file: !74, line: 160, baseType: !117, size: 8, offset: 232)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !150, file: !74, line: 161, baseType: !117, size: 8, offset: 240)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !150, file: !74, line: 162, baseType: !117, size: 8, offset: 248)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !150, file: !74, line: 163, baseType: !117, size: 8, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !150, file: !74, line: 166, baseType: !117, size: 8, offset: 264)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !150, file: !74, line: 178, baseType: !117, size: 8, offset: 272)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !150, file: !74, line: 182, baseType: !117, size: 8, offset: 280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !150, file: !74, line: 188, baseType: !117, size: 8, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !150, file: !74, line: 192, baseType: !117, size: 8, offset: 296)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !150, file: !74, line: 201, baseType: !117, size: 8, offset: 304)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !150, file: !74, line: 205, baseType: !117, size: 8, offset: 312)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !150, file: !74, line: 214, baseType: !117, size: 8, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !150, file: !74, line: 223, baseType: !117, size: 8, offset: 328)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !150, file: !74, line: 227, baseType: !117, size: 8, offset: 336)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !150, file: !74, line: 231, baseType: !117, size: 8, offset: 344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !150, file: !74, line: 235, baseType: !117, size: 8, offset: 352)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !150, file: !74, line: 239, baseType: !117, size: 8, offset: 360)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !150, file: !74, line: 242, baseType: !117, size: 8, offset: 368)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !150, file: !74, line: 245, baseType: !117, size: 8, offset: 376)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !150, file: !74, line: 250, baseType: !117, size: 8, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !150, file: !74, line: 254, baseType: !117, size: 8, offset: 392)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !150, file: !74, line: 259, baseType: !5, size: 32, offset: 416)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !150, file: !74, line: 262, baseType: !92, size: 32, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !150, file: !74, line: 273, baseType: !192, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !194, line: 69, baseType: !195)
!194 = !DIFile(filename: "./lib/hash.h", directory: "/home/mohamad/clone/coreutils")
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !194, line: 67, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !150, file: !74, line: 276, baseType: !192, size: 64, offset: 576)
!197 = !DISubroutineType(types: !198)
!198 = !{!117, !112}
!199 = !DISubroutineType(types: !200)
!200 = !{!117, !7, !7, !117, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!203 = !DISubroutineType(types: !204)
!204 = !{!117, !112, !112, !201}
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 2)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !98, line: 32, size: 256, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !229, !230, !231, !232}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !211, file: !98, line: 35, baseType: !117, size: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !211, file: !98, line: 38, baseType: !97, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !211, file: !98, line: 47, baseType: !117, size: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !211, file: !98, line: 50, baseType: !117, size: 8, offset: 72)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !211, file: !98, line: 53, baseType: !117, size: 8, offset: 80)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !211, file: !98, line: 57, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !221, line: 7, size: 128, elements: !222)
!221 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mohamad/clone/coreutils")
!222 = !{!223, !226}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !220, file: !221, line: 9, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !158, line: 48, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !31, line: 127, baseType: !54)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !220, file: !221, line: 10, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !158, line: 60, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !31, line: 124, baseType: !54)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !211, file: !98, line: 61, baseType: !117, size: 8, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !211, file: !98, line: 64, baseType: !117, size: 8, offset: 200)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !211, file: !98, line: 67, baseType: !117, size: 8, offset: 208)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !211, file: !98, line: 75, baseType: !117, size: 8, offset: 216)
!233 = !{!234, !60, !236}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !62, file: !63, line: 54, type: !117, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !238, file: !63, line: 96, type: !220, isLocal: true, isDefinition: true)
!238 = distinct !DISubprogram(name: "rm_option_init", scope: !63, file: !63, line: 75, type: !208, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !140)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !241, file: !242, line: 147, type: !112, isLocal: true, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !244, globals: !483, nameTableKind: None)
!242 = !DIFile(filename: "src/copy.c", directory: "/home/mohamad/clone/coreutils")
!243 = !{!65, !73, !80, !86, !92}
!244 = !{!157, !47, !67, !7, !54, !52, !245, !247, !117, !112, !249, !5, !292, !294, !296, !192, !297, !299, !300, !302, !304, !306, !308, !310, !312, !347, !130, !228, !225, !320, !353, !224, !227, !113, !30, !323, !325, !354, !355, !357, !359, !361, !363, !365, !367, !370, !197, !8, !408, !410, !412, !414, !416, !418, !330, !420, !422, !424, !332, !426, !428, !430, !432, !439, !441, !451, !453, !455, !457, !459, !461, !462, !464, !466, !468, !467, !469, !131, !471, !473, !475, !477, !478, !479, !481}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !246, line: 90, baseType: !30)
!246 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!247 = !DISubroutineType(types: !248)
!248 = !{!117, !112, !112, !157, !117, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !74, line: 98, size: 640, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !251, file: !74, line: 100, baseType: !65, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !251, file: !74, line: 103, baseType: !73, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !251, file: !74, line: 108, baseType: !80, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !251, file: !74, line: 111, baseType: !86, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !251, file: !74, line: 115, baseType: !157, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !251, file: !74, line: 119, baseType: !117, size: 8, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !251, file: !74, line: 123, baseType: !117, size: 8, offset: 168)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !251, file: !74, line: 130, baseType: !117, size: 8, offset: 176)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !251, file: !74, line: 134, baseType: !117, size: 8, offset: 184)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !251, file: !74, line: 138, baseType: !117, size: 8, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !251, file: !74, line: 141, baseType: !117, size: 8, offset: 200)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !251, file: !74, line: 145, baseType: !117, size: 8, offset: 208)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !251, file: !74, line: 152, baseType: !117, size: 8, offset: 216)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !251, file: !74, line: 156, baseType: !117, size: 8, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !251, file: !74, line: 160, baseType: !117, size: 8, offset: 232)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !251, file: !74, line: 161, baseType: !117, size: 8, offset: 240)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !251, file: !74, line: 162, baseType: !117, size: 8, offset: 248)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !251, file: !74, line: 163, baseType: !117, size: 8, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !251, file: !74, line: 166, baseType: !117, size: 8, offset: 264)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !251, file: !74, line: 178, baseType: !117, size: 8, offset: 272)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !251, file: !74, line: 182, baseType: !117, size: 8, offset: 280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !251, file: !74, line: 188, baseType: !117, size: 8, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !251, file: !74, line: 192, baseType: !117, size: 8, offset: 296)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !251, file: !74, line: 201, baseType: !117, size: 8, offset: 304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !251, file: !74, line: 205, baseType: !117, size: 8, offset: 312)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !251, file: !74, line: 214, baseType: !117, size: 8, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !251, file: !74, line: 223, baseType: !117, size: 8, offset: 328)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !251, file: !74, line: 227, baseType: !117, size: 8, offset: 336)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !251, file: !74, line: 231, baseType: !117, size: 8, offset: 344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !251, file: !74, line: 235, baseType: !117, size: 8, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !251, file: !74, line: 239, baseType: !117, size: 8, offset: 360)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !251, file: !74, line: 242, baseType: !117, size: 8, offset: 368)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !251, file: !74, line: 245, baseType: !117, size: 8, offset: 376)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !251, file: !74, line: 250, baseType: !117, size: 8, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !251, file: !74, line: 254, baseType: !117, size: 8, offset: 392)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !251, file: !74, line: 259, baseType: !5, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !251, file: !74, line: 262, baseType: !92, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !251, file: !74, line: 273, baseType: !192, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !251, file: !74, line: 276, baseType: !192, size: 64, offset: 576)
!292 = !DISubroutineType(types: !293)
!293 = !{!117, !112, !117, !117, !249}
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!117, !112, !112, !117, !249, !299, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!117, !249}
!302 = !DISubroutineType(types: !303)
!303 = !{!157}
!304 = !DISubroutineType(types: !305)
!305 = !{!117, !5}
!306 = !DISubroutineType(types: !307)
!307 = !{!5, !112, !157}
!308 = !DISubroutineType(types: !309)
!309 = !{!117, !112, !117, !117}
!310 = !DISubroutineType(types: !311)
!311 = !{!117, !112, !112, !117, !312, !347, !249, !117, !299, !299, !299}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !315, line: 46, size: 1152, elements: !316)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!316 = !{!317, !318, !319, !321, !322, !324, !326, !327, !328, !329, !331, !333, !341, !342, !343}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !314, file: !315, line: 48, baseType: !228, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !314, file: !315, line: 53, baseType: !225, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !314, file: !315, line: 61, baseType: !320, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !31, line: 130, baseType: !54)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !314, file: !315, line: 62, baseType: !130, size: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !314, file: !315, line: 64, baseType: !323, size: 32, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !31, line: 125, baseType: !67)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !314, file: !315, line: 65, baseType: !325, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !31, line: 126, baseType: !67)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !314, file: !315, line: 67, baseType: !5, size: 32, offset: 288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !314, file: !315, line: 69, baseType: !228, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !314, file: !315, line: 74, baseType: !30, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !314, file: !315, line: 78, baseType: !330, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !31, line: 153, baseType: !32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !314, file: !315, line: 80, baseType: !332, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !31, line: 158, baseType: !32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !314, file: !315, line: 91, baseType: !334, size: 128, offset: 576)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !335, line: 120, size: 128, elements: !336)
!335 = !DIFile(filename: "/usr/include/time.h", directory: "")
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !334, file: !335, line: 122, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !31, line: 139, baseType: !32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !334, file: !335, line: 123, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !31, line: 175, baseType: !32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !314, file: !315, line: 92, baseType: !334, size: 128, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !314, file: !315, line: 93, baseType: !334, size: 128, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !314, file: !315, line: 106, baseType: !344, size: 192, offset: 960)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 192, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 3)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !242, line: 125, size: 192, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !348, file: !242, line: 127, baseType: !347, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !348, file: !242, line: 128, baseType: !224, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !348, file: !242, line: 129, baseType: !227, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 256, elements: !206)
!355 = !DISubroutineType(types: !356)
!356 = !{!5, !5, !112, !353, !5}
!357 = !DISubroutineType(types: !358)
!358 = !{!117, !249, !117}
!359 = !DISubroutineType(types: !360)
!360 = !{!117, !112, !312, !112, !312, !249, !299}
!361 = !DISubroutineType(types: !362)
!362 = !{!117, !112, !112, !117, !117, !117}
!363 = !DISubroutineType(types: !364)
!364 = !{!117, !249, !112, !312}
!365 = !DISubroutineType(types: !366)
!366 = !{!117, !112, !157}
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 12)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !371, file: !2, line: 242, baseType: !5, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !371, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !371, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !371, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !371, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !371, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !371, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !371, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !371, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !371, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !371, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !371, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !371, file: !2, line: 260, baseType: !386, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !387, file: !2, line: 157, baseType: !386, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !387, file: !2, line: 158, baseType: !370, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !387, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !371, file: !2, line: 262, baseType: !370, size: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !371, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !371, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !371, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !371, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !371, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !371, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !371, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !371, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !371, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !371, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !371, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !371, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !371, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !371, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !371, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!408 = !DISubroutineType(types: !409)
!409 = !{!117, !112, !312, !112}
!410 = !DISubroutineType(types: !411)
!411 = !{null, !112, !112, !112}
!412 = !DISubroutineType(types: !413)
!413 = !{!117, !312, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!416 = !DISubroutineType(types: !417)
!417 = !{!117, !112, !112, !117, !312, !347, !249, !299, !299}
!418 = !DISubroutineType(types: !419)
!419 = !{!117, !112, !112, !249, !157, !157, !299, !312}
!420 = !DISubroutineType(types: !421)
!421 = !{!5, !5, !5}
!422 = !DISubroutineType(types: !423)
!423 = !{!52, !314}
!424 = !DISubroutineType(types: !425)
!425 = !{!117, !312}
!426 = !DISubroutineType(types: !427)
!427 = !{!47, !428, !52}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!430 = !DISubroutineType(types: !431)
!431 = !{!117, !5, !5, !7, !52, !52, !245, !86, !112, !112, !299}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !434, line: 23, size: 192, elements: !435)
!434 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mohamad/clone/coreutils")
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !433, file: !434, line: 26, baseType: !245, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !433, file: !434, line: 29, baseType: !245, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !433, file: !434, line: 32, baseType: !67, size: 32, offset: 128)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !434, line: 36, size: 384, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !442, file: !434, line: 39, baseType: !5, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !442, file: !434, line: 42, baseType: !245, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !442, file: !434, line: 45, baseType: !67, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !442, file: !434, line: 48, baseType: !52, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !442, file: !434, line: 52, baseType: !117, size: 8, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !442, file: !434, line: 55, baseType: !117, size: 8, offset: 264)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !442, file: !434, line: 58, baseType: !432, size: 64, offset: 320)
!451 = !DISubroutineType(types: !452)
!452 = !{!117, !5, !112, !117, !245}
!453 = !DISubroutineType(types: !454)
!454 = !{!117, !5, !245}
!455 = !DISubroutineType(types: !456)
!456 = !{!5, !5, !245, !245}
!457 = !DISubroutineType(types: !458)
!458 = !{!117, !5, !5, !7, !52, !52, !117, !112, !112, !459, !461, !299}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !460, line: 135, baseType: !54)
!460 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !246, line: 102, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 172, baseType: !32)
!464 = !DISubroutineType(types: !465)
!465 = !{!117, !428, !52}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!469 = !DISubroutineType(types: !470)
!470 = !{!5, !5, !112, !157}
!471 = !DISubroutineType(types: !472)
!472 = !{!5, !112, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!475 = !DISubroutineType(types: !476)
!476 = !{!5, !249, !112, !5, !312, !117, !312}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !158, line: 80, baseType: !323)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !158, line: 65, baseType: !325)
!479 = !DISubroutineType(types: !480)
!480 = !{!117, !112, !5, !112, !5, !249}
!481 = !DISubroutineType(types: !482)
!482 = !{null, !112, !5, !312}
!483 = !{!484, !239, !487, !489, !492, !494}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "mask", scope: !486, file: !242, line: 3089, type: !157, isLocal: true, isDefinition: true)
!486 = distinct !DISubprogram(name: "cached_umask", scope: !242, file: !242, line: 3087, type: !302, scopeLine: 3088, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !241, retainedNodes: !140)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !241, file: !242, line: 148, type: !112, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "zeros", scope: !491, file: !242, line: 387, type: !7, isLocal: true, isDefinition: true)
!491 = distinct !DISubprogram(name: "write_zeros", scope: !242, file: !242, line: 385, type: !453, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !241, retainedNodes: !140)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "nz", scope: !491, file: !242, line: 388, type: !52, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "fallback", scope: !491, file: !242, line: 395, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 1024)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !501, file: !502, line: 45, type: !192, isLocal: true, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !503, globals: !524, nameTableKind: None)
!502 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mohamad/clone/coreutils")
!503 = !{!47, !7, !459, !504, !224, !227, !506, !192, !512, !514, !516, !112, !131, !518, !520, !52, !428, !522, !117}
!504 = !DISubroutineType(types: !505)
!505 = !{null, !224, !227}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !502, line: 33, size: 192, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !507, file: !502, line: 35, baseType: !224, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !507, file: !502, line: 36, baseType: !227, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !502, line: 40, baseType: !7, size: 64, offset: 128)
!512 = !DISubroutineType(types: !513)
!513 = !{!7, !224, !227}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!516 = !DISubroutineType(types: !517)
!517 = !{!7, !112, !224, !227}
!518 = !DISubroutineType(types: !519)
!519 = !{null, !47}
!520 = !DISubroutineType(types: !521)
!521 = !{!52, !428, !52}
!522 = !DISubroutineType(types: !523)
!523 = !{!117, !428, !428}
!524 = !{!499}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !527, file: !528, line: 38, type: !540, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !529, globals: !557, nameTableKind: None)
!528 = !DIFile(filename: "src/force-link.c", directory: "/home/mohamad/clone/coreutils")
!529 = !{!530, !5, !112, !117, !532, !7, !535, !537, !539, !52, !540, !543, !47, !545, !552}
!530 = !DISubroutineType(types: !531)
!531 = !{!5, !5, !112, !5, !112, !5, !117, !5}
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 256)
!535 = !DISubroutineType(types: !536)
!536 = !{!5, !112, !5, !112, !117, !5}
!537 = !DISubroutineType(types: !538)
!538 = !{!7, !112, !7}
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 35, baseType: !32)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 72, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 9)
!543 = !DISubroutineType(types: !544)
!544 = !{!5, !7, !47}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !528, line: 71, size: 192, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !546, file: !528, line: 73, baseType: !5, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !546, file: !528, line: 74, baseType: !112, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !546, file: !528, line: 75, baseType: !5, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !528, line: 76, baseType: !5, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !528, line: 131, size: 128, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !553, file: !528, line: 133, baseType: !112, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !553, file: !528, line: 134, baseType: !5, size: 32, offset: 64)
!557 = !{!525}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "Version", scope: !560, file: !561, line: 2, type: !112, isLocal: false, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !562, globals: !563, nameTableKind: None)
!561 = !DIFile(filename: "src/version.c", directory: "/home/mohamad/clone/coreutils")
!562 = !{!112}
!563 = !{!558}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !566, file: !570, line: 82, type: !112, isLocal: false, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !568, retainedTypes: !576, globals: !600, nameTableKind: None)
!567 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!568 = !{!65, !569}
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !570, line: 172, baseType: !67, size: 32, elements: !571)
!570 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mohamad/clone/coreutils")
!571 = !{!572, !573, !574, !575}
!572 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!573 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!574 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!575 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!576 = !{!47, !67, !52, !112, !133, !113, !577, !7, !5, !117, !539, !579, !580, !584, !116, !586, !126, !587, !596, !8, !597, !599, !32}
!577 = !DISubroutineType(types: !578)
!578 = !{!7, !5, !112, !65, !117}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !158, line: 109, baseType: !463)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !582, line: 127, baseType: !583)
!582 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !582, line: 127, flags: DIFlagFwdDecl)
!584 = !DISubroutineType(types: !585)
!585 = !{!569, !5, !116, !52, !52, !539, !586, !126}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !589, line: 22, size: 2240, elements: !590)
!589 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!590 = !{!591, !592, !593, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !588, file: !589, line: 25, baseType: !225, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !588, file: !589, line: 26, baseType: !30, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !588, file: !589, line: 31, baseType: !34, size: 16, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !588, file: !589, line: 32, baseType: !468, size: 8, offset: 144)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !588, file: !589, line: 33, baseType: !532, size: 2048, offset: 152)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !206)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !7, !52, !8, !5, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!600 = !{!564}
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "backup_args", scope: !603, file: !623, line: 42, type: !615, isLocal: true, isDefinition: true)
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !605, retainedTypes: !606, globals: !620, nameTableKind: None)
!604 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!605 = !{!65}
!606 = !{!428, !607, !7, !5, !112, !609, !113, !611, !615, !617}
!607 = !DISubroutineType(types: !608)
!608 = !{!7, !5, !112, !65}
!609 = !DISubroutineType(types: !610)
!610 = !{!65, !112, !112}
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 256, elements: !613)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!613 = !{!614}
!614 = !DISubrange(count: 8)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 576, elements: !541)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !618, line: 61, baseType: !619)
!618 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mohamad/clone/coreutils")
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!620 = !{!621, !601}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "backup_types", scope: !603, file: !623, line: 53, type: !611, isLocal: true, isDefinition: true)
!623 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mohamad/clone/coreutils")
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "file_name", scope: !626, file: !669, line: 37, type: !112, isLocal: true, isDefinition: true)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !628, globals: !668, nameTableKind: None)
!627 = !DIFile(filename: "./lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!628 = !{!133, !112, !131, !117, !629, !5, !667}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !630, file: !2, line: 242, baseType: !5, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !630, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !630, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !630, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !630, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !630, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !630, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !630, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !630, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !630, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !630, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !630, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !630, file: !2, line: 260, baseType: !645, size: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !646, file: !2, line: 157, baseType: !645, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !646, file: !2, line: 158, baseType: !629, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !646, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !630, file: !2, line: 262, baseType: !629, size: 64, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !630, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !630, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !630, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !630, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !630, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !630, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !630, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !630, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !630, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !630, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !630, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !630, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !630, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !630, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !630, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!667 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5)
!668 = !{!624}
!669 = !DIFile(filename: "lib/closein.c", directory: "/home/mohamad/clone/coreutils")
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "file_name", scope: !672, file: !718, line: 46, type: !112, isLocal: true, isDefinition: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !674, globals: !715, nameTableKind: None)
!673 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!674 = !{!133, !112, !675, !117, !131, !677, !5, !667}
!675 = !DISubroutineType(types: !676)
!676 = !{null, !117}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !678, file: !2, line: 242, baseType: !5, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !678, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !678, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !678, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !678, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !678, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !678, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !678, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !678, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !678, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !678, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !678, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !678, file: !2, line: 260, baseType: !693, size: 64, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !694, file: !2, line: 157, baseType: !693, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !694, file: !2, line: 158, baseType: !677, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !694, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !678, file: !2, line: 262, baseType: !677, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !678, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !678, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !678, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !678, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !678, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !678, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !678, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !678, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !678, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !678, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !678, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !678, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !678, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !678, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !678, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!715 = !{!670, !716}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !672, file: !718, line: 56, type: !117, isLocal: true, isDefinition: true)
!718 = !DIFile(filename: "lib/closeout.c", directory: "/home/mohamad/clone/coreutils")
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "exit_failure", scope: !721, file: !725, line: 24, type: !667, isLocal: false, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !723, globals: !724, nameTableKind: None)
!722 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!723 = !{!667}
!724 = !{!719}
!725 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mohamad/clone/coreutils")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "default_tuning", scope: !728, file: !737, line: 130, type: !753, isLocal: true, isDefinition: true)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !730, globals: !866, nameTableKind: None)
!729 = !DIFile(filename: "./lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!730 = !{!54, !47, !52, !731, !733, !734, !746, !740, !773, !117, !775, !777, !817, !428, !767, !819, !821, !823, !824, !826, !830, !112, !468, !113, !832, !834, !753, !835, !837, !752, !764, !770, !735, !838, !840, !842, !5, !844, !758, !845, !847, !520, !522, !849, !851, !853, !855, !857, !859, !861, !863, !864}
!731 = !DISubroutineType(types: !732)
!732 = !{!52, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !194, line: 69, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !737, line: 52, size: 640, elements: !738)
!737 = !DIFile(filename: "lib/hash.c", directory: "/home/mohamad/clone/coreutils")
!738 = !{!739, !745, !748, !749, !750, !751, !763, !766, !769, !772}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !736, file: !737, line: 57, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !737, line: 46, size: 128, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !741, file: !737, line: 48, baseType: !47, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !737, line: 49, baseType: !740, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !736, file: !737, line: 58, baseType: !746, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !736, file: !737, line: 59, baseType: !52, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !736, file: !737, line: 60, baseType: !52, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !736, file: !737, line: 61, baseType: !52, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !736, file: !737, line: 64, baseType: !752, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !194, line: 65, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !194, line: 53, size: 160, elements: !756)
!756 = !{!757, !759, !760, !761, !762}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !755, file: !194, line: 58, baseType: !758, size: 32)
!758 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !755, file: !194, line: 59, baseType: !758, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !755, file: !194, line: 60, baseType: !758, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !755, file: !194, line: 61, baseType: !758, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !755, file: !194, line: 62, baseType: !117, size: 8, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !736, file: !737, line: 71, baseType: !764, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !194, line: 48, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !736, file: !737, line: 72, baseType: !767, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !194, line: 49, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !736, file: !737, line: 73, baseType: !770, size: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !194, line: 50, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !736, file: !737, line: 76, baseType: !740, size: 64, offset: 576)
!773 = !DISubroutineType(types: !774)
!774 = !{!117, !733}
!775 = !DISubroutineType(types: !776)
!776 = !{null, !733, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !246, line: 48, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !779, file: !2, line: 242, baseType: !5, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !779, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !779, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !779, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !779, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !779, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !779, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !779, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !779, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !779, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !779, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !779, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !779, file: !2, line: 260, baseType: !794, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !796)
!796 = !{!797, !798, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !795, file: !2, line: 157, baseType: !794, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !795, file: !2, line: 158, baseType: !799, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !795, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !779, file: !2, line: 262, baseType: !799, size: 64, offset: 832)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !779, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !779, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !779, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !779, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !779, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !779, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !779, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !779, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !779, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !779, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !779, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !779, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !779, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !779, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !779, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!817 = !DISubroutineType(types: !818)
!818 = !{!47, !733, !428}
!819 = !DISubroutineType(types: !820)
!820 = !{!47, !733}
!821 = !DISubroutineType(types: !822)
!822 = !{!52, !733, !823, !52}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!52, !733, !826, !47}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_processor", file: !194, line: 51, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!117, !47, !47}
!830 = !DISubroutineType(types: !831)
!831 = !{!52, !112, !52}
!832 = !DISubroutineType(types: !833)
!833 = !{null, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!837, !52, !752, !764, !767, !770}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !837}
!840 = !DISubroutineType(types: !841)
!841 = !{!117, !837, !52}
!842 = !DISubroutineType(types: !843)
!843 = !{!5, !837, !428, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!47, !837, !428}
!847 = !DISubroutineType(types: !848)
!848 = !{!740, !733, !428}
!849 = !DISubroutineType(types: !850)
!850 = !{!117, !837}
!851 = !DISubroutineType(types: !852)
!852 = !{!52, !52, !752}
!853 = !DISubroutineType(types: !854)
!854 = !{!52, !52}
!855 = !DISubroutineType(types: !856)
!856 = !{!117, !52}
!857 = !DISubroutineType(types: !858)
!858 = !{!117, !837, !837, !117}
!859 = !DISubroutineType(types: !860)
!860 = !{null, !837, !740}
!861 = !DISubroutineType(types: !862)
!862 = !{!47, !837, !428, !863, !117}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!740, !837}
!866 = !{!726}
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "program_name", scope: !869, file: !911, line: 33, type: !112, isLocal: false, isDefinition: true)
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !871, globals: !910, nameTableKind: None)
!870 = !DIFile(filename: "./lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!871 = !{!47, !7, !112, !133, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2, line: 241, size: 1728, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !873, file: !2, line: 242, baseType: !5, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !873, file: !2, line: 247, baseType: !7, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !873, file: !2, line: 248, baseType: !7, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !873, file: !2, line: 249, baseType: !7, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !873, file: !2, line: 250, baseType: !7, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !873, file: !2, line: 251, baseType: !7, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !873, file: !2, line: 252, baseType: !7, size: 64, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !873, file: !2, line: 253, baseType: !7, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !873, file: !2, line: 254, baseType: !7, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !873, file: !2, line: 256, baseType: !7, size: 64, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !873, file: !2, line: 257, baseType: !7, size: 64, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !873, file: !2, line: 258, baseType: !7, size: 64, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !873, file: !2, line: 260, baseType: !888, size: 64, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2, line: 156, size: 192, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !889, file: !2, line: 157, baseType: !888, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !889, file: !2, line: 158, baseType: !872, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !889, file: !2, line: 162, baseType: !5, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !873, file: !2, line: 262, baseType: !872, size: 64, offset: 832)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !873, file: !2, line: 264, baseType: !5, size: 32, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !873, file: !2, line: 268, baseType: !5, size: 32, offset: 928)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !873, file: !2, line: 270, baseType: !30, size: 64, offset: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !873, file: !2, line: 274, baseType: !34, size: 16, offset: 1024)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !873, file: !2, line: 275, baseType: !36, size: 8, offset: 1040)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !873, file: !2, line: 276, baseType: !38, size: 8, offset: 1048)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !873, file: !2, line: 280, baseType: !42, size: 64, offset: 1088)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !873, file: !2, line: 289, baseType: !45, size: 64, offset: 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !873, file: !2, line: 297, baseType: !47, size: 64, offset: 1216)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !873, file: !2, line: 298, baseType: !47, size: 64, offset: 1280)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !873, file: !2, line: 299, baseType: !47, size: 64, offset: 1344)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !873, file: !2, line: 300, baseType: !47, size: 64, offset: 1408)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !873, file: !2, line: 302, baseType: !52, size: 64, offset: 1472)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !873, file: !2, line: 303, baseType: !5, size: 32, offset: 1536)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !873, file: !2, line: 305, baseType: !57, size: 160, offset: 1568)
!910 = !{!867}
!911 = !DIFile(filename: "lib/progname.c", directory: "/home/mohamad/clone/coreutils")
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !914, file: !943, line: 85, type: !932, isLocal: false, isDefinition: true)
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480) (llvm/llvm-project 0399d5a9682b3cef71c653373e38890c63c4c365)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !916, retainedTypes: !931, globals: !1038, nameTableKind: None)
!915 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!916 = !{!917}
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !918, line: 32, baseType: !67, size: 32, elements: !919)
!918 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mohamad/clone/coreutils")
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!920 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!921 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!922 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!923 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!924 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!925 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!926 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!927 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!928 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!929 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!930 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!931 = !{!5, !34, !52, !932, !935, !939, !941, !951, !953, !955, !957, !8, !468, !959, !67, !960, !962, !112, !964, !7, !966, !968, !599, !131, !970, !532, !975, !977, !979, !981, !983, !985, !987, !989, !991, !993, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1011, !1013, !117, !113, !1015, !1017, !1031, !1032, !1034, !1036}
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 704, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 11)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 320, elements: !937)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!937 = !{!938}
!938 = !DISubrange(count: 10)
!939 = !DISubroutineType(types: !940)
!940 = !{!941, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !943, line: 65, size: 448, elements: !944)
!943 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mohamad/clone/coreutils")
!944 = !{!945, !946, !947, !949, !950}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !942, file: !943, line: 68, baseType: !917, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !943, line: 71, baseType: !5, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !942, file: !943, line: 75, baseType: !948, size: 256, offset: 64)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, elements: !613)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !942, file: !943, line: 78, baseType: !112, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !942, file: !943, line: 81, baseType: !112, size: 64, offset: 384)
!951 = !DISubroutineType(types: !952)
!952 = !{!917, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !941, !917}
!957 = !DISubroutineType(types: !958)
!958 = !{!5, !941, !8, !5}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!5, !941, !5}
!962 = !DISubroutineType(types: !963)
!963 = !{null, !941, !112, !112}
!964 = !DISubroutineType(types: !965)
!965 = !{!52, !7, !52, !112, !52, !953}
!966 = !DISubroutineType(types: !967)
!967 = !{!7, !112, !52, !953}
!968 = !DISubroutineType(types: !969)
!969 = !{!7, !112, !52, !599, !953}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !943, line: 834, size: 128, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !971, file: !943, line: 836, baseType: !52, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !971, file: !943, line: 837, baseType: !7, size: 64, offset: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!7, !5, !112}
!977 = !DISubroutineType(types: !978)
!978 = !{!7, !5, !112, !52}
!979 = !DISubroutineType(types: !980)
!980 = !{!7, !112}
!981 = !DISubroutineType(types: !982)
!982 = !{!7, !112, !52}
!983 = !DISubroutineType(types: !984)
!984 = !{!7, !5, !917, !112}
!985 = !DISubroutineType(types: !986)
!986 = !{!7, !5, !917, !112, !52}
!987 = !DISubroutineType(types: !988)
!988 = !{!7, !917, !112}
!989 = !DISubroutineType(types: !990)
!990 = !{!7, !917, !112, !52}
!991 = !DISubroutineType(types: !992)
!992 = !{!7, !112, !52, !8}
!993 = !DISubroutineType(types: !994)
!994 = !{!7, !112, !8}
!995 = !DISubroutineType(types: !996)
!996 = !{!7, !5, !112, !112, !112}
!997 = !DISubroutineType(types: !998)
!998 = !{!7, !5, !112, !112, !112, !52}
!999 = !DISubroutineType(types: !1000)
!1000 = !{!7, !112, !112, !112}
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!7, !112, !112, !112, !52}
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!112, !5, !112, !52}
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!112, !112, !52}
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!112, !5, !112}
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!112, !112}
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!52, !7, !52, !112, !52, !917, !5, !1013, !112, !112}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1018, line: 106, baseType: !1019)
!1018 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1018, line: 94, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1018, line: 82, size: 64, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1020, file: !1018, line: 84, baseType: !5, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1020, file: !1018, line: 93, baseType: !1024, size: 32, offset: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !1018, line: 85, size: 32, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1024, file: !1018, line: 88, baseType: !67, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1024, file: !1018, line: 92, baseType: !1028, size: 32)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 4)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !53, line: 74, baseType: !5)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!112, !112, !917}
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!7, !5, !112, !52, !953}
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!942, !917}
!1038 = !{!912, !1039, !1041, !1043, !1045, !1047, !1049, !1051}
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !914, file: !943, line: 101, type: !935, isLocal: false, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !914, file: !943, line: 1052, type: !942, isLocal: false, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !914, file: !943, line: 116, type: !942, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "slot0", scope: !914, file: !943, line: 842, type: !532, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "slotvec", scope: !914, file: !943, line: 845, type: !970, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "nslots", scope: !914, file: !943, line: 843, type: !5, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "slotvec0", scope: !914, file: !943, line: 844, type: !971, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !1055, file: !1070, line: 74, type: !1080, isLocal: true, isDefinition: true)
