; ModuleID = 'mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 56, type: !153, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !112, globals: !268, nameTableKind: None)
!66 = !DIFile(filename: "src/mv.c", directory: "/home/mbarbar/software/coreutils-8.31")
!67 = !{!68, !76, !83, !89, !95, !100, !106}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !69, line: 30, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/mbarbar/software/coreutils-8.31")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !77, line: 69, baseType: !70, size: 32, elements: !78)
!77 = !DIFile(filename: "src/copy.h", directory: "/home/mbarbar/software/coreutils-8.31")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !77, line: 60, baseType: !70, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !77, line: 26, baseType: !70, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !77, line: 47, baseType: !70, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !101, line: 23, baseType: !70, size: 32, elements: !102)
!101 = !DIFile(filename: "src/remove.h", directory: "/home/mbarbar/software/coreutils-8.31")
!102 = !{!103, !104, !105}
!103 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !101, line: 78, baseType: !70, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!110 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!112 = !{!9, !53, !0, !113, !116, !118, !121, !124, !127, !130, !133, !136, !139, !7, !142, !143, !37, !144, !147, !150, !153, !165, !60, !168, !169, !172, !173, !176, !179, !182, !185, !188, !191, !194, !197, !200, !203, !206, !209, !222, !223, !224, !227, !230, !233, !236, !239, !241, !245, !248, !251, !254, !264, !267}
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 312, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 39)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1016, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 127)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 448, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 56)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 3344, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 418)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1472, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 184)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4216, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 527)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 360, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 45)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 432, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 54)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 24, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 80, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 10)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 24)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 104, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 13)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 3584, elements: !163)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !156, line: 50, size: 256, elements: !157)
!156 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!157 = !{!158, !159, !160, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 52, baseType: !116, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !155, file: !156, line: 55, baseType: !7, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !155, file: !156, line: 56, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !155, file: !156, line: 57, baseType: !7, size: 32, offset: 192)
!163 = !{!164}
!164 = !DISubrange(count: 14)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 304, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 38)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !70)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 232, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 29)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, elements: !163)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 12)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 168, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 21)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 336, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 42)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 560, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 70)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 136, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 17)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 72, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 9)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 184, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 23)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 456, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 57)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 600, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 75)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1768, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 221)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1776, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 222)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 896, elements: !220)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !213, file: !212, line: 633, size: 128, elements: !217)
!212 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!213 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 631, type: !214, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !116}
!216 = !{}
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !211, file: !212, line: 633, baseType: !116, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !212, line: 633, baseType: !116, size: 64, offset: 64)
!220 = !{!221}
!221 = !DISubrange(count: 7)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 184, elements: !195)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 40)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 4)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 568, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 71)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 216, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 27)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 408, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 51)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !240, line: 69, baseType: !168)
!240 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !243, line: 69, baseType: !244)
!243 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !243, line: 67, flags: DIFlagFwdDecl)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 2)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 176, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 22)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 552, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 69)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !256, line: 7, size: 128, elements: !257)
!256 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/mbarbar/software/coreutils-8.31")
!257 = !{!258, !261}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !255, file: !256, line: 9, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !240, line: 47, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !255, file: !256, line: 10, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !240, line: 59, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 248, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 31)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !246)
!268 = !{!269, !63, !271}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !65, file: !66, line: 54, type: !142, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !273, file: !66, line: 96, type: !255, isLocal: true, isDefinition: true)
!273 = distinct !DISubprogram(name: "rm_option_init", scope: !66, file: !66, line: 75, type: !274, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !216)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !101, line: 32, size: 256, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !277, file: !101, line: 35, baseType: !142, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !277, file: !101, line: 38, baseType: !100, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !277, file: !101, line: 47, baseType: !142, size: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !277, file: !101, line: 50, baseType: !142, size: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !277, file: !101, line: 53, baseType: !142, size: 8, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !277, file: !101, line: 57, baseType: !254, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !277, file: !101, line: 61, baseType: !142, size: 8, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !277, file: !101, line: 64, baseType: !142, size: 8, offset: 200)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !277, file: !101, line: 67, baseType: !142, size: 8, offset: 208)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !277, file: !101, line: 75, baseType: !142, size: 8, offset: 216)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !291, file: !292, line: 147, type: !116, isLocal: true, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !293, retainedTypes: !294, globals: !464, nameTableKind: None)
!292 = !DIFile(filename: "src/copy.c", directory: "/home/mbarbar/software/coreutils-8.31")
!293 = !{!68, !76, !83, !89, !95}
!294 = !{!239, !53, !70, !9, !57, !55, !295, !142, !7, !297, !300, !236, !303, !241, !147, !306, !309, !116, !312, !315, !165, !318, !321, !168, !224, !248, !324, !327, !263, !260, !330, !333, !188, !336, !173, !337, !133, !136, !191, !368, !179, !369, !372, !375, !259, !262, !233, !117, !267, !381, !384, !29, !169, !264, !346, !348, !387, !390, !60, !391, !393, !150, !396, !399, !433, !10, !172, !176, !121, !353, !355, !436, !443, !446, !448, !450, !449, !451, !452, !453}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !296, line: 63, baseType: !29)
!296 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 400, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 50)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 296, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 37)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 328, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 41)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 88, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 11)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 728, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 91)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 376, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 47)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 288, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 36)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 584, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 73)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 120, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 15)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 392, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 49)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 224, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 28)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 416, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 52)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 344, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 43)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !339, line: 46, size: 1152, elements: !340)
!339 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!340 = !{!341, !342, !343, !344, !345, !347, !349, !350, !351, !352, !354, !356, !364, !365, !366}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !338, file: !339, line: 48, baseType: !263, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !338, file: !339, line: 53, baseType: !260, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !338, file: !339, line: 61, baseType: !336, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !338, file: !339, line: 62, baseType: !168, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !338, file: !339, line: 64, baseType: !346, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !70)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !338, file: !339, line: 65, baseType: !348, size: 32, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !70)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !338, file: !339, line: 67, baseType: !7, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !338, file: !339, line: 69, baseType: !263, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !338, file: !339, line: 74, baseType: !29, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !338, file: !339, line: 78, baseType: !353, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !338, file: !339, line: 80, baseType: !355, size: 64, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !338, file: !339, line: 91, baseType: !357, size: 128, offset: 576)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !358, line: 9, size: 128, elements: !359)
!358 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!359 = !{!360, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !357, file: !358, line: 11, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !357, file: !358, line: 12, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !338, file: !339, line: 92, baseType: !357, size: 128, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !338, file: !339, line: 93, baseType: !357, size: 128, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !338, file: !339, line: 106, baseType: !367, size: 192, offset: 960)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 192, elements: !140)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 376, elements: !313)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 480, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 60)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 8)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list", file: !292, line: 125, size: 192, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !376, file: !292, line: 127, baseType: !375, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !376, file: !292, line: 128, baseType: !259, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !376, file: !292, line: 129, baseType: !262, size: 64, offset: 128)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 504, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 63)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 240, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 30)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 200, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 25)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 256, elements: !246)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 264, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 33)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 648, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 81)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !401, file: !4, line: 51, baseType: !7, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !401, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !401, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !401, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !401, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !401, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !401, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !401, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !401, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !401, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !401, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !401, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !401, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !401, file: !4, line: 70, baseType: !417, size: 64, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !401, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !401, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !401, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !401, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !401, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !401, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !401, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !401, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !401, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !401, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !401, file: !4, line: 93, baseType: !417, size: 64, offset: 1344)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !401, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !401, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !401, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !401, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 152, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 19)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !438, line: 23, size: 192, elements: !439)
!438 = !DIFile(filename: "src/extent-scan.h", directory: "/home/mbarbar/software/coreutils-8.31")
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !437, file: !438, line: 26, baseType: !295, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !437, file: !438, line: 29, baseType: !295, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !437, file: !438, line: 32, baseType: !70, size: 32, offset: 128)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 1024)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !296, line: 77, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !240, line: 79, baseType: !346)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !240, line: 64, baseType: !348)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !296, line: 52, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !455, line: 32, baseType: !456)
!455 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stdarg.h", directory: "/home/mbarbar/software")
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !292, line: 623, baseType: !457)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 192, elements: !38)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !292, line: 623, size: 192, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !458, file: !292, line: 623, baseType: !70, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !458, file: !292, line: 623, baseType: !70, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !458, file: !292, line: 623, baseType: !53, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !458, file: !292, line: 623, baseType: !53, size: 64, offset: 128)
!464 = !{!465, !289, !470, !472, !477, !479}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "mask", scope: !467, file: !292, line: 3051, type: !239, isLocal: true, isDefinition: true)
!467 = distinct !DISubprogram(name: "cached_umask", scope: !292, file: !292, line: 3049, type: !468, scopeLine: 3050, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !291, retainedNodes: !216)
!468 = !DISubroutineType(types: !469)
!469 = !{!239}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !291, file: !292, line: 148, type: !116, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "zeros", scope: !474, file: !292, line: 351, type: !9, isLocal: true, isDefinition: true)
!474 = distinct !DISubprogram(name: "write_zeros", scope: !292, file: !292, line: 349, type: !475, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, retainedNodes: !216)
!475 = !DISubroutineType(types: !476)
!476 = !{!142, !7, !295}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "nz", scope: !474, file: !292, line: 352, type: !55, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "fallback", scope: !474, file: !292, line: 359, type: !443, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !483, file: !484, line: 45, type: !241, isLocal: true, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !485, globals: !497, nameTableKind: None)
!484 = !DIFile(filename: "src/cp-hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!485 = !{!53, !9, !486, !489, !259, !262, !241, !495}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !487, line: 102, baseType: !488)
!487 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Src_to_dest", file: !484, line: 33, size: 192, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !490, file: !484, line: 35, baseType: !259, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !490, file: !484, line: 36, baseType: !262, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !484, line: 40, baseType: !9, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!497 = !{!481}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !500, file: !501, line: 38, type: !507, isLocal: true, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !502, globals: !520, nameTableKind: None)
!501 = !DIFile(filename: "src/force-link.c", directory: "/home/mbarbar/software/coreutils-8.31")
!502 = !{!7, !503, !9, !506, !55, !507, !508, !116, !515}
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 72, elements: !192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_arg", file: !501, line: 71, size: 192, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "srcdir", scope: !509, file: !501, line: 73, baseType: !7, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !509, file: !501, line: 74, baseType: !116, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !509, file: !501, line: 75, baseType: !7, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !501, line: 76, baseType: !7, size: 32, offset: 160)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symlink_arg", file: !501, line: 131, size: 128, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "srcname", scope: !516, file: !501, line: 133, baseType: !116, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dstdir", scope: !516, file: !501, line: 134, baseType: !7, size: 32, offset: 64)
!520 = !{!498}
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "Version", scope: !523, file: !524, line: 2, type: !116, isLocal: false, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !525, globals: !526, nameTableKind: None)
!524 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!525 = !{!116}
!526 = !{!521}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !529, file: !533, line: 82, type: !116, isLocal: false, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !531, retainedTypes: !539, globals: !557, nameTableKind: None)
!530 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!531 = !{!68, !532}
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !533, line: 172, baseType: !70, size: 32, elements: !534)
!533 = !DIFile(filename: "lib/backupfile.c", directory: "/home/mbarbar/software/coreutils-8.31")
!534 = !{!535, !536, !537, !538}
!535 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!536 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!537 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!538 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!539 = !{!53, !70, !55, !116, !179, !117, !267, !506, !540, !9, !541, !7, !10, !545, !554, !142, !503, !31}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !240, line: 108, baseType: !447)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !543, line: 127, baseType: !544)
!543 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !543, line: 127, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !547, line: 22, size: 2240, elements: !548)
!547 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!548 = !{!549, !550, !551, !552, !553}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !546, file: !547, line: 25, baseType: !260, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !546, file: !547, line: 26, baseType: !29, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !546, file: !547, line: 31, baseType: !33, size: 16, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !546, file: !547, line: 32, baseType: !450, size: 8, offset: 144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !546, file: !547, line: 33, baseType: !503, size: 2048, offset: 152)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 40, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 5)
!557 = !{!527}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "backup_args", scope: !560, file: !576, line: 42, type: !566, isLocal: true, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !562, retainedTypes: !563, globals: !573, nameTableKind: None)
!561 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!562 = !{!68}
!563 = !{!116, !9, !117, !564, !566, !568, !188, !176}
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 256, elements: !373)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 576, elements: !192)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !569, line: 55, baseType: !570)
!569 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null}
!573 = !{!574, !558}
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "backup_types", scope: !560, file: !576, line: 53, type: !564, isLocal: true, isDefinition: true)
!576 = !DIFile(filename: "lib/backup-find.c", directory: "/home/mbarbar/software/coreutils-8.31")
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "file_name", scope: !579, file: !619, line: 37, type: !116, isLocal: true, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !581, globals: !618, nameTableKind: None)
!580 = !DIFile(filename: "./lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!581 = !{!116, !142, !582, !433, !7, !616, !139, !617}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !584, file: !4, line: 51, baseType: !7, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !584, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !584, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !584, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !584, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !584, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !584, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !584, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !584, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !584, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !584, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !584, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !584, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !584, file: !4, line: 70, baseType: !600, size: 64, offset: 832)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !584, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !584, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !584, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !584, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !584, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !584, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !584, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !584, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !584, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !584, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !584, file: !4, line: 93, baseType: !600, size: 64, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !584, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !584, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !584, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !584, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 56, elements: !220)
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!618 = !{!577}
!619 = !DIFile(filename: "lib/closein.c", directory: "/home/mbarbar/software/coreutils-8.31")
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "file_name", scope: !622, file: !662, line: 46, type: !116, isLocal: true, isDefinition: true)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !624, globals: !659, nameTableKind: None)
!623 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!624 = !{!116, !142, !625, !7, !173, !616, !139, !617}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !627, file: !4, line: 51, baseType: !7, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !627, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !627, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !627, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !627, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !627, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !627, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !627, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !627, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !627, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !627, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !627, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !627, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !627, file: !4, line: 70, baseType: !643, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !627, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !627, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !627, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !627, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !627, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !627, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !627, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !627, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !627, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !627, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !627, file: !4, line: 93, baseType: !643, size: 64, offset: 1344)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !627, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !627, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !627, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !627, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!659 = !{!620, !660}
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !622, file: !662, line: 56, type: !142, isLocal: true, isDefinition: true)
!662 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "exit_failure", scope: !665, file: !669, line: 24, type: !617, isLocal: false, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !667, globals: !668, nameTableKind: None)
!666 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!667 = !{!617}
!668 = !{!663}
!669 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "default_tuning", scope: !672, file: !678, line: 130, type: !694, isLocal: true, isDefinition: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !674, globals: !724, nameTableKind: None)
!673 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!674 = !{!57, !53, !55, !675, !687, !681, !147, !393, !712, !722, !450, !117, !694, !723, !676, !693, !705, !717, !709, !699, !142, !7}
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !243, line: 69, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !678, line: 52, size: 640, elements: !679)
!678 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!679 = !{!680, !686, !689, !690, !691, !692, !704, !711, !716, !721}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !677, file: !678, line: 57, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !678, line: 46, size: 128, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !682, file: !678, line: 48, baseType: !53, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !678, line: 49, baseType: !681, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !677, file: !678, line: 58, baseType: !687, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !677, file: !678, line: 59, baseType: !55, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !677, file: !678, line: 60, baseType: !55, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !677, file: !678, line: 61, baseType: !55, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !677, file: !678, line: 64, baseType: !693, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !243, line: 65, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !243, line: 53, size: 160, elements: !697)
!697 = !{!698, !700, !701, !702, !703}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !696, file: !243, line: 58, baseType: !699, size: 32)
!699 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !696, file: !243, line: 59, baseType: !699, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !696, file: !243, line: 60, baseType: !699, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !696, file: !243, line: 61, baseType: !699, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !696, file: !243, line: 62, baseType: !142, size: 8, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !677, file: !678, line: 71, baseType: !705, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !243, line: 48, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!55, !709, !55}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !677, file: !678, line: 72, baseType: !712, size: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !243, line: 49, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!142, !709, !709}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !677, file: !678, line: 73, baseType: !717, size: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !243, line: 50, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !53}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !677, file: !678, line: 76, baseType: !681, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!724 = !{!670}
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "program_name", scope: !727, file: !765, line: 33, type: !116, isLocal: false, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !729, globals: !764, nameTableKind: None)
!728 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!729 = !{!53, !9, !116, !121, !730, !117, !372, !227}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !732, file: !4, line: 51, baseType: !7, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !732, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !732, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !732, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !732, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !732, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !732, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !732, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !732, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !732, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !732, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !732, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !732, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !732, file: !4, line: 70, baseType: !748, size: 64, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !732, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !732, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !732, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !732, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !732, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !732, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !732, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !732, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !732, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !732, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !732, file: !4, line: 93, baseType: !748, size: 64, offset: 1344)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !732, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !732, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !732, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !732, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!764 = !{!725}
!765 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !768, file: !791, line: 85, type: !786, isLocal: false, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !770, retainedTypes: !785, globals: !828, nameTableKind: None)
!769 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!770 = !{!771}
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !772, line: 32, baseType: !70, size: 32, elements: !773)
!772 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/mbarbar/software/coreutils-8.31")
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!774 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!775 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!776 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!777 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!778 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!779 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!780 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!781 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!782 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!783 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!784 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!785 = !{!7, !33, !55, !786, !787, !789, !450, !799, !796, !70, !116, !800, !802, !9, !803, !503, !142, !267, !117, !808, !810, !822, !823, !825, !227, !372, !139}
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 704, elements: !307)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 320, elements: !145)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !791, line: 65, size: 448, elements: !792)
!791 = !DIFile(filename: "lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!792 = !{!793, !794, !795, !797, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !790, file: !791, line: 68, baseType: !771, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !791, line: 71, baseType: !7, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !790, file: !791, line: 75, baseType: !796, size: 256, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, elements: !373)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !790, file: !791, line: 78, baseType: !116, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !790, file: !791, line: 81, baseType: !116, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !791, line: 834, size: 128, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !791, line: 836, baseType: !55, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !804, file: !791, line: 837, baseType: !9, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !811, line: 6, baseType: !812)
!811 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !813, line: 21, baseType: !814)
!813 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !813, line: 13, size: 64, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !814, file: !813, line: 15, baseType: !7, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !814, file: !813, line: 20, baseType: !818, size: 32, offset: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !814, file: !813, line: 16, size: 32, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !818, file: !813, line: 18, baseType: !70, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !818, file: !813, line: 19, baseType: !227, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !56, line: 74, baseType: !7)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 48, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 6)
!828 = !{!766, !829, !831, !833, !835, !837, !839, !841}
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !768, file: !791, line: 101, type: !787, isLocal: false, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !768, file: !791, line: 1052, type: !790, isLocal: false, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !768, file: !791, line: 116, type: !790, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "slot0", scope: !768, file: !791, line: 842, type: !503, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "slotvec", scope: !768, file: !791, line: 845, type: !803, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "nslots", scope: !768, file: !791, line: 843, type: !7, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "slotvec0", scope: !768, file: !791, line: 844, type: !804, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !845, file: !858, line: 74, type: !868, isLocal: true, isDefinition: true)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !847, retainedTypes: !855, globals: !882, nameTableKind: None)
!846 = !DIFile(filename: "./lib/savedir.c", directory: "/home/mbarbar/software/coreutils-8.31")
!847 = !{!848}
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !849, line: 26, baseType: !70, size: 32, elements: !850)
!849 = !DIFile(filename: "./lib/savedir.h", directory: "/home/mbarbar/software/coreutils-8.31")
!850 = !{!851, !852, !853, !854}
!851 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!852 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!853 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!854 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!855 = !{!53, !9, !55, !856, !7, !864, !868, !870, !116, !879, !857, !260, !863, !10, !541, !880, !881}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "direntry_t", file: !858, line: 46, baseType: !859)
!858 = !DIFile(filename: "lib/savedir.c", directory: "/home/mbarbar/software/coreutils-8.31")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !858, line: 40, size: 128, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !859, file: !858, line: 42, baseType: !9, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !859, file: !858, line: 44, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !543, line: 34, baseType: !260)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !858, line: 72, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!7, !709, !709}
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 192, elements: !140)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !547, line: 22, size: 2240, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !872, file: !547, line: 25, baseType: !260, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !872, file: !547, line: 26, baseType: !29, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !872, file: !547, line: 31, baseType: !33, size: 16, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !872, file: !547, line: 32, baseType: !450, size: 8, offset: 144)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !872, file: !547, line: 33, baseType: !503, size: 2048, offset: 152)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!882 = !{!843}
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "letters", scope: !885, file: !900, line: 184, type: !891, isLocal: true, isDefinition: true)
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !887, globals: !899, nameTableKind: None)
!886 = !DIFile(filename: "./lib/tempname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!887 = !{!55, !9, !70, !7, !888, !891, !892, !895, !321, !898, !267, !161}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !890, line: 33, flags: DIFlagFwdDecl)
!890 = !DIFile(filename: "./lib/randint.h", directory: "/home/mbarbar/software/coreutils-8.31")
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 504, elements: !382)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!7, !9, !53}
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 280, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 35)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 416, elements: !331)
!899 = !{!883}
!900 = !DIFile(filename: "lib/tempname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "ht", scope: !903, file: !904, line: 163, type: !241, isLocal: true, isDefinition: true)
!903 = distinct !DISubprogram(name: "utimecmpat", scope: !904, file: !904, line: 132, type: !905, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !930, retainedNodes: !216)
!904 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/mbarbar/software/coreutils-8.31")
!905 = !DISubroutineType(types: !906)
!906 = !{!7, !7, !116, !907, !907, !7}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !339, line: 46, size: 1152, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !927, !928, !929}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !909, file: !339, line: 48, baseType: !263, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !909, file: !339, line: 53, baseType: !260, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !909, file: !339, line: 61, baseType: !336, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !909, file: !339, line: 62, baseType: !168, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !909, file: !339, line: 64, baseType: !346, size: 32, offset: 224)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !909, file: !339, line: 65, baseType: !348, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !909, file: !339, line: 67, baseType: !7, size: 32, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !909, file: !339, line: 69, baseType: !263, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !909, file: !339, line: 74, baseType: !29, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !909, file: !339, line: 78, baseType: !353, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !909, file: !339, line: 80, baseType: !355, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !909, file: !339, line: 91, baseType: !923, size: 128, offset: 576)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !358, line: 9, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !923, file: !358, line: 11, baseType: !361, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !923, file: !358, line: 12, baseType: !363, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !909, file: !339, line: 92, baseType: !923, size: 128, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !909, file: !339, line: 93, baseType: !923, size: 128, offset: 832)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !909, file: !339, line: 106, baseType: !367, size: 192, offset: 960)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !932, globals: !944, nameTableKind: None)
!931 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/mbarbar/software/coreutils-8.31")
!932 = !{!933, !361, !7, !935, !142, !263, !262, !941, !363, !942}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !934, line: 7, baseType: !361)
!934 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !904, line: 66, size: 128, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !936, file: !904, line: 69, baseType: !262, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !936, file: !904, line: 76, baseType: !7, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !936, file: !904, line: 80, baseType: !142, size: 8, offset: 96)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, elements: !246)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!944 = !{!901, !945}
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !903, file: !904, line: 166, type: !935, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !949, file: !969, line: 75, type: !7, isLocal: true, isDefinition: true)
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !951, globals: !966, nameTableKind: None)
!950 = !DIFile(filename: "./lib/utimens.c", directory: "/home/mbarbar/software/coreutils-8.31")
!951 = !{!952, !957, !7, !363, !958, !965, !361, !964, !142, !933, !168}
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 256, elements: !246)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !358, line: 9, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !953, file: !358, line: 11, baseType: !361, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !953, file: !358, line: 12, baseType: !363, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 256, elements: !246)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !960, line: 8, size: 128, elements: !961)
!960 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !959, file: !960, line: 10, baseType: !361, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !959, file: !960, line: 11, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !30, line: 162, baseType: !31)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!966 = !{!947, !967}
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !949, file: !969, line: 76, type: !7, isLocal: true, isDefinition: true)
!969 = !DIFile(filename: "lib/utimens.c", directory: "/home/mbarbar/software/coreutils-8.31")
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !972, file: !976, line: 26, type: !312, isLocal: false, isDefinition: true)
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !974, globals: !975, nameTableKind: None)
!973 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/mbarbar/software/coreutils-8.31")
!974 = !{!312}
!975 = !{!970}
!976 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/mbarbar/software/coreutils-8.31")
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "initialized", scope: !979, file: !980, line: 34, type: !142, isLocal: true, isDefinition: true)
!979 = distinct !DISubprogram(name: "can_write_any_file", scope: !980, file: !980, line: 32, type: !981, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !983, retainedNodes: !216)
!980 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/mbarbar/software/coreutils-8.31")
!981 = !DISubroutineType(types: !982)
!982 = !{!142}
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !982, globals: !985, nameTableKind: None)
!984 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/mbarbar/software/coreutils-8.31")
!985 = !{!977, !986}
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "can_write", scope: !979, file: !980, line: 35, type: !142, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !990, file: !1029, line: 69, type: !568, isLocal: false, isDefinition: true)
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !992, globals: !1028, nameTableKind: None)
!991 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!992 = !{!53, !568, !55, !506, !142, !993, !117, !116, !233, !169, !179, !994, !372, !554}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !996, file: !4, line: 51, baseType: !7, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !996, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !996, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !996, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !996, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !996, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !996, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !996, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !996, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !996, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !996, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !996, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !996, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !996, file: !4, line: 70, baseType: !1012, size: 64, offset: 832)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !996, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !996, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !996, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !996, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !996, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !996, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !996, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !996, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !996, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !996, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !996, file: !4, line: 93, baseType: !1012, size: 64, offset: 1344)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !996, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !996, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !996, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !996, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!1028 = !{!988}
!1029 = !DIFile(filename: "lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1032, file: !1033, line: 506, type: !7, isLocal: true, isDefinition: true)
!1032 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1033, file: !1033, line: 487, type: !1034, scopeLine: 488, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1036, retainedNodes: !216)
!1033 = !DIFile(filename: "lib/fcntl.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!7, !7, !7}
