; ModuleID = 'sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct.line = type { i8*, i64, i8*, i8* }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.month = type { i8*, i32 }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !65, file: !66, line: 165, type: !103, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !82, globals: !718, nameTableKind: None)
!66 = !DIFile(filename: "src/sort.c", directory: "/home/mbarbar/software/coreutils-8.31")
!67 = !{!68, !74}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !66, line: 173, baseType: !69, size: 32, elements: !70)
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "bl_start", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "bl_end", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "bl_both", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !75, line: 26, baseType: !69, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/mbarbar/software/coreutils-8.31")
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!82 = !{!53, !83, !69, !88, !9, !7, !33, !86, !0, !90, !93, !103, !10, !55, !92, !116, !145, !155, !159, !253, !256, !89, !266, !269, !273, !275, !278, !281, !57, !101, !284, !287, !288, !168, !306, !308, !317, !318, !319, !322, !325, !327, !328, !335, !337, !341, !343, !297, !345, !352, !356, !358, !361, !364, !366, !368, !370, !371, !373, !376, !377, !378, !379, !381, !383, !394, !417, !419, !421, !425, !426, !428, !423, !430, !433, !436, !439, !441, !442, !445, !447, !455, !467, !469, !470, !472, !476, !478, !481, !483, !484, !321, !486, !487, !489, !491, !494, !498, !513, !516, !518, !520, !522, !524, !526, !528, !530, !532, !293, !534, !535, !537, !390, !388, !539, !542, !544, !299, !545, !547, !549, !553, !555, !557, !559, !560, !562, !564, !566, !457, !568, !360, !569, !570, !572, !574, !529, !576, !620, !624, !622, !29, !626, !628, !634, !676, !678, !584, !680, !683, !686, !687, !689, !696, !698, !700, !703, !705, !708, !710, !712, !714, !716}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !84, line: 72, baseType: !85)
!84 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !7}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!90 = !DISubroutineType(types: !91)
!91 = !{!7, !7, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !66, line: 204, size: 576, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !94, file: !66, line: 206, baseType: !55, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !94, file: !66, line: 207, baseType: !55, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !94, file: !66, line: 208, baseType: !55, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !94, file: !66, line: 209, baseType: !55, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !94, file: !66, line: 210, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !94, file: !66, line: 211, baseType: !88, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !94, file: !66, line: 212, baseType: !103, size: 8, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !94, file: !66, line: 213, baseType: !103, size: 8, offset: 392)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !94, file: !66, line: 214, baseType: !103, size: 8, offset: 400)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !94, file: !66, line: 217, baseType: !103, size: 8, offset: 408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !94, file: !66, line: 218, baseType: !103, size: 8, offset: 416)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !94, file: !66, line: 220, baseType: !103, size: 8, offset: 424)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !94, file: !66, line: 222, baseType: !103, size: 8, offset: 432)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !94, file: !66, line: 223, baseType: !103, size: 8, offset: 440)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !94, file: !66, line: 224, baseType: !103, size: 8, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !94, file: !66, line: 225, baseType: !103, size: 8, offset: 456)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !66, line: 226, baseType: !93, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !119, line: 51, size: 768, elements: !120)
!119 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !118, file: !119, line: 55, baseType: !9, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !118, file: !119, line: 56, baseType: !9, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !118, file: !119, line: 62, baseType: !9, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !118, file: !119, line: 68, baseType: !9, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !118, file: !119, line: 69, baseType: !9, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !118, file: !119, line: 70, baseType: !9, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !118, file: !119, line: 71, baseType: !9, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !118, file: !119, line: 72, baseType: !9, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !118, file: !119, line: 73, baseType: !9, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !118, file: !119, line: 74, baseType: !9, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !118, file: !119, line: 75, baseType: !10, size: 8, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !118, file: !119, line: 76, baseType: !10, size: 8, offset: 648)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !118, file: !119, line: 78, baseType: !10, size: 8, offset: 656)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !118, file: !119, line: 80, baseType: !10, size: 8, offset: 664)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !118, file: !119, line: 82, baseType: !10, size: 8, offset: 672)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !118, file: !119, line: 84, baseType: !10, size: 8, offset: 680)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !118, file: !119, line: 91, baseType: !10, size: 8, offset: 688)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !118, file: !119, line: 92, baseType: !10, size: 8, offset: 696)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !118, file: !119, line: 95, baseType: !10, size: 8, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !118, file: !119, line: 97, baseType: !10, size: 8, offset: 712)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !118, file: !119, line: 99, baseType: !10, size: 8, offset: 720)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !118, file: !119, line: 101, baseType: !10, size: 8, offset: 728)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !118, file: !119, line: 108, baseType: !10, size: 8, offset: 736)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !118, file: !119, line: 109, baseType: !10, size: 8, offset: 744)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !146, line: 7, baseType: !147)
!146 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !148, line: 8, baseType: !149)
!148 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 5, size: 1024, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !149, file: !148, line: 7, baseType: !152, size: 1024)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 16)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 352, elements: !157)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!157 = !{!158}
!158 = !DISubrange(count: 11)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !160, line: 31, size: 64, elements: !170)
!160 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !160, line: 27, size: 1216, elements: !162)
!162 = !{!163, !164, !165, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !161, file: !160, line: 38, baseType: !159, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !161, file: !160, line: 46, baseType: !147, size: 1024, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !161, file: !160, line: 49, baseType: !7, size: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !161, file: !160, line: 52, baseType: !167, size: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null}
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !159, file: !160, line: 34, baseType: !83, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !159, file: !160, line: 36, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !7, !176, !53}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !178, line: 124, baseType: !179)
!178 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 36, size: 1024, elements: !180)
!180 = !{!181, !182, !183, !184, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !179, file: !178, line: 38, baseType: !7, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !179, file: !178, line: 40, baseType: !7, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !179, file: !178, line: 42, baseType: !7, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !179, file: !178, line: 48, baseType: !7, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !179, file: !178, line: 123, baseType: !186, size: 896, offset: 128)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !178, line: 51, size: 896, elements: !187)
!187 = !{!188, !192, !199, !211, !217, !226, !242, !247}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !186, file: !178, line: 53, baseType: !189, size: 896)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 896, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 28)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !186, file: !178, line: 60, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 56, size: 64, elements: !194)
!194 = !{!195, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !193, file: !178, line: 58, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 154, baseType: !7)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !193, file: !178, line: 59, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !69)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !186, file: !178, line: 68, baseType: !200, size: 128)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 63, size: 128, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !200, file: !178, line: 65, baseType: !7, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !200, file: !178, line: 66, baseType: !7, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !200, file: !178, line: 67, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !206, line: 30, baseType: !207)
!206 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !206, line: 24, size: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !207, file: !206, line: 26, baseType: !7, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !207, file: !206, line: 27, baseType: !53, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !186, file: !178, line: 76, baseType: !212, size: 128)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 71, size: 128, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !212, file: !178, line: 73, baseType: !196, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !212, file: !178, line: 74, baseType: !198, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !212, file: !178, line: 75, baseType: !205, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !186, file: !178, line: 86, baseType: !218, size: 256)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 79, size: 256, elements: !219)
!219 = !{!220, !221, !222, !223, !225}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !218, file: !178, line: 81, baseType: !196, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !218, file: !178, line: 82, baseType: !198, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !218, file: !178, line: 83, baseType: !7, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !218, file: !178, line: 84, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !30, line: 156, baseType: !31)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !218, file: !178, line: 85, baseType: !224, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !186, file: !178, line: 105, baseType: !227, size: 256)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 89, size: 256, elements: !228)
!228 = !{!229, !230, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !227, file: !178, line: 91, baseType: !53, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !227, file: !178, line: 93, baseType: !231, size: 16, offset: 64)
!231 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !227, file: !178, line: 104, baseType: !233, size: 128, offset: 128)
!233 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !178, line: 94, size: 128, elements: !234)
!234 = !{!235, !240}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !233, file: !178, line: 101, baseType: !236, size: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !178, line: 97, size: 128, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !236, file: !178, line: 99, baseType: !53, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !236, file: !178, line: 100, baseType: !53, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !233, file: !178, line: 103, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !30, line: 42, baseType: !69)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !186, file: !178, line: 112, baseType: !243, size: 128)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 108, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !243, file: !178, line: 110, baseType: !31, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !243, file: !178, line: 111, baseType: !7, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !186, file: !178, line: 121, baseType: !248, size: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !178, line: 116, size: 128, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !248, file: !178, line: 118, baseType: !53, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !248, file: !178, line: 119, baseType: !7, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !248, file: !178, line: 120, baseType: !69, size: 32, offset: 96)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 248, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 31)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 7936, elements: !254)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !259, line: 50, size: 256, elements: !260)
!259 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!260 = !{!261, !262, !263, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !259, line: 52, baseType: !88, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !258, file: !259, line: 55, baseType: !7, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !258, file: !259, line: 56, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !258, file: !259, line: 57, baseType: !7, size: 32, offset: 192)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 48, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 6)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 448, elements: !271)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!271 = !{!272}
!272 = !DISubrange(count: 7)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !274, line: 55, baseType: !167)
!274 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 2)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 24, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 3)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 256, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 4)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 80, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 10)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 24, elements: !279)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !66, line: 672, size: 128, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !66, line: 675, baseType: !88, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !289, file: !66, line: 678, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !66, line: 661, size: 128, elements: !295)
!295 = !{!296, !298, !301, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !66, line: 663, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !293)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !294, file: !66, line: 664, baseType: !299, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !300, line: 38, baseType: !196)
!300 = !DIFile(filename: "/usr/include/sched.h", directory: "")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !294, file: !66, line: 665, baseType: !10, size: 8, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !66, line: 666, baseType: !303, offset: 104)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: -1)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !88}
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 896, elements: !271)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !312, file: !311, line: 633, size: 128, elements: !314)
!311 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!312 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !311, file: !311, line: 631, type: !306, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !313)
!313 = !{}
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !310, file: !311, line: 633, baseType: !88, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !310, file: !311, line: 633, baseType: !88, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !10}
!321 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2048, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !323)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 1536, elements: !333)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "month", file: !66, line: 229, size: 128, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !66, line: 231, baseType: !88, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !329, file: !66, line: 232, baseType: !7, size: 32, offset: 64)
!333 = !{!334}
!334 = !DISubrange(count: 12)
!335 = !DISubroutineType(types: !336)
!336 = !{!103, !321}
!337 = !DISubroutineType(types: !338)
!338 = !{!7, !339, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cs_status", file: !66, line: 630, size: 1088, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !348, file: !66, line: 632, baseType: !103, size: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sigs", scope: !348, file: !66, line: 633, baseType: !145, size: 1024, offset: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!356 = !DISubroutineType(types: !357)
!357 = !{!93, !93}
!358 = !DISubroutineType(types: !359)
!359 = !{!88, !88, !360, !88}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !362, line: 102, baseType: !363)
!362 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!364 = !DISubroutineType(types: !365)
!365 = !{!9, !88, !93, !68}
!366 = !DISubroutineType(types: !367)
!367 = !{null, !88, !88}
!368 = !DISubroutineType(types: !369)
!369 = !{null, !93}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !7, !10, !88}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !374, line: 131, baseType: !375)
!374 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !30, line: 157, baseType: !57)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 88, elements: !157)
!377 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!55, !7, !10, !88}
!381 = !DISubroutineType(types: !382)
!382 = !{!0, !88, !88}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !385, line: 46, size: 1152, elements: !386)
!385 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!386 = !{!387, !389, !391, !393, !395, !396, !398, !399, !400, !401, !403, !405, !413, !414, !415}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !384, file: !385, line: 48, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !384, file: !385, line: 53, baseType: !390, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !384, file: !385, line: 61, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !384, file: !385, line: 62, baseType: !394, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !69)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !384, file: !385, line: 64, baseType: !198, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !384, file: !385, line: 65, baseType: !397, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !69)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !384, file: !385, line: 67, baseType: !7, size: 32, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !384, file: !385, line: 69, baseType: !388, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !384, file: !385, line: 74, baseType: !29, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !384, file: !385, line: 78, baseType: !402, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !384, file: !385, line: 80, baseType: !404, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !384, file: !385, line: 91, baseType: !406, size: 128, offset: 576)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !407, line: 9, size: 128, elements: !408)
!407 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!408 = !{!409, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !406, file: !407, line: 11, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !406, file: !407, line: 12, baseType: !412, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !384, file: !385, line: 92, baseType: !406, size: 128, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !384, file: !385, line: 93, baseType: !406, size: 128, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !384, file: !385, line: 106, baseType: !416, size: 192, offset: 960)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 192, elements: !279)
!417 = !DISubroutineType(types: !418)
!418 = !{!383}
!419 = !DISubroutineType(types: !420)
!420 = !{null, !0, !88}
!421 = !DISubroutineType(types: !422)
!422 = !{!103, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 248, elements: !254)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !423, !9}
!428 = !DISubroutineType(types: !429)
!429 = !{null, !423, !103}
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 168, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 21)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 368, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 46)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 376, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 47)
!439 = !DISubroutineType(types: !440)
!440 = !{!57, !361}
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, elements: !153)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "randread_source", file: !444, line: 25, flags: DIFlagFwdDecl)
!444 = !DIFile(filename: "./lib/randread.h", directory: "/home/mbarbar/software/coreutils-8.31")
!445 = !DISubroutineType(types: !446)
!446 = !{!103, !88, !10}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !66, line: 179, size: 256, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !449, file: !66, line: 181, baseType: !9, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !449, file: !66, line: 182, baseType: !55, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "keybeg", scope: !449, file: !66, line: 183, baseType: !9, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "keylim", scope: !449, file: !66, line: 184, baseType: !9, size: 64, offset: 192)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !457, !55, !55}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !66, line: 188, size: 448, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !458, file: !66, line: 190, baseType: !9, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !458, file: !66, line: 195, baseType: !55, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !458, file: !66, line: 196, baseType: !55, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !458, file: !66, line: 197, baseType: !55, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !458, file: !66, line: 198, baseType: !55, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "line_bytes", scope: !458, file: !66, line: 199, baseType: !55, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !458, file: !66, line: 200, baseType: !103, size: 8, offset: 384)
!467 = !DISubroutineType(types: !468)
!468 = !{!103, !457, !0, !88}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!9, !447, !423}
!472 = !DISubroutineType(types: !473)
!473 = !{!469, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!476 = !DISubroutineType(types: !477)
!477 = !{!7, !447, !447}
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32000, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 4000)
!481 = !DISubroutineType(types: !482)
!482 = !{!7, !88, !88}
!483 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!484 = !DISubroutineType(types: !485)
!485 = !{!7, !88}
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !323)
!487 = !DISubroutineType(types: !488)
!488 = !{!321, !378}
!489 = !DISubroutineType(types: !490)
!490 = !{!7, !88, !92}
!491 = !DISubroutineType(types: !492)
!492 = !{!7, !493, !55, !493, !55}
!493 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 256, elements: !497)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !496, line: 26, baseType: !241)
!496 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!497 = !{!277, !283}
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 2496, elements: !276)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !500, line: 69, size: 1248, elements: !501)
!500 = !DIFile(filename: "./lib/md5.h", directory: "/home/mbarbar/software/coreutils-8.31")
!501 = !{!502, !503, !504, !505, !506, !508, !509}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !499, file: !500, line: 71, baseType: !495, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !499, file: !500, line: 72, baseType: !495, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !499, file: !500, line: 73, baseType: !495, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !499, file: !500, line: 74, baseType: !495, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !499, file: !500, line: 76, baseType: !507, size: 64, offset: 128)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !276)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !499, file: !500, line: 77, baseType: !495, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !499, file: !500, line: 78, baseType: !510, size: 1024, offset: 224)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 1024, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 32)
!513 = !DISubroutineType(types: !514)
!514 = !{!55, !493, !515, !55}
!515 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !88)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !447, !0, !88}
!518 = !DISubroutineType(types: !519)
!519 = !{null, !447}
!520 = !DISubroutineType(types: !521)
!521 = !{null, !447, !423}
!522 = !DISubroutineType(types: !523)
!523 = !{!55, !88, !88}
!524 = !DISubroutineType(types: !525)
!525 = !{null, !55, !55}
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528, !55}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !7, !7}
!532 = !DISubroutineType(types: !533)
!533 = !{null, !288, !55, !55, !88}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !0, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!293, !534}
!537 = !DISubroutineType(types: !538)
!538 = !{!55, !288, !55, !55, !0, !88}
!539 = !DISubroutineType(types: !540)
!540 = !{!55, !288, !55, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!0, !293}
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !276)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !299}
!547 = !DISubroutineType(types: !548)
!548 = !{!103, !299}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !551, line: 69, baseType: !552)
!551 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !551, line: 67, flags: DIFlagFwdDecl)
!553 = !DISubroutineType(types: !554)
!554 = !{!299, !299}
!555 = !DISubroutineType(types: !556)
!556 = !{!299, !264, !55}
!557 = !DISubroutineType(types: !558)
!558 = !{null, !7, !88}
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !333)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !293}
!562 = !DISubroutineType(types: !563)
!563 = !{!55, !339, !55}
!564 = !DISubroutineType(types: !565)
!565 = !{!103, !339, !339}
!566 = !DISubroutineType(types: !567)
!567 = !{null, !288, !55, !55, !0, !88, !534}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!293, !534, !103}
!572 = !DISubroutineType(types: !573)
!573 = !{!293, !264, !103}
!574 = !DISubroutineType(types: !575)
!575 = !{null, !528, !55, !88, !55}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "merge_node", file: !66, line: 236, size: 1024, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !585, !586, !587, !588, !589, !590, !591, !592}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !577, file: !66, line: 238, baseType: !469, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !577, file: !66, line: 239, baseType: !469, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "end_lo", scope: !577, file: !66, line: 240, baseType: !469, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "end_hi", scope: !577, file: !66, line: 241, baseType: !469, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !577, file: !66, line: 242, baseType: !584, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nlo", scope: !577, file: !66, line: 243, baseType: !55, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nhi", scope: !577, file: !66, line: 244, baseType: !55, size: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !577, file: !66, line: 245, baseType: !576, size: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lo_child", scope: !577, file: !66, line: 246, baseType: !576, size: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "hi_child", scope: !577, file: !66, line: 247, baseType: !576, size: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !577, file: !66, line: 248, baseType: !69, size: 32, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !577, file: !66, line: 249, baseType: !103, size: 8, offset: 672)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !577, file: !66, line: 250, baseType: !593, size: 320, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !594, line: 72, baseType: !595)
!594 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !594, line: 67, size: 320, elements: !596)
!596 = !{!597, !615, !619}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !595, file: !594, line: 69, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !599, line: 118, size: 320, elements: !600)
!599 = !DIFile(filename: "/usr/include/bits/thread-shared-types.h", directory: "")
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !598, file: !599, line: 120, baseType: !7, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !598, file: !599, line: 121, baseType: !69, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !598, file: !599, line: 122, baseType: !7, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !598, file: !599, line: 124, baseType: !69, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !598, file: !599, line: 148, baseType: !7, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !598, file: !599, line: 154, baseType: !231, size: 16, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !598, file: !599, line: 154, baseType: !231, size: 16, offset: 176)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !598, file: !599, line: 155, baseType: !609, size: 128, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !599, line: 86, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !599, line: 82, size: 128, elements: !611)
!611 = !{!612, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !610, file: !599, line: 84, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !610, file: !599, line: 85, baseType: !613, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !595, file: !594, line: 70, baseType: !616, size: 320)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 40)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !595, file: !594, line: 71, baseType: !31, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!55, !622, !55, !528, !55, !55}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !0)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !625, line: 85, baseType: !29)
!625 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!626 = !DISubroutineType(types: !627)
!627 = !{!55}
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630, !55}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "merge_node_queue", file: !66, line: 254, size: 768, elements: !632)
!632 = !{!633, !637, !638}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "priority_queue", scope: !631, file: !66, line: 256, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "heap", file: !636, line: 23, flags: DIFlagFwdDecl)
!636 = !DIFile(filename: "./lib/heap.h", directory: "/home/mbarbar/software/coreutils-8.31")
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !631, file: !66, line: 257, baseType: !593, size: 320, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !631, file: !66, line: 258, baseType: !639, size: 384, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !594, line: 80, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !594, line: 75, size: 384, elements: !641)
!641 = !{!642, !670, !674}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !640, file: !594, line: 77, baseType: !643, size: 384)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !599, line: 171, size: 384, elements: !644)
!644 = !{!645, !655, !664, !666, !667, !668, !669}
!645 = !DIDerivedType(tag: DW_TAG_member, scope: !643, file: !599, line: 173, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !643, file: !599, line: 173, size: 64, elements: !647)
!647 = !{!648, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !646, file: !599, line: 175, baseType: !649, size: 64)
!649 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !646, file: !599, line: 180, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !599, line: 176, size: 64, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !651, file: !599, line: 178, baseType: !69, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !651, file: !599, line: 179, baseType: !69, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, scope: !643, file: !599, line: 182, baseType: !656, size: 64, offset: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !643, file: !599, line: 182, size: 64, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !656, file: !599, line: 184, baseType: !649, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !656, file: !599, line: 189, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !599, line: 185, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !660, file: !599, line: 187, baseType: !69, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !660, file: !599, line: 188, baseType: !69, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !643, file: !599, line: 191, baseType: !665, size: 64, offset: 128)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !276)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !643, file: !599, line: 192, baseType: !665, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !643, file: !599, line: 193, baseType: !69, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !643, file: !599, line: 194, baseType: !69, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !643, file: !599, line: 195, baseType: !665, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !640, file: !594, line: 78, baseType: !671, size: 384)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 384, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 48)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !640, file: !594, line: 79, baseType: !675, size: 64)
!675 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!678 = !DISubroutineType(types: !679)
!679 = !{!576, !55, !55, !469}
!680 = !DISubroutineType(types: !681)
!681 = !{!576, !682, !682, !469, !55, !55, !103}
!682 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !576)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !685, !55, !55, !576, !630, !0, !88}
!685 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !469)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !594, line: 27, baseType: !57)
!687 = !DISubroutineType(types: !688)
!688 = !{!53, !53}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_args", file: !66, line: 3585, size: 448, elements: !692)
!692 = !{!693, !694, !695, !697, !699, !701, !702}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !691, file: !66, line: 3589, baseType: !469, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !691, file: !66, line: 3592, baseType: !55, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "total_lines", scope: !691, file: !66, line: 3595, baseType: !696, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !691, file: !66, line: 3599, baseType: !698, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !691, file: !66, line: 3603, baseType: !700, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tfp", scope: !691, file: !66, line: 3607, baseType: !0, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "output_temp", scope: !691, file: !66, line: 3608, baseType: !88, size: 64, offset: 384)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !685, !55, !685, !103}
!705 = !DISubroutineType(types: !706)
!706 = !{null, !685, !55, !707}
!707 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !447)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !630, !576}
!710 = !DISubroutineType(types: !711)
!711 = !{null, !630, !55, !0, !88}
!712 = !DISubroutineType(types: !713)
!713 = !{!576, !630}
!714 = !DISubroutineType(types: !715)
!715 = !{null, !576}
!716 = !DISubroutineType(types: !717)
!717 = !{null, !682, !55, !0, !88}
!718 = !{!719, !722, !724, !726, !728, !63, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !774, !776, !778, !780, !782, !784, !787, !789, !791, !793, !795, !797, !799, !801, !803, !807, !809, !812}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "sig", scope: !721, file: !66, line: 4257, type: !155, isLocal: true, isDefinition: true)
!721 = distinct !DISubprogram(name: "main", scope: !66, file: !66, line: 4199, type: !90, scopeLine: 4200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !65, retainedNodes: !313)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "opts", scope: !721, file: !66, line: 4677, type: !284, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "opts", scope: !721, file: !66, line: 4733, type: !287, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "decimal_point", scope: !65, file: !66, line: 159, type: !7, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !65, file: !66, line: 162, type: !7, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !65, file: !66, line: 167, type: !103, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "sort_size", scope: !65, file: !66, line: 319, type: !55, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !65, file: !66, line: 332, type: !55, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "reverse", scope: !65, file: !66, line: 338, type: !103, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "stable", scope: !65, file: !66, line: 343, type: !103, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "unique", scope: !65, file: !66, line: 355, type: !103, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !65, file: !66, line: 358, type: !103, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "keylist", scope: !65, file: !66, line: 361, type: !93, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "compress_program", scope: !65, file: !66, line: 364, type: !88, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "debug", scope: !65, file: !66, line: 367, type: !103, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "caught_signals", scope: !65, file: !66, line: 627, type: !145, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "blanks", scope: !65, file: !66, line: 272, type: !322, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "nonprinting", scope: !65, file: !66, line: 275, type: !322, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "nondictionary", scope: !65, file: !66, line: 278, type: !322, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "fold_toupper", scope: !65, file: !66, line: 281, type: !327, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "monthtab", scope: !65, file: !66, line: 287, type: !328, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "temphead", scope: !65, file: !66, line: 668, type: !297, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "short_options", scope: !65, file: !66, line: 550, type: !253, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 552, type: !256, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "sort_types", scope: !65, file: !66, line: 619, type: !266, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "sort_args", scope: !65, file: !66, line: 613, type: !269, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "check_types", scope: !65, file: !66, line: 598, type: !278, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "check_args", scope: !65, file: !66, line: 592, type: !281, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "tab", scope: !65, file: !66, line: 351, type: !7, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "temp_dir_alloc", scope: !65, file: !66, line: 335, type: !55, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "temp_dirs", scope: !65, file: !66, line: 329, type: !378, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "eolchar", scope: !65, file: !66, line: 176, type: !10, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "outstat_errno", scope: !786, file: !66, line: 895, type: !7, isLocal: true, isDefinition: true)
!786 = distinct !DISubprogram(name: "get_outstatus", scope: !66, file: !66, line: 893, type: !417, scopeLine: 894, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !313)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "outstat", scope: !786, file: !66, line: 896, type: !384, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "random_md5_state", scope: !65, file: !66, line: 2094, type: !499, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "nmerge", scope: !65, file: !66, line: 371, type: !69, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "merge_buffer_size", scope: !65, file: !66, line: 315, type: !55, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "unit_order", scope: !65, file: !66, line: 1878, type: !486, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "proctab", scope: !65, file: !66, line: 682, type: !549, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "nprocs", scope: !65, file: !66, line: 702, type: !299, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "temptail", scope: !65, file: !66, line: 669, type: !569, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "slashbase", scope: !805, file: !66, line: 848, type: !806, isLocal: true, isDefinition: true)
!805 = distinct !DISubprogram(name: "create_temp_file", scope: !66, file: !66, line: 846, type: !572, scopeLine: 847, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !313)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 96, elements: !333)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "temp_dir_index", scope: !805, file: !66, line: 849, type: !55, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "size_bound", scope: !811, file: !66, line: 1524, type: !55, isLocal: true, isDefinition: true)
!811 = distinct !DISubprogram(name: "sort_buffer_size", scope: !66, file: !66, line: 1518, type: !620, scopeLine: 1521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !313)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "saved_line", scope: !65, file: !66, line: 263, type: !449, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "Version", scope: !816, file: !817, line: 2, type: !88, isLocal: false, isDefinition: true)
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !818, globals: !819, nameTableKind: None)
!817 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!818 = !{!88}
!819 = !{!814}
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !822, file: !872, line: 69, type: !273, isLocal: false, isDefinition: true)
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !824, globals: !871, nameTableKind: None)
!823 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!824 = !{!53, !273, !825, !55, !827, !103, !828, !829, !88, !831, !833, !867, !869, !168}
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !88, !828, !88, !55}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !88, !88, !827}
!831 = !DISubroutineType(types: !832)
!832 = !{null, !828, !88, !55}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !835, file: !4, line: 51, baseType: !7, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !835, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !835, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !835, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !835, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !835, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !835, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !835, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !835, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !835, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !835, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !835, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !835, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !835, file: !4, line: 70, baseType: !851, size: 64, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !835, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !835, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !835, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !835, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !835, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !835, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !835, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !835, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !835, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !835, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !835, file: !4, line: 93, baseType: !851, size: 64, offset: 1344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !835, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !835, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !835, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !835, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!867 = !DISubroutineType(types: !868)
!868 = !{!827, !88, !88, !828, !88, !55, !273}
!869 = !DISubroutineType(types: !870)
!870 = !{!88, !88, !828, !88, !55}
!871 = !{!820}
!872 = !DIFile(filename: "lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "file_name", scope: !875, file: !917, line: 46, type: !88, isLocal: true, isDefinition: true)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !877, globals: !914, nameTableKind: None)
!876 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!877 = !{!306, !88, !878, !103, !168, !880, !7, !318}
!878 = !DISubroutineType(types: !879)
!879 = !{null, !103}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !882, file: !4, line: 51, baseType: !7, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !882, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !882, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !882, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !882, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !882, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !882, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !882, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !882, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !882, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !882, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !882, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !882, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !882, file: !4, line: 70, baseType: !898, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !882, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !882, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !882, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !882, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !882, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !882, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !882, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !882, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !882, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !882, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !882, file: !4, line: 93, baseType: !898, size: 64, offset: 1344)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !882, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !882, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !882, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !882, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!914 = !{!873, !915}
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !875, file: !917, line: 56, type: !103, isLocal: true, isDefinition: true)
!917 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "fillbuf", scope: !920, file: !998, line: 70, type: !942, isLocal: true, isDefinition: true)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !922, globals: !997, nameTableKind: None)
!921 = !DIFile(filename: "./lib/md5.c", directory: "/home/mbarbar/software/coreutils-8.31")
!922 = !{!9, !88, !923, !924, !495, !507, !936, !940, !55, !510, !942, !946, !982, !984, !986, !987, !989, !988, !990, !992}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !362, line: 90, baseType: !57)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !500, line: 69, size: 1248, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934, !935}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !927, file: !500, line: 71, baseType: !495, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !927, file: !500, line: 72, baseType: !495, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !927, file: !500, line: 73, baseType: !495, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !927, file: !500, line: 74, baseType: !495, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !927, file: !500, line: 76, baseType: !507, size: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !927, file: !500, line: 77, baseType: !495, size: 32, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !927, file: !500, line: 78, baseType: !510, size: 1024, offset: 224)
!936 = !DISubroutineType(types: !937)
!937 = !{!53, !938, !53}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!940 = !DISubroutineType(types: !941)
!941 = !{!53, !926, !53}
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 512, elements: !944)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!944 = !{!945}
!945 = !DISubrange(count: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!7, !948, !53}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !950, file: !4, line: 51, baseType: !7, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !950, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !950, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !950, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !950, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !950, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !950, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !950, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !950, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !950, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !950, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !950, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !950, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !950, file: !4, line: 70, baseType: !966, size: 64, offset: 832)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !950, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !950, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !950, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !950, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !950, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !950, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !950, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !950, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !950, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !950, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !950, file: !4, line: 93, baseType: !966, size: 64, offset: 1344)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !950, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !950, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !950, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !950, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!982 = !DISubroutineType(types: !983)
!983 = !{!53, !88, !55, !53}
!984 = !DISubroutineType(types: !985)
!985 = !{null, !339, !55, !926}
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 512, elements: !153)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !9, !495}
!992 = !DISubroutineType(types: !993)
!993 = !{!7, !948, !88, !53, !994}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !995, line: 77, baseType: !996)
!995 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 193, baseType: !31)
!997 = !{!918}
!998 = !DIFile(filename: "lib/md5.c", directory: "/home/mbarbar/software/coreutils-8.31")
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1001, file: !1005, line: 24, type: !318, isLocal: false, isDefinition: true)
!1001 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1002, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !1003, globals: !1004, nameTableKind: None)
!1002 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1003 = !{!318}
!1004 = !{!999}
!1005 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1008, file: !1017, line: 130, type: !1033, isLocal: true, isDefinition: true)
!1008 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1009, producer: "clang version 9.0.0 (git@github.com:mbarbar/tir-clang 965159bbccee6f3dcd2e68d793559c8aa75c7480)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !1010, globals: !1142, nameTableKind: None)
!1009 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1010 = !{!57, !53, !55, !1011, !1014, !1026, !1020, !1055, !1057, !1093, !1047, !1095, !1097, !1099, !1100, !1106, !321, !89, !1108, !1033, !1111, !1113, !1015, !1032, !1044, !1050, !1114, !1116, !1118, !339, !1038, !103, !1121, !7, !1123, !562, !564, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1140}
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!55, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !551, line: 69, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1017, line: 52, size: 640, elements: !1018)
!1017 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1018 = !{!1019, !1025, !1028, !1029, !1030, !1031, !1043, !1046, !1049, !1054}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !1016, file: !1017, line: 57, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !1017, line: 46, size: 128, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1021, file: !1017, line: 48, baseType: !53, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !1017, line: 49, baseType: !1020, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !1016, file: !1017, line: 58, baseType: !1026, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1016, file: !1017, line: 59, baseType: !55, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !1016, file: !1017, line: 60, baseType: !55, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !1016, file: !1017, line: 61, baseType: !55, size: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !1016, file: !1017, line: 64, baseType: !1032, size: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !551, line: 65, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !551, line: 53, size: 160, elements: !1036)
!1036 = !{!1037, !1039, !1040, !1041, !1042}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1035, file: !551, line: 58, baseType: !1038, size: 32)
!1038 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1035, file: !551, line: 59, baseType: !1038, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1035, file: !551, line: 60, baseType: !1038, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1035, file: !551, line: 61, baseType: !1038, size: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1035, file: !551, line: 62, baseType: !103, size: 8, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !1016, file: !1017, line: 71, baseType: !1044, size: 64, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !551, line: 48, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !1016, file: !1017, line: 72, baseType: !1047, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !551, line: 49, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !1016, file: !1017, line: 73, baseType: !1050, size: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !551, line: 50, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !53}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !1016, file: !1017, line: 76, baseType: !1020, size: 64, offset: 576)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!103, !1013}
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1013, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1061, file: !4, line: 51, baseType: !7, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1061, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1061, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1061, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1061, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1061, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1061, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1061, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1061, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1061, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
