; ModuleID = 'sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct.line = type { i8*, i64, i8*, i8* }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.month = type { i8*, i32 }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!0 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1, size: 64)
!1 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !3)
!2 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!5 = !{!6, !8, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !48, !51, !52, !54, !58, !59}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !3, file: !4, line: 51, baseType: !7, size: 32)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !3, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !3, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !3, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !3, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !3, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !3, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !3, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !3, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !3, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !3, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !3, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !3, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !4, line: 36, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !3, file: !4, line: 70, baseType: !25, size: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !3, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !3, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !3, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !3, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !3, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !3, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !3, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !4, line: 43, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !3, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !3, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !4, line: 37, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !3, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !4, line: 38, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !3, file: !4, line: 93, baseType: !25, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !3, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !3, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "llvm9/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/mbarbar/software")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !3, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !3, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !65, file: !66, line: 165, type: !163, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !82, globals: !721, nameTableKind: None)
!66 = !DIFile(filename: "src/sort.c", directory: "/home/mbarbar/software/coreutils-8.31")
!67 = !{!68, !74}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !66, line: 173, baseType: !69, size: 32, elements: !70)
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "bl_start", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "bl_end", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "bl_both", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !75, line: 26, baseType: !69, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/mbarbar/software/coreutils-8.31")
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!82 = !{!53, !83, !69, !88, !9, !7, !33, !0, !90, !93, !96, !60, !99, !102, !105, !108, !111, !114, !117, !120, !123, !126, !129, !132, !135, !138, !141, !144, !147, !150, !153, !163, !10, !55, !176, !179, !37, !180, !183, !186, !215, !223, !227, !321, !324, !89, !334, !337, !340, !341, !344, !347, !350, !353, !355, !357, !360, !363, !366, !367, !370, !373, !376, !379, !380, !383, !386, !389, !392, !393, !396, !57, !397, !161, !400, !403, !406, !424, !427, !430, !441, !442, !445, !448, !451, !452, !455, !457, !458, !463, !465, !415, !467, !468, !471, !474, !477, !478, !481, !482, !485, !486, !487, !498, !521, !524, !527, !529, !530, !533, !536, !539, !541, !544, !552, !555, !558, !559, !562, !540, !563, !564, !568, !581, !582, !585, !588, !411, !421, !590, !494, !492, !591, !417, !592, !595, !599, !602, !612, !613, !614, !615, !589, !616, !657, !659, !29, !661, !664, !624, !666, !667, !674, !676, !678}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !84, line: 72, baseType: !85)
!84 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !7}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 312, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 39)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 568, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 71)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 504, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 63)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1632, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 204)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1688, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 211)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 608, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 76)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2192, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 274)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2224, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 278)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 136, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 17)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 944, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 118)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2216, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 277)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2784, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 348)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1152, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 144)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1728, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 216)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 3624, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 453)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 40, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 5)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 360, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 45)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 432, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 54)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4832, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 604)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1832, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 229)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !66, line: 204, size: 576, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !154, file: !66, line: 206, baseType: !55, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !154, file: !66, line: 207, baseType: !55, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !154, file: !66, line: 208, baseType: !55, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !154, file: !66, line: 209, baseType: !55, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !154, file: !66, line: 210, baseType: !161, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !154, file: !66, line: 211, baseType: !88, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !154, file: !66, line: 212, baseType: !163, size: 8, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !154, file: !66, line: 213, baseType: !163, size: 8, offset: 392)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !154, file: !66, line: 214, baseType: !163, size: 8, offset: 400)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !154, file: !66, line: 217, baseType: !163, size: 8, offset: 408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !154, file: !66, line: 218, baseType: !163, size: 8, offset: 416)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !154, file: !66, line: 220, baseType: !163, size: 8, offset: 424)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !154, file: !66, line: 222, baseType: !163, size: 8, offset: 432)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !154, file: !66, line: 223, baseType: !163, size: 8, offset: 440)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !154, file: !66, line: 224, baseType: !163, size: 8, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !154, file: !66, line: 225, baseType: !163, size: 8, offset: 456)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !66, line: 226, baseType: !153, size: 64, offset: 512)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 80, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 10)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 24)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !189, line: 51, size: 768, elements: !190)
!189 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !188, file: !189, line: 55, baseType: !9, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !188, file: !189, line: 56, baseType: !9, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !188, file: !189, line: 62, baseType: !9, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !188, file: !189, line: 68, baseType: !9, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !188, file: !189, line: 69, baseType: !9, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !188, file: !189, line: 70, baseType: !9, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !188, file: !189, line: 71, baseType: !9, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !188, file: !189, line: 72, baseType: !9, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !188, file: !189, line: 73, baseType: !9, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !188, file: !189, line: 74, baseType: !9, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !188, file: !189, line: 75, baseType: !10, size: 8, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !188, file: !189, line: 76, baseType: !10, size: 8, offset: 648)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !188, file: !189, line: 78, baseType: !10, size: 8, offset: 656)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !188, file: !189, line: 80, baseType: !10, size: 8, offset: 664)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !188, file: !189, line: 82, baseType: !10, size: 8, offset: 672)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !188, file: !189, line: 84, baseType: !10, size: 8, offset: 680)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !188, file: !189, line: 91, baseType: !10, size: 8, offset: 688)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !188, file: !189, line: 92, baseType: !10, size: 8, offset: 696)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !188, file: !189, line: 95, baseType: !10, size: 8, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !188, file: !189, line: 97, baseType: !10, size: 8, offset: 712)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !188, file: !189, line: 99, baseType: !10, size: 8, offset: 720)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !188, file: !189, line: 101, baseType: !10, size: 8, offset: 728)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !188, file: !189, line: 108, baseType: !10, size: 8, offset: 736)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !188, file: !189, line: 109, baseType: !10, size: 8, offset: 744)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !216, line: 7, baseType: !217)
!216 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !218, line: 8, baseType: !219)
!218 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 5, size: 1024, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !219, file: !218, line: 7, baseType: !222, size: 1024)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !177)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 352, elements: !225)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!225 = !{!226}
!226 = !DISubrange(count: 11)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !228, line: 31, size: 64, elements: !238)
!228 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !228, line: 27, size: 1216, elements: !230)
!230 = !{!231, !232, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !229, file: !228, line: 38, baseType: !227, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !229, file: !228, line: 46, baseType: !217, size: 1024, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !229, file: !228, line: 49, baseType: !7, size: 32, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !229, file: !228, line: 52, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null}
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !227, file: !228, line: 34, baseType: !83, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !227, file: !228, line: 36, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !7, !244, !53}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !246, line: 124, baseType: !247)
!246 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 36, size: 1024, elements: !248)
!248 = !{!249, !250, !251, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !247, file: !246, line: 38, baseType: !7, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !247, file: !246, line: 40, baseType: !7, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !247, file: !246, line: 42, baseType: !7, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !247, file: !246, line: 48, baseType: !7, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !247, file: !246, line: 123, baseType: !254, size: 896, offset: 128)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !246, line: 51, size: 896, elements: !255)
!255 = !{!256, !260, !267, !279, !285, !294, !310, !315}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !254, file: !246, line: 53, baseType: !257, size: 896)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 896, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 28)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !254, file: !246, line: 60, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 56, size: 64, elements: !262)
!262 = !{!263, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !261, file: !246, line: 58, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 154, baseType: !7)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !261, file: !246, line: 59, baseType: !266, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 146, baseType: !69)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !254, file: !246, line: 68, baseType: !268, size: 128)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 63, size: 128, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !268, file: !246, line: 65, baseType: !7, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !268, file: !246, line: 66, baseType: !7, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !268, file: !246, line: 67, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !274, line: 30, baseType: !275)
!274 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !274, line: 24, size: 64, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !275, file: !274, line: 26, baseType: !7, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !275, file: !274, line: 27, baseType: !53, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !254, file: !246, line: 76, baseType: !280, size: 128)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 71, size: 128, elements: !281)
!281 = !{!282, !283, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !280, file: !246, line: 73, baseType: !264, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !280, file: !246, line: 74, baseType: !266, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !280, file: !246, line: 75, baseType: !273, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !254, file: !246, line: 86, baseType: !286, size: 256)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 79, size: 256, elements: !287)
!287 = !{!288, !289, !290, !291, !293}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !286, file: !246, line: 81, baseType: !264, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !286, file: !246, line: 82, baseType: !266, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !286, file: !246, line: 83, baseType: !7, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !286, file: !246, line: 84, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !30, line: 156, baseType: !31)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !286, file: !246, line: 85, baseType: !292, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !254, file: !246, line: 105, baseType: !295, size: 256)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 89, size: 256, elements: !296)
!296 = !{!297, !298, !300}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !295, file: !246, line: 91, baseType: !53, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !295, file: !246, line: 93, baseType: !299, size: 16, offset: 64)
!299 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !295, file: !246, line: 104, baseType: !301, size: 128, offset: 128)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !246, line: 94, size: 128, elements: !302)
!302 = !{!303, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !301, file: !246, line: 101, baseType: !304, size: 128)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !246, line: 97, size: 128, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !304, file: !246, line: 99, baseType: !53, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !304, file: !246, line: 100, baseType: !53, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !301, file: !246, line: 103, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !30, line: 42, baseType: !69)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !254, file: !246, line: 112, baseType: !311, size: 128)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 108, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !311, file: !246, line: 110, baseType: !31, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !311, file: !246, line: 111, baseType: !7, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !254, file: !246, line: 121, baseType: !316, size: 128)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !246, line: 116, size: 128, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !316, file: !246, line: 118, baseType: !53, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !316, file: !246, line: 119, baseType: !7, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !316, file: !246, line: 120, baseType: !69, size: 32, offset: 96)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 248, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 31)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 7936, elements: !322)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !327, line: 50, size: 256, elements: !328)
!327 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!328 = !{!329, !330, !331, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !327, line: 52, baseType: !88, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !326, file: !327, line: 55, baseType: !7, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !327, line: 56, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !326, file: !327, line: 57, baseType: !7, size: 32, offset: 192)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 200, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 25)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 2)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 88, elements: !225)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 184, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 23)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 240, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 30)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 48, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 6)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 56, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 7)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 448, elements: !351)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !356, line: 55, baseType: !235)
!356 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/mbarbar/software/coreutils-8.31")
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 24, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 3)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 8)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 256, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 4)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 24, elements: !358)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 296, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 37)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 168, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 21)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 32)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 272, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 34)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 184, elements: !342)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 144, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 18)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 14)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 104, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 13)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 12)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !364)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 416, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 52)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 248, elements: !322)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 304, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 38)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 376, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 47)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 424, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 53)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !66, line: 672, size: 128, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !407, file: !66, line: 675, baseType: !88, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !407, file: !66, line: 678, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !66, line: 661, size: 128, elements: !413)
!413 = !{!414, !416, !419, !420}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !66, line: 663, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !411)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !412, file: !66, line: 664, baseType: !417, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !418, line: 38, baseType: !264)
!418 = !DIFile(filename: "/usr/include/sched.h", directory: "")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !412, file: !66, line: 665, baseType: !10, size: 8, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !66, line: 666, baseType: !421, offset: 104)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: -1)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 448, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 56)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 600, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 75)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 896, elements: !351)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !434, file: !433, line: 633, size: 128, elements: !438)
!433 = !DIFile(filename: "src/system.h", directory: "/home/mbarbar/software/coreutils-8.31")
!434 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !433, file: !433, line: 631, type: !435, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !88}
!437 = !{}
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !432, file: !433, line: 633, baseType: !88, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !432, file: !433, line: 633, baseType: !88, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 40)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 216, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 27)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 408, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 51)
!451 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 2048, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 256)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !453)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 1536, elements: !390)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "month", file: !66, line: 229, size: 128, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !459, file: !66, line: 231, baseType: !88, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !459, file: !66, line: 232, baseType: !7, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !469, line: 102, baseType: !470)
!469 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !30, line: 73, baseType: !57)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 264, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 33)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 280, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 35)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !479, line: 131, baseType: !480)
!479 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !30, line: 157, baseType: !57)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 224, elements: !258)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 384, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 48)
!485 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !489, line: 46, size: 1152, elements: !490)
!489 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!490 = !{!491, !493, !495, !497, !499, !500, !502, !503, !504, !505, !507, !509, !517, !518, !519}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !488, file: !489, line: 48, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 145, baseType: !57)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !488, file: !489, line: 53, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 148, baseType: !57)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !488, file: !489, line: 61, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 151, baseType: !57)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !488, file: !489, line: 62, baseType: !498, size: 32, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 150, baseType: !69)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !488, file: !489, line: 64, baseType: !266, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !488, file: !489, line: 65, baseType: !501, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 147, baseType: !69)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !488, file: !489, line: 67, baseType: !7, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !488, file: !489, line: 69, baseType: !492, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !488, file: !489, line: 74, baseType: !29, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !488, file: !489, line: 78, baseType: !506, size: 64, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 174, baseType: !31)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !488, file: !489, line: 80, baseType: !508, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 179, baseType: !31)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !488, file: !489, line: 91, baseType: !510, size: 128, offset: 576)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !511, line: 9, size: 128, elements: !512)
!511 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!512 = !{!513, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !510, file: !511, line: 11, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !510, file: !511, line: 12, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !488, file: !489, line: 92, baseType: !510, size: 128, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !488, file: !489, line: 93, baseType: !510, size: 128, offset: 832)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !488, file: !489, line: 106, baseType: !520, size: 192, offset: 960)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 192, elements: !358)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 328, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 41)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 368, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 46)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 368, elements: !525)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 344, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 43)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 576, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 72)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 208, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 26)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 128, elements: !177)
!540 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "randread_source", file: !543, line: 25, flags: DIFlagFwdDecl)
!543 = !DIFile(filename: "./lib/randread.h", directory: "/home/mbarbar/software/coreutils-8.31")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !66, line: 179, size: 256, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !546, file: !66, line: 181, baseType: !9, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !546, file: !66, line: 182, baseType: !55, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "keybeg", scope: !546, file: !66, line: 183, baseType: !9, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "keylim", scope: !546, file: !66, line: 184, baseType: !9, size: 64, offset: 192)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 176, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 22)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 120, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 15)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32000, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 4000)
!562 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !453)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 256, elements: !567)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !566, line: 26, baseType: !309)
!566 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!567 = !{!339, !365}
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 2496, elements: !338)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !570, line: 69, size: 1248, elements: !571)
!570 = !DIFile(filename: "./lib/md5.h", directory: "/home/mbarbar/software/coreutils-8.31")
!571 = !{!572, !573, !574, !575, !576, !578, !579}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !569, file: !570, line: 71, baseType: !565, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !569, file: !570, line: 72, baseType: !565, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !569, file: !570, line: 73, baseType: !565, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !569, file: !570, line: 74, baseType: !565, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !569, file: !570, line: 76, baseType: !577, size: 64, offset: 128)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 64, elements: !338)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !569, file: !570, line: 77, baseType: !565, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !569, file: !570, line: 78, baseType: !580, size: 1024, offset: 224)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1024, elements: !374)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !364)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 232, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 29)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 336, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 42)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !0, size: 64)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !338)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 352, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 44)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !597, line: 69, baseType: !598)
!597 = !DIFile(filename: "./lib/hash.h", directory: "/home/mbarbar/software/coreutils-8.31")
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !597, line: 67, flags: DIFlagFwdDecl)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 72, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 9)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !66, line: 188, size: 448, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !603, file: !66, line: 190, baseType: !9, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !603, file: !66, line: 195, baseType: !55, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !603, file: !66, line: 196, baseType: !55, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !603, file: !66, line: 197, baseType: !55, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !603, file: !66, line: 198, baseType: !55, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "line_bytes", scope: !603, file: !66, line: 199, baseType: !55, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !603, file: !66, line: 200, baseType: !163, size: 8, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 96, elements: !390)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "merge_node", file: !66, line: 236, size: 1024, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !625, !626, !627, !628, !629, !630, !631, !632}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !617, file: !66, line: 238, baseType: !558, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !617, file: !66, line: 239, baseType: !558, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "end_lo", scope: !617, file: !66, line: 240, baseType: !558, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "end_hi", scope: !617, file: !66, line: 241, baseType: !558, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !617, file: !66, line: 242, baseType: !624, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nlo", scope: !617, file: !66, line: 243, baseType: !55, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nhi", scope: !617, file: !66, line: 244, baseType: !55, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !617, file: !66, line: 245, baseType: !616, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lo_child", scope: !617, file: !66, line: 246, baseType: !616, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "hi_child", scope: !617, file: !66, line: 247, baseType: !616, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !617, file: !66, line: 248, baseType: !69, size: 32, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !617, file: !66, line: 249, baseType: !163, size: 8, offset: 672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !617, file: !66, line: 250, baseType: !633, size: 320, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !634, line: 72, baseType: !635)
!634 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !634, line: 67, size: 320, elements: !636)
!636 = !{!637, !655, !656}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !635, file: !634, line: 69, baseType: !638, size: 320)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !639, line: 118, size: 320, elements: !640)
!639 = !DIFile(filename: "/usr/include/bits/thread-shared-types.h", directory: "")
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !638, file: !639, line: 120, baseType: !7, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !638, file: !639, line: 121, baseType: !69, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !638, file: !639, line: 122, baseType: !7, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !638, file: !639, line: 124, baseType: !69, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !638, file: !639, line: 148, baseType: !7, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !638, file: !639, line: 154, baseType: !299, size: 16, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !638, file: !639, line: 154, baseType: !299, size: 16, offset: 176)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !638, file: !639, line: 155, baseType: !649, size: 128, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !639, line: 86, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !639, line: 82, size: 128, elements: !651)
!651 = !{!652, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !650, file: !639, line: 84, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !650, file: !639, line: 85, baseType: !653, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !635, file: !634, line: 70, baseType: !442, size: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !635, file: !634, line: 71, baseType: !31, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !658, line: 85, baseType: !29)
!658 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !0)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "heap", file: !663, line: 23, flags: DIFlagFwdDecl)
!663 = !DIFile(filename: "./lib/heap.h", directory: "/home/mbarbar/software/coreutils-8.31")
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !634, line: 27, baseType: !57)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_args", file: !66, line: 3585, size: 448, elements: !670)
!670 = !{!671, !672, !673, !675, !677, !719, !720}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !669, file: !66, line: 3589, baseType: !558, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !669, file: !66, line: 3592, baseType: !55, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "total_lines", scope: !669, file: !66, line: 3595, baseType: !674, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !669, file: !66, line: 3599, baseType: !676, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !669, file: !66, line: 3603, baseType: !678, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "merge_node_queue", file: !66, line: 254, size: 768, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "priority_queue", scope: !680, file: !66, line: 256, baseType: !661, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !680, file: !66, line: 257, baseType: !633, size: 320, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !680, file: !66, line: 258, baseType: !685, size: 384, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !634, line: 80, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !634, line: 75, size: 384, elements: !687)
!687 = !{!688, !716, !717}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !686, file: !634, line: 77, baseType: !689, size: 384)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !639, line: 171, size: 384, elements: !690)
!690 = !{!691, !701, !710, !712, !713, !714, !715}
!691 = !DIDerivedType(tag: DW_TAG_member, scope: !689, file: !639, line: 173, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !639, line: 173, size: 64, elements: !693)
!693 = !{!694, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !692, file: !639, line: 175, baseType: !695, size: 64)
!695 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !692, file: !639, line: 180, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !639, line: 176, size: 64, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !697, file: !639, line: 178, baseType: !69, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !697, file: !639, line: 179, baseType: !69, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, scope: !689, file: !639, line: 182, baseType: !702, size: 64, offset: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !639, line: 182, size: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !702, file: !639, line: 184, baseType: !695, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !702, file: !639, line: 189, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !639, line: 185, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !706, file: !639, line: 187, baseType: !69, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !706, file: !639, line: 188, baseType: !69, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !689, file: !639, line: 191, baseType: !711, size: 64, offset: 128)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !338)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !689, file: !639, line: 192, baseType: !711, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !689, file: !639, line: 193, baseType: !69, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !689, file: !639, line: 194, baseType: !69, size: 32, offset: 288)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !689, file: !639, line: 195, baseType: !711, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !686, file: !634, line: 78, baseType: !482, size: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !686, file: !634, line: 79, baseType: !718, size: 64)
!718 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tfp", scope: !669, file: !66, line: 3607, baseType: !0, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "output_temp", scope: !669, file: !66, line: 3608, baseType: !88, size: 64, offset: 384)
!721 = !{!722, !727, !729, !731, !733, !63, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !757, !759, !761, !763, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !789, !794, !796, !798, !800, !802, !804, !806, !808, !810, !815, !817, !822}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "sig", scope: !724, file: !66, line: 4257, type: !223, isLocal: true, isDefinition: true)
!724 = distinct !DISubprogram(name: "main", scope: !66, file: !66, line: 4199, type: !725, scopeLine: 4200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !65, retainedNodes: !437)
!725 = !DISubroutineType(types: !726)
!726 = !{!7, !7, !179}
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "opts", scope: !724, file: !66, line: 4677, type: !180, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "opts", scope: !724, file: !66, line: 4733, type: !366, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "decimal_point", scope: !65, file: !66, line: 159, type: !7, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !65, file: !66, line: 162, type: !7, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !65, file: !66, line: 167, type: !163, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "sort_size", scope: !65, file: !66, line: 319, type: !55, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !65, file: !66, line: 332, type: !55, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "reverse", scope: !65, file: !66, line: 338, type: !163, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "stable", scope: !65, file: !66, line: 343, type: !163, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "unique", scope: !65, file: !66, line: 355, type: !163, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !65, file: !66, line: 358, type: !163, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "keylist", scope: !65, file: !66, line: 361, type: !153, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "compress_program", scope: !65, file: !66, line: 364, type: !88, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "debug", scope: !65, file: !66, line: 367, type: !163, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "caught_signals", scope: !65, file: !66, line: 627, type: !215, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "blanks", scope: !65, file: !66, line: 272, type: !452, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "nonprinting", scope: !65, file: !66, line: 275, type: !452, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "nondictionary", scope: !65, file: !66, line: 278, type: !452, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "fold_toupper", scope: !65, file: !66, line: 281, type: !457, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "monthtab", scope: !65, file: !66, line: 287, type: !458, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "temphead", scope: !65, file: !66, line: 668, type: !415, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "short_options", scope: !65, file: !66, line: 550, type: !321, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "long_options", scope: !65, file: !66, line: 552, type: !324, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "sort_types", scope: !65, file: !66, line: 619, type: !347, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "sort_args", scope: !65, file: !66, line: 613, type: !353, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "check_types", scope: !65, file: !66, line: 598, type: !357, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "check_args", scope: !65, file: !66, line: 592, type: !363, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "tab", scope: !65, file: !66, line: 351, type: !7, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "temp_dir_alloc", scope: !65, file: !66, line: 335, type: !55, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "temp_dirs", scope: !65, file: !66, line: 329, type: !486, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "eolchar", scope: !65, file: !66, line: 176, type: !10, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "outstat_errno", scope: !791, file: !66, line: 895, type: !7, isLocal: true, isDefinition: true)
!791 = distinct !DISubprogram(name: "get_outstatus", scope: !66, file: !66, line: 893, type: !792, scopeLine: 894, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !437)
!792 = !DISubroutineType(types: !793)
!793 = !{!487}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "outstat", scope: !791, file: !66, line: 896, type: !488, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "random_md5_state", scope: !65, file: !66, line: 2094, type: !569, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "nmerge", scope: !65, file: !66, line: 371, type: !69, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "merge_buffer_size", scope: !65, file: !66, line: 315, type: !55, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "unit_order", scope: !65, file: !66, line: 1878, type: !563, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "proctab", scope: !65, file: !66, line: 682, type: !595, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "nprocs", scope: !65, file: !66, line: 702, type: !417, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "temptail", scope: !65, file: !66, line: 669, type: !614, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "slashbase", scope: !812, file: !66, line: 848, type: !615, isLocal: true, isDefinition: true)
!812 = distinct !DISubprogram(name: "create_temp_file", scope: !66, file: !66, line: 846, type: !813, scopeLine: 847, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !437)
!813 = !DISubroutineType(types: !814)
!814 = !{!411, !332, !163}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "temp_dir_index", scope: !812, file: !66, line: 849, type: !55, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "size_bound", scope: !819, file: !66, line: 1524, type: !55, isLocal: true, isDefinition: true)
!819 = distinct !DISubprogram(name: "sort_buffer_size", scope: !66, file: !66, line: 1518, type: !820, scopeLine: 1521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !437)
!820 = !DISubroutineType(types: !821)
!821 = !{!55, !659, !55, !588, !55, !55}
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "saved_line", scope: !65, file: !66, line: 263, type: !546, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "Version", scope: !826, file: !827, line: 2, type: !88, isLocal: false, isDefinition: true)
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !827, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !828, globals: !829, nameTableKind: None)
!827 = !DIFile(filename: "src/version.c", directory: "/home/mbarbar/software/coreutils-8.31")
!828 = !{!88}
!829 = !{!824}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !832, file: !872, line: 69, type: !355, isLocal: false, isDefinition: true)
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !834, globals: !871, nameTableKind: None)
!833 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!834 = !{!53, !355, !55, !835, !163, !836, !89, !88, !445, !582, !370, !837, !360, !135}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !31)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !839, file: !4, line: 51, baseType: !7, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !839, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !839, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !839, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !839, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !839, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !839, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !839, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !839, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !839, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !839, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !839, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !839, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !839, file: !4, line: 70, baseType: !855, size: 64, offset: 832)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !839, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !839, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !839, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !839, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !839, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !839, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !839, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !839, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !839, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !839, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !839, file: !4, line: 93, baseType: !855, size: 64, offset: 1344)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !839, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !839, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !839, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !839, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!871 = !{!830}
!872 = !DIFile(filename: "lib/argmatch.c", directory: "/home/mbarbar/software/coreutils-8.31")
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "file_name", scope: !875, file: !915, line: 46, type: !88, isLocal: true, isDefinition: true)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !877, globals: !912, nameTableKind: None)
!876 = !DIFile(filename: "./lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!877 = !{!88, !163, !878, !7, !389, !350, !366, !451}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !880, file: !4, line: 51, baseType: !7, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !880, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !880, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !880, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !880, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !880, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !880, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !880, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !880, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !880, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !880, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !880, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !880, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !880, file: !4, line: 70, baseType: !896, size: 64, offset: 832)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !880, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !880, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !880, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !880, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !880, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !880, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !880, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !880, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !880, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !880, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !880, file: !4, line: 93, baseType: !896, size: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !880, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !880, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !880, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !880, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!912 = !{!873, !913}
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !875, file: !915, line: 56, type: !163, isLocal: true, isDefinition: true)
!915 = !DIFile(filename: "lib/closeout.c", directory: "/home/mbarbar/software/coreutils-8.31")
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "fillbuf", scope: !918, file: !929, line: 70, type: !922, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !920, globals: !928, nameTableKind: None)
!919 = !DIFile(filename: "./lib/md5.c", directory: "/home/mbarbar/software/coreutils-8.31")
!920 = !{!9, !88, !921, !565, !577, !10, !55, !580, !922, !392, !89, !924, !925, !926, !927}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !469, line: 90, baseType: !57)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 512, elements: !139)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 512, elements: !177)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!928 = !{!916}
!929 = !DIFile(filename: "lib/md5.c", directory: "/home/mbarbar/software/coreutils-8.31")
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "exit_failure", scope: !932, file: !936, line: 24, type: !451, isLocal: false, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !934, globals: !935, nameTableKind: None)
!933 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!934 = !{!451}
!935 = !{!930}
!936 = !DIFile(filename: "lib/exitfail.c", directory: "/home/mbarbar/software/coreutils-8.31")
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "default_tuning", scope: !939, file: !945, line: 130, type: !961, isLocal: true, isDefinition: true)
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !941, globals: !991, nameTableKind: None)
!940 = !DIFile(filename: "./lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!941 = !{!57, !53, !55, !942, !954, !948, !183, !471, !979, !989, !540, !89, !961, !990, !943, !960, !972, !984, !976, !966, !163, !7}
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !597, line: 69, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !945, line: 52, size: 640, elements: !946)
!945 = !DIFile(filename: "lib/hash.c", directory: "/home/mbarbar/software/coreutils-8.31")
!946 = !{!947, !953, !956, !957, !958, !959, !971, !978, !983, !988}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !944, file: !945, line: 57, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_entry", file: !945, line: 46, size: 128, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !949, file: !945, line: 48, baseType: !53, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !945, line: 49, baseType: !948, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_limit", scope: !944, file: !945, line: 58, baseType: !954, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !944, file: !945, line: 59, baseType: !55, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets_used", scope: !944, file: !945, line: 60, baseType: !55, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "n_entries", scope: !944, file: !945, line: 61, baseType: !55, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "tuning", scope: !944, file: !945, line: 64, baseType: !960, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !597, line: 65, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !597, line: 53, size: 160, elements: !964)
!964 = !{!965, !967, !968, !969, !970}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !963, file: !597, line: 58, baseType: !966, size: 32)
!966 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !963, file: !597, line: 59, baseType: !966, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !963, file: !597, line: 60, baseType: !966, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !963, file: !597, line: 61, baseType: !966, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !963, file: !597, line: 62, baseType: !163, size: 8, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "hasher", scope: !944, file: !945, line: 71, baseType: !972, size: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_hasher", file: !597, line: 48, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!55, !976, !55}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !944, file: !945, line: 72, baseType: !979, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_comparator", file: !597, line: 49, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!163, !976, !976}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "data_freer", scope: !944, file: !945, line: 73, baseType: !984, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_data_freer", file: !597, line: 50, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !53}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "free_entry_list", scope: !944, file: !945, line: 76, baseType: !948, size: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!991 = !{!937}
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "have_pipe2_really", scope: !994, file: !995, line: 55, type: !7, isLocal: true, isDefinition: true)
!994 = distinct !DISubprogram(name: "rpl_pipe2", scope: !995, file: !995, line: 40, type: !996, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !998, retainedNodes: !437)
!995 = !DIFile(filename: "lib/pipe2.c", directory: "/home/mbarbar/software/coreutils-8.31")
!996 = !DISubroutineType(types: !997)
!997 = !{!7, !332, !7}
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !1000, globals: !1001, nameTableKind: None)
!999 = !DIFile(filename: "./lib/pipe2.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1000 = !{!591, !7}
!1001 = !{!992}
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "program_name", scope: !1004, file: !1042, line: 33, type: !88, isLocal: false, isDefinition: true)
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1005, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !1006, globals: !1041, nameTableKind: None)
!1005 = !DIFile(filename: "./lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1006 = !{!53, !9, !88, !424, !1007, !89, !360, !392}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2, line: 7, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !4, line: 49, size: 1728, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1009, file: !4, line: 51, baseType: !7, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1009, file: !4, line: 54, baseType: !9, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1009, file: !4, line: 55, baseType: !9, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1009, file: !4, line: 56, baseType: !9, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1009, file: !4, line: 57, baseType: !9, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1009, file: !4, line: 58, baseType: !9, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1009, file: !4, line: 59, baseType: !9, size: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1009, file: !4, line: 60, baseType: !9, size: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1009, file: !4, line: 61, baseType: !9, size: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1009, file: !4, line: 64, baseType: !9, size: 64, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1009, file: !4, line: 65, baseType: !9, size: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1009, file: !4, line: 66, baseType: !9, size: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1009, file: !4, line: 68, baseType: !22, size: 64, offset: 768)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1009, file: !4, line: 70, baseType: !1025, size: 64, offset: 832)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1009, file: !4, line: 72, baseType: !7, size: 32, offset: 896)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1009, file: !4, line: 73, baseType: !7, size: 32, offset: 928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1009, file: !4, line: 74, baseType: !29, size: 64, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1009, file: !4, line: 77, baseType: !33, size: 16, offset: 1024)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1009, file: !4, line: 78, baseType: !35, size: 8, offset: 1040)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1009, file: !4, line: 79, baseType: !37, size: 8, offset: 1048)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1009, file: !4, line: 81, baseType: !41, size: 64, offset: 1088)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1009, file: !4, line: 89, baseType: !44, size: 64, offset: 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1009, file: !4, line: 91, baseType: !46, size: 64, offset: 1216)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1009, file: !4, line: 92, baseType: !49, size: 64, offset: 1280)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1009, file: !4, line: 93, baseType: !1025, size: 64, offset: 1344)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1009, file: !4, line: 94, baseType: !53, size: 64, offset: 1408)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1009, file: !4, line: 95, baseType: !55, size: 64, offset: 1472)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1009, file: !4, line: 96, baseType: !7, size: 32, offset: 1536)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1009, file: !4, line: 98, baseType: !60, size: 160, offset: 1568)
!1041 = !{!1002}
!1042 = !DIFile(filename: "lib/progname.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1045, file: !1068, line: 85, type: !1063, isLocal: false, isDefinition: true)
!1045 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1046, producer: "clang version 9.0.0 (https://github.com/mbarbar/tir-clang d012922f3e8c9bc45ccedab14991e1215aab9113)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1047, retainedTypes: !1062, globals: !1101, nameTableKind: None)
!1046 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/mbarbar/software/coreutils-8.31")
!1047 = !{!1048}
